{"Symbol": "AAP", "AssetType": "Common Stock", "Name": "Advance Auto Parts, Inc", "Description": "Advance Auto Parts, Inc. provides automotive replacement parts, accessories, batteries, and maintenance items for domestic and imported cars, vans, sport utility vehicles, and light and heavy duty trucks. The company offers battery accessories; belts and hoses; brakes and brake pads; chassis and climate control parts; clutches and drive shafts; engines and engine parts; exhaust systems and parts; hub assemblies; ignition components and wires; radiators and cooling parts; starters and alternators; and steering and alignment parts. It also offers air conditioning chemicals and accessories; air fresheners; antifreeze and washer fluids; electrical wires and fuses; electronics; floor mats, seat covers, and interior accessories; hand and specialty tools; lighting products; performance parts; sealants, adhesives and compounds; tire repair accessories; vent shades, mirrors and exterior accessories; washes, waxes and cleaning supplies; and wiper blades. In addition, the company offers air filters; fuel and oil additives; fuel filters; grease and lubricants; motor oils; oil filters, part cleaners and treatments; and transmission fluids for engine maintenance. Further, it offers battery and wiper installation; engine light scanning checking; electrical system testing; video clinic; oil and battery recycling; and loaner tool program services. Additionally, the company sells its products through its Website. It serves professional installers and do-it-yourself customers. Advance Auto Parts, Inc. operates its stores under the Advance Auto Parts, Autopart International, Carquest, and Worldpac brand names. As of December 28, 2019, it operated 4,877 stores and 160 branches in the United States, Puerto Rico, the U.S. Virgin Islands, and Canada; and served 1,253 independently owned Carquest branded stores in Mexico, the Bahamas, Turks and Caicos, and the British Virgin Islands. The company was founded in 1929 and is based in Raleigh, North Carolina.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Specialty Retail", "Address": "2635 East Millbrook Road, Raleigh, NC, United States, 27604", "FullTimeEmployees": "39000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "10700612608", "EBITDA": "950713024", "PERatio": "23.8031", "PEGRatio": "1.4423", "BookValue": "54.26", "DividendPerShare": "1", "DividendYield": "0.0065", "EPS": "6.491", "RevenuePerShareTTM": "138.35", "ProfitMargin": "0.0471", "OperatingMarginTTM": "0.0728", "ReturnOnAssetsTTM": "0.0377", "ReturnOnEquityTTM": "0.1225", "RevenueTTM": "9623982080", "GrossProfitTTM": "4258091000", "DilutedEPSTTM": "6.491", "QuarterlyEarningsGrowthYOY": "0.584", "QuarterlyRevenueGrowthYOY": "0.073", "AnalystTargetPrice": "171.15", "TrailingPE": "23.8031", "ForwardPE": "21.2314", "PriceToSalesRatioTTM": "1.1223", "PriceToBookRatio": "2.8705", "EVToRevenue": "1.3339", "EVToEBITDA": "14.4926", "Beta": "1.3082", "52WeekHigh": "171.43", "52WeekLow": "71.3286", "50DayMovingAverage": "151.0011", "200DayMovingAverage": "131.4459", "SharesOutstanding": "69138800", "SharesFloat": "64603365", "SharesShort": "1964511", "SharesShortPriorMonth": "2572367", "ShortRatio": "2.49", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0333", "PercentInsiders": "0.341", "PercentInstitutions": "104.09", "ForwardAnnualDividendRate": "1", "ForwardAnnualDividendYield": "0.0065", "PayoutRatio": "0.0954", "DividendDate": "2020-07-03", "ExDividendDate": "2020-09-17", "LastSplitFactor": "3:2", "LastSplitDate": "2005-09-26"}