{"Symbol": "BWA", "AssetType": "Common Stock", "Name": "BorgWarner Inc", "Description": "BorgWarner Inc. provides solutions for combustion, hybrid, and electric vehicles worldwide. The company's Engine segment offers turbocharger and turbocharger actuators; eBoosters; and timing systems products, including timing chains, variable cam timing, crankshaft and camshaft sprockets, tensioners, guides and snubbers, front-wheel drive transmission chains, four-wheel drive chains, and hybrid power transmission chains. It also provides emissions systems, such as electric air pumps and exhaust gas recirculation (EGR) modules, EGR coolers and valves, glow plugs, and instant starting systems; thermal systems products comprising viscous fan drives, polymer fans, coolant pumps, cabin heaters, battery heaters, and battery charging; and gasoline ignition technologies. The company's Drivetrain segment offers friction and mechanical products that include dual and friction clutch modules, friction and separator plates, transmission bands, torque converter and one-way clutches, and torsional vibration dampers. It also provides electro-hydraulic solenoids, transmission solenoid modules, and dual clutch control modules; rear-wheel drive/all-wheel drive (AWD) transfer case systems, front wheel drive-AWD coupling systems, and cross-axle coupling systems; starters, alternators, and hybrid electric motors; and motor controllers, battery chargers, and uninterrupted power source systems. The company sells its products to original equipment manufacturers of light vehicles, which comprise passenger cars, sport-utility vehicles, vans, and light trucks; commercial vehicles, including medium-duty and heavy-duty trucks, and buses; and off-highway vehicles, such as agricultural and construction machinery, and marine applications, as well as to tier one vehicle systems suppliers and the aftermarket for light, commercial, and off-highway vehicles. The company was formerly known as Borg-Warner Automotive, Inc. BorgWarner Inc. was founded in 1987 and is headquartered in Auburn Hills, Michigan.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Auto Parts", "Address": "3850 Hamlin Road, Auburn Hills, MI, United States, 48326", "FullTimeEmployees": "29000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "8586533376", "EBITDA": "1314000000", "PERatio": "18.8704", "PEGRatio": "2.733", "BookValue": "22.248", "DividendPerShare": "0.68", "DividendYield": "0.0167", "EPS": "2.161", "RevenuePerShareTTM": "42.598", "ProfitMargin": "0.0508", "OperatingMarginTTM": "0.0988", "ReturnOnAssetsTTM": "0.0526", "ReturnOnEquityTTM": "0.1073", "RevenueTTM": "8755999744", "GrossProfitTTM": "2101000000", "DilutedEPSTTM": "2.161", "QuarterlyEarningsGrowthYOY": "-0.186", "QuarterlyRevenueGrowthYOY": "-0.441", "AnalystTargetPrice": "45", "TrailingPE": "18.8704", "ForwardPE": "20.8333", "PriceToSalesRatioTTM": "0.9613", "PriceToBookRatio": "1.8321", "EVToRevenue": "1.0854", "EVToEBITDA": "7.0398", "Beta": "1.7407", "52WeekHigh": "46.6", "52WeekLow": "17", "50DayMovingAverage": "39.1358", "200DayMovingAverage": "32.0813", "SharesOutstanding": "207310000", "SharesFloat": "205540190", "SharesShort": "18450804", "SharesShortPriorMonth": "20704974", "ShortRatio": "6.54", "ShortPercentOutstanding": "0.09", "ShortPercentFloat": "0.1006", "PercentInsiders": "0.512", "PercentInstitutions": "96.445", "ForwardAnnualDividendRate": "0.68", "ForwardAnnualDividendYield": "0.0167", "PayoutRatio": "0.3148", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-31", "LastSplitFactor": "2:1", "LastSplitDate": "2013-12-17"}