{"Symbol": "FDX", "AssetType": "Common Stock", "Name": "FedEx Corporation", "Description": "FedEx Corporation provides transportation, e-commerce, and business services worldwide. Its FedEx Express segment offers shipping services for delivery of packages and freight. Its FedEx Ground segment offers business and residential money-back guaranteed ground package delivery services; and consolidates and delivers low-weight and less time-sensitive business-to-consumer packages. Its FedEx Freight segment offers less-than-truckload and other freight delivery services. As of May 31, 2020, this segment had approximately 30,000 vehicles and 373 service centers. Its FedEx Services segment provides sales, marketing, information technology, communications, customer service, technical support, billing and collection, and other back-office support services. It also offers FedEx Mobile, a suite of solutions to track packages, create shipping labels, view account-specific rate quotes, and access drop-off location information; FedEx Office, a suite of printing and shipping management solutions, including digital printing, professional finishing, document creation, design, direct mail, signs and graphics, custom-printed boxes, copying, computer rental, Wi-Fi, and corporate print solutions; and packing services, supplies, and boxes, as well as FedEx Express and FedEx Ground shipping services. Its Corporate, Other and Eliminations segment offers international trade services in customs brokerage, and ocean and air freight forwarding services; cross-border enablement and technology solutions, and e-commerce transportation solutions; integrated supply chain management solutions; time-critical shipment services; and critical inventory and service parts logistics, and technology repair. It offers international trade advisory services, including assistance with customs-trade partnership against terrorism program; and publishes customs duty and tax information. It has a strategic alliance with Microsoft Corp. The company was founded in 1971 and is headquartered in Memphis, Tennessee.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Integrated Freight & Logistics", "Address": "942 South Shady Grove Road, Memphis, TN, United States, 38120", "FullTimeEmployees": "324000", "FiscalYearEnd": "May", "LatestQuarter": "2020-05-31", "MarketCapitalization": "58137128960", "EBITDA": "6344999936", "PERatio": "44.5327", "PEGRatio": "1.4802", "BookValue": "69.84", "DividendPerShare": "2.6", "DividendYield": "0.0119", "EPS": "4.9", "RevenuePerShareTTM": "265.199", "ProfitMargin": "0.0186", "OperatingMarginTTM": "0.0394", "ReturnOnAssetsTTM": "0.0267", "ReturnOnEquityTTM": "0.0713", "RevenueTTM": "69217001472", "GrossProfitTTM": "16837000000", "DilutedEPSTTM": "4.9", "QuarterlyEarningsGrowthYOY": "-0.571", "QuarterlyRevenueGrowthYOY": "-0.025", "AnalystTargetPrice": "192.44", "TrailingPE": "44.5327", "ForwardPE": "21.097", "PriceToSalesRatioTTM": "0.826", "PriceToBookRatio": "3.1249", "EVToRevenue": "1.2773", "EVToEBITDA": "14.8439", "Beta": "1.3857", "52WeekHigh": "223.66", "52WeekLow": "88.69", "50DayMovingAverage": "184.6464", "200DayMovingAverage": "143.5084", "SharesOutstanding": "261996992", "SharesFloat": "241482752", "SharesShort": "5164806", "SharesShortPriorMonth": "5384053", "ShortRatio": "1.56", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.024", "PercentInsiders": "7.718", "PercentInstitutions": "75.089", "ForwardAnnualDividendRate": "2.6", "ForwardAnnualDividendYield": "0.0119", "PayoutRatio": "0.5306", "DividendDate": "2020-10-01", "ExDividendDate": "2020-09-03", "LastSplitFactor": "2:1", "LastSplitDate": "1999-05-07"}