{"Symbol": "FTV", "AssetType": "Common Stock", "Name": "Fortive Corporation", "Description": "Fortive Corporation designs, develops, manufactures, markets, and services professional and engineered products, software, and services worldwide. Its Professional Instrumentation segment provides test tools, and thermal imaging and calibration equipment for electrical, industrial, electronic, and calibration applications; online condition-based monitoring equipment; portable gas detection equipment, consumables, and software as a service offerings; subscription-based technical, analytical, and compliance services; and software, data analytics, and services for critical infrastructure in utility, industrial, energy, construction, facilities management, public safety, mining, and healthcare applications, as well as environmental, health, and safety applications. This segment also provides product realization services and products that help developers and engineers across the end-to-end product creation cycle from concepts to finished products; materials components; devices that sense, monitor, and control operational or manufacturing variables; and critical sterilization and disinfection solutions. It markets its products and services under the ACCRUENT, FLUKE, FLUKE BIOMEDICAL, FLUKE NETWORKS, GORDIAN, INDUSTRIAL SCIENTIFIC, INTELEX, LANDAUER, PRUFTECHNIK, QUALITROL, INVETECH, KEITHLEY, PACIFIC SCIENTIFIC, SONIX, and TEKTRONIX brands. The company's Industrial Technologies segment offers solutions and services for use in fuel dispensing, remote fuel management, point-of-sale and payment systems, environmental compliance, vehicle tracking, and fleet and traffic management under the ANGI, GASBOY, GILBARCO, GILBARCO AUTOTANK, ORPAK, VEEDER-ROOT, and TELETRAC NAVMAN brands. This segment also offers professional tools, toolboxes, and automotive diagnostic equipment under the MATCO brand; and wheel service equipment under the COATS brand. Fortive Corporation was incorporated in 2015 and is headquartered in Everett, Washington.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "6920 Seaway Boulevard, Everett, WA, United States, 98203", "FullTimeEmployees": "25000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "24548882432", "EBITDA": "1559399936", "PERatio": "49.5385", "PEGRatio": "2.9591", "BookValue": "21.945", "DividendPerShare": "0.28", "DividendYield": "0.0039", "EPS": "1.479", "RevenuePerShareTTM": "21.23", "ProfitMargin": "0.08", "OperatingMarginTTM": "0.1523", "ReturnOnAssetsTTM": "0.041", "ReturnOnEquityTTM": "0.0774", "RevenueTTM": "7147100160", "GrossProfitTTM": "3696100000", "DilutedEPSTTM": "1.479", "QuarterlyEarningsGrowthYOY": "-0.297", "QuarterlyRevenueGrowthYOY": "-0.157", "AnalystTargetPrice": "80.77", "TrailingPE": "49.5385", "ForwardPE": "22.4719", "PriceToSalesRatioTTM": "3.3705", "PriceToBookRatio": "3.2288", "EVToRevenue": "4.0179", "EVToEBITDA": "21.7599", "Beta": "1.2445", "52WeekHigh": "80.61", "52WeekLow": "37.3101", "50DayMovingAverage": "71.4533", "200DayMovingAverage": "64.9283", "SharesOutstanding": "337071008", "SharesFloat": "319011204", "SharesShort": "5082786", "SharesShortPriorMonth": "5911661", "ShortRatio": "1.94", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0201", "PercentInsiders": "10.062", "PercentInstitutions": "85.35", "ForwardAnnualDividendRate": "0.28", "ForwardAnnualDividendYield": "0.0039", "PayoutRatio": "0.1958", "DividendDate": "2020-09-25", "ExDividendDate": "2020-08-27", "LastSplitFactor": "None", "LastSplitDate": "None"}