{"Symbol": "HII", "AssetType": "Common Stock", "Name": "Huntington Ingalls Industries, Inc", "Description": "Huntington Ingalls Industries, Inc. engages in the designing, building, overhauling, and repairing military ships in the United States. It operates through three segments: Ingalls Shipbuilding, Newport News Shipbuilding, and Technical Solutions. The company is involved in the design and construction of non-nuclear ships comprising amphibious assault ships that include deck amphibious ships and transport dock ships; surface combatants; and national security cutters for the U.S. Navy and U.S. Coast Guard. It also provides nuclear-powered ships, such as aircraft carriers and submarines, as well as refueling and overhaul, and inactivation services. In addition, the company offers naval nuclear support services, including fleet services comprising design, construction, maintenance, and disposal activities for in service U.S. Navy nuclear ships; and maintenance services on nuclear reactor prototypes. Further, it provides fleet support services comprising technical and waterfront ship services; naval architecture and marine engineering; integrated logistics support; technical documentation development; warehousing, asset management, and material readiness; operational and maintenance training development and delivery; software design and development; IT infrastructure support, and data delivery and management; and cyber security and information assurance services, as well as undersea vehicle and specialized craft development and prototyping services. Additionally, the company offers information technology and integrated missions solutions services; nuclear and environmental services; engineering, procurement, and construction management services to the oil and gas industry; and nuclear management and operations, and environmental management services to the Department of Energy, Department of Defense, state and local governments, and the private sector. Huntington Ingalls Industries, Inc. was founded in 1886 and is headquartered in Newport News, Virginia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "4101 Washington Avenue, Newport News, VA, United States, 23607", "FullTimeEmployees": "42000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6173441024", "EBITDA": "981000000", "PERatio": "11.9038", "PEGRatio": "0.5568", "BookValue": "41.432", "DividendPerShare": "4.12", "DividendYield": "0.0269", "EPS": "12.91", "RevenuePerShareTTM": "218.117", "ProfitMargin": "0.0592", "OperatingMarginTTM": "0.0832", "ReturnOnAssetsTTM": "0.06", "ReturnOnEquityTTM": "0.3194", "RevenueTTM": "8920999936", "GrossProfitTTM": "1531000000", "DilutedEPSTTM": "12.91", "QuarterlyEarningsGrowthYOY": "-0.576", "QuarterlyRevenueGrowthYOY": "-0.074", "AnalystTargetPrice": "186.15", "TrailingPE": "11.9038", "ForwardPE": "8.3542", "PriceToSalesRatioTTM": "0.7035", "PriceToBookRatio": "3.7027", "EVToRevenue": "0.8973", "EVToEBITDA": "8.2783", "Beta": "1.0418", "52WeekHigh": "279.71", "52WeekLow": "147.14", "50DayMovingAverage": "169.125", "200DayMovingAverage": "185.4594", "SharesOutstanding": "40492200", "SharesFloat": "39404130", "SharesShort": "568922", "SharesShortPriorMonth": "575966", "ShortRatio": "1.78", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0164", "PercentInsiders": "2.436", "PercentInstitutions": "90.323", "ForwardAnnualDividendRate": "4.12", "ForwardAnnualDividendYield": "0.0269", "PayoutRatio": "0.3064", "DividendDate": "2020-09-11", "ExDividendDate": "2020-08-27", "LastSplitFactor": "1:2", "LastSplitDate": "2003-12-05"}