{"Symbol": "IR", "AssetType": "Common Stock", "Name": "Ingersoll Rand Inc", "Description": "Ingersoll Rand Inc. provides mission-critical flow control and compression equipment, and associated aftermarket parts, consumables, and services in the United States, Europe, the Middle East, Africa, and the Asia Pacific. It operates through three segments: Industrials, Energy, and Medical. The Industrials segment designs, manufactures, markets, and services a range of air compression, vacuum, and blower products, as well as offers associated aftermarket parts, consumables, and services. Its products are used in process-critical applications, such as the operation of industrial air tools, vacuum packaging of food products, aeration of waste water, and others. This segment sells its products through an integrated network of direct sales representatives and independent distributors under the Gardner Denver, CompAir, Elmo Rietschle, Robuschi, and other brand names. The Energy segment designs, manufactures, markets, and services a range of displacement and liquid ring vacuum pumps, compressors and integrated systems, and engineered fluid loading and transfer equipment, as well as offers associated aftermarket parts, consumables, and services under the Gardner Denver, Nash, Emco Wheaton, and other brands. This segment serves customers in upstream, midstream, and downstream energy markets, as well as petrochemical processing, transportation, and general industrial sectors. The Medical segment designs, manufactures, and markets a range of specialized gas, liquid, and precision syringe pumps and compressors under the Thomas and other brands for use in oxygen therapy, blood dialysis, patient monitoring, laboratory sterilization and wound treatment, and other applications. The company was formerly known as Gardner Denver Holdings, Inc. and changed its name to Ingersoll Rand Inc. in March 2020. Ingersoll Rand Inc. was founded in 1859 and is based in Davidson, North Carolina.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "800-A Beaty Street, Davidson, NC, United States, 28036", "FullTimeEmployees": "6600", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14914029568", "EBITDA": "511100000", "PERatio": "78.25", "PEGRatio": "2.5074", "BookValue": "20.565", "DividendPerShare": "2.12", "DividendYield": "0.0834", "EPS": "0.331", "RevenuePerShareTTM": "11.843", "ProfitMargin": "-0.0451", "OperatingMarginTTM": "0.0631", "ReturnOnAssetsTTM": "0.0129", "ReturnOnEquityTTM": "-0.0281", "RevenueTTM": "3266800128", "GrossProfitTTM": "911700000", "DilutedEPSTTM": "-0.537", "QuarterlyEarningsGrowthYOY": "-0.429", "QuarterlyRevenueGrowthYOY": "1.01", "AnalystTargetPrice": "34.77", "TrailingPE": "78.25", "ForwardPE": "28.0112", "PriceToSalesRatioTTM": "3.0064", "PriceToBookRatio": "1.7164", "EVToRevenue": "5.3387", "EVToEBITDA": "73.931", "Beta": "1.4788", "52WeekHigh": "38.96", "52WeekLow": "17.01", "50DayMovingAverage": "33", "200DayMovingAverage": "29.5828", "SharesOutstanding": "417059008", "SharesFloat": "370727988", "SharesShort": "16651126", "SharesShortPriorMonth": "15303338", "ShortRatio": "6.2", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0481", "PercentInsiders": "0.357", "PercentInstitutions": "61.823", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0.0834", "PayoutRatio": "0", "DividendDate": "2020-03-31", "ExDividendDate": "None", "LastSplitFactor": "1252:1000", "LastSplitDate": "2013-12-02"}