{"Symbol": "ROP", "AssetType": "Common Stock", "Name": "Roper Technologies, Inc", "Description": "Roper Technologies, Inc. designs and develops software, and engineered products and solutions worldwide. It offers management, campus solutions, laboratory information management, enterprise management, information solutions, transportation management, financial and compliance management, cloud-based financial analytics and performance management, and diagnostic and laboratory information system software; and software, services, and technologies for foodservice operations. The company also provides cloud-based data, collaboration, and estimating automation software; visual effects and 3D content software; electronic marketplace; wireless sensor network and solutions; cloud-based software solutions; supply chain software; health care service and software; RFID card readers; data analytics and information; pharmacies software solutions; and toll system and products, transaction and violation processing services, and intelligent traffic systems. In addition, it offers precision rubber and polymer testing instruments, and data analysis software; ultrasound accessories; radiotherapy solutions; testing and analyzing plastics solutions; dispensers and metering pumps; control valves; precision weighing equipment; automated surgical scrub and linen dispensing equipment; water meters; automated leak detection equipment; medical devices; products and services for water and gas utilities; and equipment and consumables. The company also provides temperature control and emergency shutoff valves; turbomachinery control hardware, software, and services; specialized pumps; low meter calibrators, and controllers; vibration monitoring systems and controls; analytical instrument; drilling power section; pressure and level sensors; and non-destructive testing equipment and solutions. The company was formerly known as Roper Industries, Inc. and changed its name to Roper Technologies, Inc. in April 2015. Roper Technologies, Inc. was incorporated in 1981 and is based in Sarasota, Florida.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "6901 Professional Parkway East, Sarasota, FL, United States, 34240", "FullTimeEmployees": "16460", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "45044576256", "EBITDA": "1917699968", "PERatio": "28.0144", "PEGRatio": "2.9247", "BookValue": "94.352", "DividendPerShare": "2.05", "DividendYield": "0.0048", "EPS": "15.267", "RevenuePerShareTTM": "51.847", "ProfitMargin": "0.2975", "OperatingMarginTTM": "0.2713", "ReturnOnAssetsTTM": "0.0523", "ReturnOnEquityTTM": "0.1764", "RevenueTTM": "5405000192", "GrossProfitTTM": "3427100000", "DilutedEPSTTM": "15.267", "QuarterlyEarningsGrowthYOY": "-0.126", "QuarterlyRevenueGrowthYOY": "-0.019", "AnalystTargetPrice": "427", "TrailingPE": "28.0144", "ForwardPE": "34.7222", "PriceToSalesRatioTTM": "8.3434", "PriceToBookRatio": "4.5368", "EVToRevenue": "9.032", "EVToEBITDA": "17.9703", "Beta": "1.0786", "52WeekHigh": "455.72", "52WeekLow": "240", "50DayMovingAverage": "426.6042", "200DayMovingAverage": "372.1663", "SharesOutstanding": "104711000", "SharesFloat": "104153751", "SharesShort": "986697", "SharesShortPriorMonth": "1252212", "ShortRatio": "2.26", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0111", "PercentInsiders": "1.919", "PercentInstitutions": "96.241", "ForwardAnnualDividendRate": "2.05", "ForwardAnnualDividendYield": "0.0048", "PayoutRatio": "0.1309", "DividendDate": "2020-07-22", "ExDividendDate": "2020-07-07", "LastSplitFactor": "2:1", "LastSplitDate": "2005-08-29"}