{"Symbol": "SWK", "AssetType": "Common Stock", "Name": "Stanley Black & Decker, Inc", "Description": "Stanley Black & Decker, Inc. engages in tools and storage, industrial, and security businesses worldwide. Its Tools & Storage segment offers power tools and equipment, including professional products, such as professional grade corded and cordless electric power tools and equipment, and pneumatic tools and fasteners; and consumer products comprising corded and cordless electric power tools primarily under the BLACK+DECKER brand, as well as lawn and garden products and related accessories, and home products. This segment sells its products through retailers, distributors, and a direct sales force to professional end users, distributors, retail consumers, and industrial customers in various industries. The company's Industrial segment provides engineered fastening products and systems to customers in the automotive, manufacturing, electronics, construction, aerospace industries, and others; sells and rents custom pipe handling, joint welding, and coating equipment for use in the construction of large and small diameter pipelines, as well as provides pipeline inspection services; and sells hydraulic tools, attachments, and accessories. This segment also serves oil and natural gas pipeline industry and other industrial customers. Its Security segment designs, supplies, and installs commercial electronic security systems and provides electronic security services; offers healthcare solutions, which include asset tracking, infant protection, pediatric protection, patient protection, wander management, fall management, and emergency call products; and sells automatic doors to commercial customers. This segment serves consumers, retailers, educational, financial, and healthcare institutions, as well as commercial, governmental, and industrial customers. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. Stanley Black & Decker, Inc. was founded in 1843 and is headquartered in New Britain, Connecticut.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Tools & Accessories", "Address": "1000 Stanley Drive, New Britain, CT, United States, 06053", "FullTimeEmployees": "59438", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "26430564352", "EBITDA": "2049699968", "PERatio": "30.4351", "PEGRatio": "1.7934", "BookValue": "52.977", "DividendPerShare": "2.8", "DividendYield": "0.0176", "EPS": "5.238", "RevenuePerShareTTM": "90.598", "ProfitMargin": "0.0588", "OperatingMarginTTM": "0.1089", "ReturnOnAssetsTTM": "0.0417", "ReturnOnEquityTTM": "0.0881", "RevenueTTM": "13624099840", "GrossProfitTTM": "4845200000", "DilutedEPSTTM": "5.238", "QuarterlyEarningsGrowthYOY": "-0.359", "QuarterlyRevenueGrowthYOY": "-0.163", "AnalystTargetPrice": "172.5", "TrailingPE": "30.4351", "ForwardPE": "23.4742", "PriceToSalesRatioTTM": "1.7808", "PriceToBookRatio": "3.0103", "EVToRevenue": "2.31", "EVToEBITDA": "19.5497", "Beta": "1.5473", "52WeekHigh": "173.67", "52WeekLow": "70", "50DayMovingAverage": "155.6156", "200DayMovingAverage": "131.4758", "SharesOutstanding": "159682000", "SharesFloat": "159301702", "SharesShort": "3401326", "SharesShortPriorMonth": "4469328", "ShortRatio": "3.13", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0215", "PercentInsiders": "0.283", "PercentInstitutions": "89.319", "ForwardAnnualDividendRate": "2.8", "ForwardAnnualDividendYield": "0.0176", "PayoutRatio": "0.5267", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-31", "LastSplitFactor": "2:1", "LastSplitDate": "1996-06-04"}