{"Symbol": "TXT", "AssetType": "Common Stock", "Name": "Textron Inc", "Description": "Textron Inc. operates in the aircraft, defense, industrial, and finance businesses worldwide. The company's Textron Aviation segment manufactures, sells, and services business jets, turboprop and piston engine aircraft, and military trainer and defense aircraft; and commercial parts, as well as offers maintenance, inspection, and repair services. Its Bell segment supplies military and commercial helicopters, tiltrotor aircraft, and related spare parts and services. The company's Textron Systems segment offers unmanned aircraft systems, unmanned surface systems, mission command hardware and solutions, and customer support and logistics services; simulation, training, and other defense and aviation mission support products and services; airborne and ground-based sensors and surveillance systems, and protection systems; precision guided weapons systems; marine craft, armored vehicles, and specialty vehicles used for fire and rescue applications; test equipment, electronic warfare test, and training and intelligence software solutions; and piston aircraft engines, as well as designs, develops, manufactures, installs, and maintains full flight simulators. Its Industrial segment offers blow-molded plastic fuel systems, including conventional plastic fuel tanks and pressurized fuel tanks for hybrid applications, clear-vision systems, and plastic tanks for catalytic reduction systems primarily to automobile OEMs; and golf cars, off-road utility vehicles, recreational side-by-side and all-terrain vehicles, snowmobiles, light transportation vehicles, aviation ground support equipment, professional turf-maintenance equipment, and turf-care vehicles to golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users. The company's Finance segment provides financing to purchase new and pre-owned aircraft and helicopters. Textron Inc. was founded in 1923 and is headquartered in Providence, Rhode Island.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "40 Westminster Street, Providence, RI, United States, 02903", "FullTimeEmployees": "35000", "FiscalYearEnd": "January", "LatestQuarter": "2020-07-31", "MarketCapitalization": "9114559488", "EBITDA": "1194000000", "PERatio": "24.1227", "PEGRatio": "2.74", "BookValue": "24.246", "DividendPerShare": "0.08", "DividendYield": "0.002", "EPS": "1.641", "RevenuePerShareTTM": "54.835", "ProfitMargin": "0.0301", "OperatingMarginTTM": "0.0631", "ReturnOnAssetsTTM": "0.0327", "ReturnOnEquityTTM": "0.0694", "RevenueTTM": "12542999552", "GrossProfitTTM": "2199000000", "DilutedEPSTTM": "1.641", "QuarterlyEarningsGrowthYOY": "-0.712", "QuarterlyRevenueGrowthYOY": "-0.234", "AnalystTargetPrice": "40.67", "TrailingPE": "24.1227", "ForwardPE": "18.9753", "PriceToSalesRatioTTM": "0.719", "PriceToBookRatio": "1.6223", "EVToRevenue": "0.9051", "EVToEBITDA": "11.6794", "Beta": "1.6632", "52WeekHigh": "52.87", "52WeekLow": "20.26", "50DayMovingAverage": "36.0489", "200DayMovingAverage": "32.8746", "SharesOutstanding": "228035008", "SharesFloat": "226902124", "SharesShort": "6524780", "SharesShortPriorMonth": "6343672", "ShortRatio": "5.19", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0383", "PercentInsiders": "0.453", "PercentInstitutions": "84.447", "ForwardAnnualDividendRate": "0.08", "ForwardAnnualDividendYield": "0.002", "PayoutRatio": "0.0491", "DividendDate": "2020-10-01", "ExDividendDate": "2020-09-10", "LastSplitFactor": "2:1", "LastSplitDate": "2007-08-27"}