{"Symbol": "A", "AssetType": "Common Stock", "Name": "Agilent Technologies, Inc", "Description": "Agilent Technologies, Inc. provides application focused solutions to the life sciences, diagnostics, and applied chemical markets worldwide. It operates in three segments: Life Sciences and Applied Markets, Diagnostics and Genomics, and Agilent CrossLab. The Life Sciences and Applied Markets segment offers liquid and gas chromatography systems and components; liquid and gas chromatography mass spectrometry systems; inductively coupled plasma mass spectrometry instruments; atomic absorption instruments; microwave plasma-atomic emission spectrometry instruments; inductively coupled plasma optical emission spectrometry instruments; raman spectroscopy; cell analysis plate based assays; flow cytometer; real-time cell analyzer; cell imaging systems; microplate readers; laboratory software and information management and analytics; laboratory automation and robotic systems; dissolution testing; vacuum pumps; and measurement technologies. The Diagnostics and Genomics segment provides reagents, instruments, software, and consumables; arrays for DNA mutation detection, genotyping, gene copy number determination, identification of gene rearrangements, DNA methylation profiling, and gene expression profiling, as well as sequencing target enrichment, genetic data management, and interpretation support software; and equipment focused on production of synthesized oligonucleotides for use as active pharmaceutical ingredients. The Agilent CrossLab segment offers GC and LC columns, sample preparation products, custom chemistries, and laboratory instrument supplies; and startup, operational, training, compliance support, and software as a service, as well as asset management and consultation services. The company markets its products through direct sales, distributors, resellers, manufacturer's representatives, and electronic commerce. The company was founded in 1999 and is headquartered in Santa Clara, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "5301 Stevens Creek Boulevard, Santa Clara, CA, United States, 95051", "FullTimeEmployees": "16300", "FiscalYearEnd": "October", "LatestQuarter": "2020-07-31", "MarketCapitalization": "31933716480", "EBITDA": "1207000064", "PERatio": "44.6036", "PEGRatio": "2.6704", "BookValue": "16.12", "DividendPerShare": "0.72", "DividendYield": "0.0071", "EPS": "2.215", "RevenuePerShareTTM": "16.917", "ProfitMargin": "0.1323", "OperatingMarginTTM": "0.1721", "ReturnOnAssetsTTM": "0.0618", "ReturnOnEquityTTM": "0.1421", "RevenueTTM": "5223000064", "GrossProfitTTM": "2805000000", "DilutedEPSTTM": "2.215", "QuarterlyEarningsGrowthYOY": "0.067", "QuarterlyRevenueGrowthYOY": "-0.01", "AnalystTargetPrice": "102.38", "TrailingPE": "44.6036", "ForwardPE": "27.4725", "PriceToSalesRatioTTM": "5.915", "PriceToBookRatio": "6.1384", "EVToRevenue": "6.0387", "EVToEBITDA": "26.7743", "Beta": "1.1258", "52WeekHigh": "101.29", "52WeekLow": "61.13", "50DayMovingAverage": "97.0519", "200DayMovingAverage": "84.5936", "SharesOutstanding": "308776992", "SharesFloat": "307896870", "SharesShort": "3898382", "SharesShortPriorMonth": "4123753", "ShortRatio": "2.81", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0127", "PercentInsiders": "0.373", "PercentInstitutions": "89.387", "ForwardAnnualDividendRate": "0.72", "ForwardAnnualDividendYield": "0.0071", "PayoutRatio": "0.3171", "DividendDate": "2020-07-22", "ExDividendDate": "2020-06-29", "LastSplitFactor": "1398:1000", "LastSplitDate": "2014-11-03"}