{"Symbol": "AKAM", "AssetType": "Common Stock", "Name": "Akamai Technologies, Inc", "Description": "Akamai Technologies, Inc. provides cloud services for delivering, optimizing, and securing content and business applications over the Internet in the United States and internationally. It provides Web Application Protector to safeguard web assets from web application and distributed denial of service; Kona Site Defender, a cloud security solution; Bot Manager to identify bots and categorize bots based on business or IT impact; Edge DNS, which translates human-readable domain names into numerical IP addresses; Site Shield that prevents attacker from directly targeting the application origin and forces traffic to go through its network, where attack can be better detected and mitigated; identity Cloud, a customer identity access management solution; Prolexic Routed to protect web- and IP-based application; and Client Reputation that assigns risk scores to malicious IP address and enables customers to take action on individual clients. It also offers Enterprise Application Access that enables adaptive access to application; Enterprise Threat Protector to enable enterprise security teams to identify, block, and mitigate targeted attack; Ion, a suite of intelligent performance optimization tool and control; Dynamic Site Accelerator to accelerate and secure interactive website; Image Manager that automatically optimizes online images; CloudTest to conduct load testing and other analysis of website in a pre-production environment; and mPulse that provides real-time website performance data for customers to enhance their digital experiences. In addition, the company provides Aura Managed CDN, DNS Infrastructure, and security and personalization service; and adaptive delivery, download delivery, media service live, and media analytic solutions, as well as NetStorage, a cloud storage solution. It sells its solutions through direct sales and service organizations; and various channel partners. The company was founded in 1998 and is headquartered in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "145 Broadway, Cambridge, MA, United States, 02142", "FullTimeEmployees": "7951", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "19391180800", "EBITDA": "935612032", "PERatio": "35.2818", "PEGRatio": "1.9352", "BookValue": "24.007", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.3", "RevenuePerShareTTM": "18.755", "ProfitMargin": "0.1782", "OperatingMarginTTM": "0.2115", "ReturnOnAssetsTTM": "0.064", "ReturnOnEquityTTM": "0.1485", "RevenueTTM": "3041051904", "GrossProfitTTM": "1905993000", "DilutedEPSTTM": "3.3", "QuarterlyEarningsGrowthYOY": "0.42", "QuarterlyRevenueGrowthYOY": "0.127", "AnalystTargetPrice": "124.06", "TrailingPE": "35.2818", "ForwardPE": "22.8833", "PriceToSalesRatioTTM": "6.2879", "PriceToBookRatio": "4.852", "EVToRevenue": "6.6609", "EVToEBITDA": "18.2761", "Beta": "0.339", "52WeekHigh": "120", "52WeekLow": "79.81", "50DayMovingAverage": "111.5228", "200DayMovingAverage": "101.9127", "SharesOutstanding": "162704992", "SharesFloat": "159066780", "SharesShort": "8687670", "SharesShortPriorMonth": "6045285", "ShortRatio": "6.77", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0704", "PercentInsiders": "2.47", "PercentInstitutions": "92.941", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}