{"Symbol": "ALXN", "AssetType": "Common Stock", "Name": "Alexion Pharmaceuticals, Inc", "Description": "Alexion Pharmaceuticals, Inc. develops and commercializes various therapeutic products. The company offers ULTOMIRIS (ALXN1210/ravulizumab-cwvz), a C5 inhibitor for the treatment of paroxysmal nocturnal hemoglobinuria (PNH) and atypical hemolytic uremic syndrome (aHUS); and SOLIRIS (eculizumab), a monoclonal antibody for the treatment of PNH, aHUS, generalized myasthenia gravis (gMG), and neuromyelitis optica spectrum disorder (NMOSD). It also provides Strensiq (asfotase alfa), a targeted enzyme replacement therapy for patients with hypophosphatasia; and Kanuma (sebelipase alfa) for the treatment of patients with lysosomal acid lipase deficiency. In addition, the company is developing ALXN1210 (Intravenous) that is in Phase III clinical trials for the treatment of gMG and NMOSD; ALXN1210 (Subcutaneous), which is in Phase III clinical trials for PNH and aHUS; ALXN1810 (Subcutaneous) that is in Phase I clinical trial for renal diseases; and ALXN1720 (Subcutaneous), which is in Phase I clinical trial for the treatment of disease states involving dysregulated terminal complement activity. Further, it is developing ALXN1840 (WTX101) that is in Phase III clinical trials for the treatment of Wilson disease; and ALXN1830 and ABY-039, which are in Phase I clinical trials for neonatal Fc receptor. The company serves distributors, pharmacies, hospitals, hospital buying groups, and other healthcare providers in the United States and internationally. Alexion Pharmaceuticals, Inc. has collaboration and license agreement with Halozyme Therapeutics, Inc.; collaboration with Dicerna Pharmaceuticals, Inc. and Zealand Pharma A/S; strategic agreement with Caelum Biosciences, Inc.; agreement with Stealth BioTherapeutics Corp.; and a partnership with Affibody AB. The company was founded in 1992 and is headquartered in Boston, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "121 Seaport Boulevard, Boston, MA, United States, 02210", "FullTimeEmployees": "3082", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "24946270208", "EBITDA": "2911099904", "PERatio": "28.296", "PEGRatio": "0.7656", "BookValue": "47.881", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.808", "RevenuePerShareTTM": "24.969", "ProfitMargin": "0.1528", "OperatingMarginTTM": "0.464", "ReturnOnAssetsTTM": "0.1027", "ReturnOnEquityTTM": "0.0819", "RevenueTTM": "5536799744", "GrossProfitTTM": "4596600000", "DilutedEPSTTM": "3.808", "QuarterlyEarningsGrowthYOY": "-0.042", "QuarterlyRevenueGrowthYOY": "0.201", "AnalystTargetPrice": "141.32", "TrailingPE": "28.296", "ForwardPE": "9.99", "PriceToSalesRatioTTM": "4.2641", "PriceToBookRatio": "2.2168", "EVToRevenue": "4.1563", "EVToEBITDA": "25.5637", "Beta": "1.3929", "52WeekHigh": "121.5", "52WeekLow": "72.67", "50DayMovingAverage": "105.0319", "200DayMovingAverage": "102.4078", "SharesOutstanding": "219172992", "SharesFloat": "218557107", "SharesShort": "4764023", "SharesShortPriorMonth": "4386517", "ShortRatio": "2.99", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0226", "PercentInsiders": "0.297", "PercentInstitutions": "95.391", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2011-05-23"}