{"Symbol": "AIG", "AssetType": "Common Stock", "Name": "American International Group, Inc", "Description": "American International Group, Inc. provides insurance products for commercial, institutional, and individual customers in North America and internationally. The company's General Insurance segment offers general liability, environmental, commercial automobile liability, workers' compensation, excess casualty, and crisis management insurance products, as well as various risk-sharing and other customized structured programs; commercial, industrial, and energy-related property insurance; and aerospace, political risk, trade credit, portfolio solutions, surety, crop, and marine insurance. It also provides professional liability insurance products for a range of businesses and risks, including directors and officer's liability, mergers and acquisitions, fidelity, employment practices, fiduciary liability, cyber risk, kidnap and ransom, and errors and omissions insurance. In addition, this segment offers personal auto and property insurance, voluntary and sponsor-paid personal accident, and supplemental health products; extended warranty insurance products; and travel insurance products. Its Life and Retirement segment offers variable annuities, fixed index and fixed annuities, and retail mutual funds; group mutual funds, individual annuity and investment products, and financial planning and advisory services; and term life and universal life insurance. This segment also provides stable value wrap products, and structured settlement and pension risk transfer annuities; and corporate- and bank-owned life insurance and guaranteed investment contracts. This segment sells its products through independent marketing organizations, independent insurance agents, financial advisors, direct marketing, banks, wirehouses, and broker-dealers. The company's Legacy Portfolio segment offers legacy insurance products. American International Group, Inc. was founded in 1919 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceDiversified", "Address": "175 Water Street, New York, NY, United States, 10038", "FullTimeEmployees": "46000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "25696575488", "EBITDA": "10634000384", "PERatio": "6.0407", "PEGRatio": "0.5895", "BookValue": "71.682", "DividendPerShare": "1.28", "DividendYield": "0.0439", "EPS": "4.958", "RevenuePerShareTTM": "55.592", "ProfitMargin": "-0.0945", "OperatingMarginTTM": "0.1178", "ReturnOnAssetsTTM": "0.0065", "ReturnOnEquityTTM": "-0.067", "RevenueTTM": "48592998400", "GrossProfitTTM": "15380000000", "DilutedEPSTTM": "-5.29", "QuarterlyEarningsGrowthYOY": "1.65", "QuarterlyRevenueGrowthYOY": "-0.252", "AnalystTargetPrice": "37.57", "TrailingPE": "6.0407", "ForwardPE": "11.0254", "PriceToSalesRatioTTM": "0.5265", "PriceToBookRatio": "0.4065", "EVToRevenue": "1.2572", "EVToEBITDA": "0", "Beta": "1.4495", "52WeekHigh": "58.66", "52WeekLow": "16.07", "50DayMovingAverage": "30.6872", "200DayMovingAverage": "30.1707", "SharesOutstanding": "861433984", "SharesFloat": "860374336", "SharesShort": "14019507", "SharesShortPriorMonth": "14423426", "ShortRatio": "2.16", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0163", "PercentInsiders": "0.097", "PercentInstitutions": "95.679", "ForwardAnnualDividendRate": "1.28", "ForwardAnnualDividendYield": "0.0439", "PayoutRatio": "0.2602", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-16", "LastSplitFactor": "1:20", "LastSplitDate": "2009-07-01"}