{"Symbol": "ANSS", "AssetType": "Common Stock", "Name": "ANSYS, Inc", "Description": "ANSYS, Inc. develops and markets engineering simulation software and services worldwide. The company offers ANSYS Workbench, a framework upon which its engineering simulation technologies are built; multiphysics software to simulate the interactions between structures, heat transfer, fluids, and electronics in a unified engineering simulation environment; high-performance computing product suite, which delivers cross-physics parallel processing capabilities for simulation software; and structural analysis product suite that provides simulation tools for product design and optimization. It also provides fluids product suite that enables modeling of fluid flow and other related physical phenomena; and electromagnetics product suite that offers field simulation software for designing electronic and electromechanical products. In addition, the company offers power analysis and optimization software suite that manages the power budget, power delivery integrity, and power-induced noise in an electronic design; SCADE product suite, a solution for embedded software simulation, code production, and automated certification; system simulation capability for the design of automated products; and optical sensor and closed-loop, and real-time simulation, as well as safety-certified embedded software solutions. Further, it provides Discovery product family for use in the simulation of product design; Ansys Granta products to give access to material intelligence; and academic product suite with a portfolio of academic products based on associate, research, and teaching. The company serves engineers, designers, researchers, and students in the aerospace and defense, automotive, electronics, semiconductors, energy, materials and chemical processing, turbomachinery, consumer products, healthcare, and sports industries. ANSYS, Inc. was founded in 1970 and is headquartered in Canonsburg, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "2600 ANSYS Drive, Canonsburg, PA, United States, 15317", "FullTimeEmployees": "4400", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "30076835840", "EBITDA": "516744992", "PERatio": "72.2478", "PEGRatio": "5.1674", "BookValue": "40.1", "DividendPerShare": "None", "DividendYield": "0", "EPS": "4.591", "RevenuePerShareTTM": "17.852", "ProfitMargin": "0.2617", "OperatingMarginTTM": "0.2909", "ReturnOnAssetsTTM": "0.0676", "ReturnOnEquityTTM": "0.1272", "RevenueTTM": "1520772992", "GrossProfitTTM": "1371329000", "DilutedEPSTTM": "4.591", "QuarterlyEarningsGrowthYOY": "-0.133", "QuarterlyRevenueGrowthYOY": "0.046", "AnalystTargetPrice": "317.8", "TrailingPE": "72.2478", "ForwardPE": "56.4972", "PriceToSalesRatioTTM": "18.9593", "PriceToBookRatio": "8.2928", "EVToRevenue": "18.6047", "EVToEBITDA": "52.1512", "Beta": "1.2126", "52WeekHigh": "345.4", "52WeekLow": "200.07", "50DayMovingAverage": "313.7483", "200DayMovingAverage": "275.0248", "SharesOutstanding": "85789200", "SharesFloat": "85036007", "SharesShort": "2441498", "SharesShortPriorMonth": "2184916", "ShortRatio": "5.49", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.028", "PercentInsiders": "0.982", "PercentInstitutions": "101.75", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2007-06-05"}