{"Symbol": "ANTM", "AssetType": "Common Stock", "Name": "Anthem, Inc", "Description": "Anthem, Inc., through its subsidiaries, operates as a health benefits company in the United States. It operates through three segments: Commercial & Specialty Business, Government Business, and Other. The company offers a spectrum of network-based managed care health benefit plans to large and small group, individual, Medicaid, and Medicare markets. Its managed care plans include preferred provider organizations; health maintenance organizations; point-of-service plans; traditional indemnity plans and other hybrid plans, such as consumer-driven health plans; and hospital only and limited benefit products. The company also provides a range of managed care services to self-funded customers, including claims processing, underwriting, stop loss insurance, actuarial services, provider network access, medical cost management, disease management, wellness programs, and other administrative services. In addition, it offers an array of specialty and other insurance products and services, such as dental, vision, life and disability insurance benefits, radiology benefit management, and analytics-driven personal health care guidance; and Medicare administrative services. Further, the company provides services to the federal government in connection with the Federal Employee Program; and operates as a licensee of the Blue Cross and Blue Shield Association. As of December 31, 2019, it served 41 million medical members through its affiliated health plans. Anthem, Inc. has a strategic relationship with Quest Diagnostics Incorporated to develop various outcomes-based programs for enhanced health care experience for consumers and providers. The company was formerly known as WellPoint, Inc. and changed its name to Anthem, Inc. in December 2014. Anthem, Inc. was founded in 1944 and is headquartered in Indianapolis, Indiana.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Healthcare Plans", "Address": "220 Virginia Avenue, Indianapolis, IN, United States, 46204", "FullTimeEmployees": "70600", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "70414131200", "EBITDA": "9134000128", "PERatio": "11.918", "PEGRatio": "1.1664", "BookValue": "136.66", "DividendPerShare": "3.8", "DividendYield": "0.0139", "EPS": "22.989", "RevenuePerShareTTM": "446.149", "ProfitMargin": "0.0524", "OperatingMarginTTM": "0.0761", "ReturnOnAssetsTTM": "0.0656", "ReturnOnEquityTTM": "0.1813", "RevenueTTM": "112965001216", "GrossProfitTTM": "22426000000", "DilutedEPSTTM": "22.989", "QuarterlyEarningsGrowthYOY": "1.044", "QuarterlyRevenueGrowthYOY": "0.149", "AnalystTargetPrice": "338.87", "TrailingPE": "11.918", "ForwardPE": "12.2549", "PriceToSalesRatioTTM": "0.6258", "PriceToBookRatio": "2.0044", "EVToRevenue": "0.7481", "EVToEBITDA": "0", "Beta": "0.9566", "52WeekHigh": "309.1", "52WeekLow": "171.03", "50DayMovingAverage": "274.3667", "200DayMovingAverage": "265.4406", "SharesOutstanding": "251506000", "SharesFloat": "251131713", "SharesShort": "3853846", "SharesShortPriorMonth": "3260832", "ShortRatio": "3.33", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0153", "PercentInsiders": "0.175", "PercentInstitutions": "92.525", "ForwardAnnualDividendRate": "3.8", "ForwardAnnualDividendYield": "0.0139", "PayoutRatio": "0.1519", "DividendDate": "2020-09-25", "ExDividendDate": "2020-09-09", "LastSplitFactor": "2:1", "LastSplitDate": "2005-06-01"}