{"Symbol": "AON", "AssetType": "Common Stock", "Name": "Aon Plc", "Description": "Aon plc, a professional services firm, provides advice and solutions to clients focused on risk, retirement, and health worldwide. It offers commercial risk solutions, including retail brokerage, cyber, and global risk consulting solutions, as well as acts as a captive insurance solutions provider; and health solutions, such as health and benefits brokerages, and health care exchanges. The company also provides treaty and facultative reinsurance, as well as mergers and acquisition, capital raising, strategic advisory, restructuring, and recapitalization services; insurance-linked securities; and corporate finance advisory services, capital markets solutions, and risk management products. In addition, it offers strategic design consulting services on their retirement programs, actuarial services, and risk management for organizations; advice services on developing and maintaining investment programs across a range of plan types, including defined benefit plans, defined contribution plans, endowments, and foundations for public and private companies, and other institutions; and advice and solutions that help clients in accelerating business outcomes by enhancing the performance of their people, including assessment and optimized deployment, as well as the design, alignment, and benchmarking of compensation to business strategy and performance outcomes. Further, the company develops, markets, and administers customized insurance programs and specialty market solutions for organizations, and their members or affiliates; operates the Global Risk Insight Platform, which provides data, analytics, engagement, and consulting services; and offers ReView that provides advisory, analysis, and benchmarking services to help reinsurers. Aon plc was founded in 1919 and is based in London, the United Kingdom.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Insurance Brokers", "Address": "The Leadenhall Building, London, United Kingdom, EC3V 4AN", "FullTimeEmployees": "50000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "48583954432", "EBITDA": "3315000064", "PERatio": "26.5944", "PEGRatio": "1.7165", "BookValue": "15.555", "DividendPerShare": "1.76", "DividendYield": "0.0087", "EPS": "7.481", "RevenuePerShareTTM": "46.843", "ProfitMargin": "0.1608", "OperatingMarginTTM": "0.2582", "ReturnOnAssetsTTM": "0.0573", "ReturnOnEquityTTM": "0.4766", "RevenueTTM": "10979999744", "GrossProfitTTM": "5173000000", "DilutedEPSTTM": "7.481", "QuarterlyEarningsGrowthYOY": "0.495", "QuarterlyRevenueGrowthYOY": "-0.042", "AnalystTargetPrice": "221.67", "TrailingPE": "26.5944", "ForwardPE": "20.8333", "PriceToSalesRatioTTM": "4.2994", "PriceToBookRatio": "12.8652", "EVToRevenue": "3.6771", "EVToEBITDA": "13.1987", "Beta": "0.878", "52WeekHigh": "238.19", "52WeekLow": "143.93", "50DayMovingAverage": "199.7669", "200DayMovingAverage": "191.5581", "SharesOutstanding": "231650000", "SharesFloat": "229162411", "SharesShort": "15938995", "SharesShortPriorMonth": "13557241", "ShortRatio": "10.59", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.0695", "PercentInsiders": "0.95", "PercentInstitutions": "93.767", "ForwardAnnualDividendRate": "1.76", "ForwardAnnualDividendYield": "0.0087", "PayoutRatio": "0.234", "DividendDate": "2020-08-14", "ExDividendDate": "2020-07-31", "LastSplitFactor": "3:2", "LastSplitDate": "1999-05-18"}