{"Symbol": "ADM", "AssetType": "Common Stock", "Name": "Archer-Daniels-Midland Company", "Description": "Archer-Daniels-Midland Company procures, transports, stores, processes, and merchandises agricultural commodities, products, and ingredients in the United States and internationally. The company operates through three segments: Ag Services and Oilseeds, Carbohydrate Solutions, and Nutrition. It procures, stores, cleans, and transports agricultural raw materials, such as oilseeds, corn, wheat, milo, oats, rice, and barley. The company also engages in the agricultural commodity and feed product import, export, and distribution; and structured trade finance activities. In addition, it offers vegetable oils and protein meals; ingredients for the food, feed, energy, and industrial customers; crude vegetable oils, salad oils, margarine, shortening, and other food products; and partially refined oils to produce biodiesel and glycols for use in chemicals, paints, and other industrial products. Further, the company provides peanuts, tree nuts, peanut-derived ingredients, and cotton cellulose pulp; sweeteners, corn and wheat starches, syrup, glucose, wheat flour, dextrose, and bioproducts; alcohol and other food and animal feed ingredients; ethyl alcohol and ethanol; corn gluten feed and meal, as well as distillers' grains; and citric acids. Additionally, the company provides natural flavor ingredients, flavor systems, natural colors, proteins, emulsifiers, soluble fiber, polyols, hydrocolloids, and natural health and nutrition products, including probiotics, prebiotics, enzymes, and botanical extracts; and other specialty food and feed ingredients; edible beans; formula feeds, and animal health and nutrition products; and contract and private label pet treats and foods. It also engages in futures commission merchant and insurance services. The company has a partnership with Hospital de Sagunto. The company was founded in 1902 and is headquartered in Chicago, Illinois.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Farm Products", "Address": "77 West Wacker Drive, Chicago, IL, United States, 60601", "FullTimeEmployees": "38100", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "25281937408", "EBITDA": "2692999936", "PERatio": "14.242", "PEGRatio": "2.1397", "BookValue": "34.7", "DividendPerShare": "1.44", "DividendYield": "0.0319", "EPS": "3.141", "RevenuePerShareTTM": "114.525", "ProfitMargin": "0.0275", "OperatingMarginTTM": "0.0265", "ReturnOnAssetsTTM": "0.0245", "ReturnOnEquityTTM": "0.0921", "RevenueTTM": "64305999872", "GrossProfitTTM": "4147000000", "DilutedEPSTTM": "3.141", "QuarterlyEarningsGrowthYOY": "1.01", "QuarterlyRevenueGrowthYOY": "-0.001", "AnalystTargetPrice": "49.4", "TrailingPE": "14.242", "ForwardPE": "15.3374", "PriceToSalesRatioTTM": "0.3919", "PriceToBookRatio": "1.288", "EVToRevenue": "0.5141", "EVToEBITDA": "10.0877", "Beta": "0.9621", "52WeekHigh": "47.2", "52WeekLow": "28.92", "50DayMovingAverage": "43.2056", "200DayMovingAverage": "38.8863", "SharesOutstanding": "555646976", "SharesFloat": "553607665", "SharesShort": "8118096", "SharesShortPriorMonth": "8494692", "ShortRatio": "3.6", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0147", "PercentInsiders": "0.445", "PercentInstitutions": "80.701", "ForwardAnnualDividendRate": "1.44", "ForwardAnnualDividendYield": "0.0319", "PayoutRatio": "0.4522", "DividendDate": "2020-09-09", "ExDividendDate": "2020-08-18", "LastSplitFactor": "105:100", "LastSplitDate": "2001-08-30"}