{"Symbol": "BKR", "AssetType": "Common Stock", "Name": "Baker Hughes Company", "Description": "Baker Hughes Company provides a portfolio of technologies and services worldwide. The company operates through four segments: Oilfield Services (OFS), Oilfield Equipment (OFE), Turbomachinery & Process Solutions (TPS), and Digital Solutions (DS). The OFS segment offers drilling, wireline, evaluation, completion, production, and intervention services; and drilling and completions fluids, completions tools and systems, wellbore intervention tools and services, artificial lift systems, pressure pumping systems, and oilfield and industrial chemicals for oil and natural gas, and oilfield service companies. The OFE segment designs and manufactures products and services, including pressure control equipment and services, subsea production systems and services, drilling equipment, and flexible pipeline systems; and onshore and offshore drilling and production systems, and equipment for floating production platforms, as well as provides services related to onshore and offshore drilling activities. The TPS segment provides equipment and related services for mechanical-drive, compression, and power-generation applications across the oil and gas industry. Its product portfolio includes drivers, compressors, and turnkey solutions; and pumps, valves, and compressed natural gas and small-scale liquefied natural gas solutions. This segment serves upstream, midstream, onshore and offshore, and industrial, as well as engineering, procurement, and construction companies. The DS segment provides sensor-based measurement, non-destructive testing and inspection, turbine, generator and plant controls, and condition monitoring, as well as pipeline integrity solutions for a range of industries, including oil and gas, power generation, aerospace, metals, and transportation. It serves through direct and indirect channels. The company was formerly known as Baker Hughes, a GE company and changed its name to Baker Hughes Company in October 2019. Baker Hughes Company is based in Houston, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Equipment & Services", "Address": "17021 Aldine Westfield Road, Houston, TX, United States, 77073-5101", "FullTimeEmployees": "60000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14586212352", "EBITDA": "2571000064", "PERatio": "73.7391", "PEGRatio": "3.9497", "BookValue": "None", "DividendPerShare": "0.72", "DividendYield": "0.0504", "EPS": "0.2234", "RevenuePerShareTTM": "35.853", "ProfitMargin": "-0.4603", "OperatingMarginTTM": "0.0522", "ReturnOnAssetsTTM": "0.0162", "ReturnOnEquityTTM": "-0.6206", "RevenueTTM": "22389999616", "GrossProfitTTM": "4432000000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "2.532", "QuarterlyRevenueGrowthYOY": "-0.21", "AnalystTargetPrice": "20.68", "TrailingPE": "73.7391", "ForwardPE": "83.3333", "PriceToSalesRatioTTM": "0.4118", "PriceToBookRatio": "1.353", "EVToRevenue": "0.8394", "EVToEBITDA": "6.1738", "Beta": "1.6819", "52WeekHigh": "25.99", "52WeekLow": "9.12", "50DayMovingAverage": "15.9642", "200DayMovingAverage": "14.9748", "SharesOutstanding": "656324992", "SharesFloat": "626646153", "SharesShort": "34887148", "SharesShortPriorMonth": "24082372", "ShortRatio": "5.52", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0696", "PercentInsiders": "0.2", "PercentInstitutions": "95.335", "ForwardAnnualDividendRate": "0.72", "ForwardAnnualDividendYield": "0.0504", "PayoutRatio": "3.1304", "DividendDate": "2020-08-21", "ExDividendDate": "2020-08-07", "LastSplitFactor": "None", "LastSplitDate": "None"}