{"Symbol": "BR", "AssetType": "Common Stock", "Name": "Broadridge Financial Solutions, Inc", "Description": "Broadridge Financial Solutions, Inc. provides investor communications and technology-driven solutions for the financial services industry worldwide. The company's Investor Communication Solutions segment processes and distributes proxy materials to investors in equity securities and mutual funds, as well as facilitates related vote processing services; and offers ProxyEdge, an electronic proxy delivery and voting solution. It also distributes regulatory reports and corporate action/reorganization event information, as well as tax reporting solutions; and provides end-to-end platform for content management, composition, and multi-channel distribution of regulatory, marketing, and transactional information, as well as mutual fund trade processing services. In addition, this segment offers financial reporting document composition and management solutions; SEC disclosure and filing services; registrar, stock transfer, and record-keeping services; customer communication solutions; cloud-based marketing and customer communication tools; customer and account data aggregation and reporting services, as well as creates sales and educational content, including seminars and a library of financial planning topics; and mutual fund trade processing services. The company's Global Technology and Operations segment offers desktop productivity tools, data aggregation, performance reporting, portfolio management, order capture and execution, trade confirmation, margin, cash management, clearance and settlement, asset servicing, reference data management, reconciliations, securities financing and collateral optimization, compliance and regulatory reporting, and accounting. It also provides capital market, wealth management, asset management, and international securities processing solutions; managed services; and customizable advisor Websites, search engine marketing, and electronic and print newsletters. The company was founded in 1962 and is headquartered in Lake Success, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "5 Dakota Drive, Lake Success, NY, United States, 11042", "FullTimeEmployees": "12000", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "16483137536", "EBITDA": "924200000", "PERatio": "35.1418", "PEGRatio": "3.3967", "BookValue": "11.699", "DividendPerShare": "2.3", "DividendYield": "0.0165", "EPS": "3.95", "RevenuePerShareTTM": "39.486", "ProfitMargin": "0.1021", "OperatingMarginTTM": "0.138", "ReturnOnAssetsTTM": "0.0891", "ReturnOnEquityTTM": "0.3739", "RevenueTTM": "4528999936", "GrossProfitTTM": "1263900000", "DilutedEPSTTM": "3.95", "QuarterlyEarningsGrowthYOY": "0.26", "QuarterlyRevenueGrowthYOY": "0.124", "AnalystTargetPrice": "143.71", "TrailingPE": "35.1418", "ForwardPE": "24.9377", "PriceToSalesRatioTTM": "3.586", "PriceToBookRatio": "11.8711", "EVToRevenue": "3.819", "EVToEBITDA": "18.3751", "Beta": "0.8813", "52WeekHigh": "144.5", "52WeekLow": "87", "50DayMovingAverage": "135.1742", "200DayMovingAverage": "118.6054", "SharesOutstanding": "114817000", "SharesFloat": "114445198", "SharesShort": "1837215", "SharesShortPriorMonth": "1697985", "ShortRatio": "3.49", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0184", "PercentInsiders": "0.661", "PercentInstitutions": "88.367", "ForwardAnnualDividendRate": "2.3", "ForwardAnnualDividendYield": "0.0165", "PayoutRatio": "0.5468", "DividendDate": "2020-10-05", "ExDividendDate": "2020-09-14", "LastSplitFactor": "None", "LastSplitDate": "None"}