{"Symbol": "CAT", "AssetType": "Common Stock", "Name": "Caterpillar Inc", "Description": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, and industrial gas turbines. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, feller bunchers, harvesters, motorgraders, pipelayers, road reclaimers, skidders, telehandlers, and utility vehicles; backhoe, knuckleboom, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous vehicles and solutions, select work tools, and hard rock continuous mining systems. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management. Its All Other operating segment manufactures filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions and distribution services; and digital investments services. The company was formerly known as Caterpillar Tractor Co. and changed its name to Caterpillar Inc. in 1986. The company was founded in 1925 and is headquartered in Deerfield, Illinois.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Farm & Heavy Construction Machinery", "Address": "510 Lake Cook Road, Deerfield, IL, United States, 60015", "FullTimeEmployees": "102300", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "80830750720", "EBITDA": "8576000000", "PERatio": "19.1415", "PEGRatio": "8.4547", "BookValue": "25.363", "DividendPerShare": "4.12", "DividendYield": "0.0282", "EPS": "7.487", "RevenuePerShareTTM": "84.777", "ProfitMargin": "0.089", "OperatingMarginTTM": "0.1321", "ReturnOnAssetsTTM": "0.0493", "ReturnOnEquityTTM": "0.2892", "RevenueTTM": "46534000640", "GrossProfitTTM": "14462000000", "DilutedEPSTTM": "7.487", "QuarterlyEarningsGrowthYOY": "-0.703", "QuarterlyRevenueGrowthYOY": "-0.307", "AnalystTargetPrice": "142.9", "TrailingPE": "19.1415", "ForwardPE": "29.2398", "PriceToSalesRatioTTM": "1.7059", "PriceToBookRatio": "5.6528", "EVToRevenue": "2.3096", "EVToEBITDA": "12.5921", "Beta": "1.0852", "52WeekHigh": "149.55", "52WeekLow": "87.5", "50DayMovingAverage": "138.5219", "200DayMovingAverage": "123.355", "SharesOutstanding": "541507008", "SharesFloat": "540380241", "SharesShort": "6243794", "SharesShortPriorMonth": "6891377", "ShortRatio": "1.99", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0115", "PercentInsiders": "0.186", "PercentInstitutions": "70.018", "ForwardAnnualDividendRate": "4.12", "ForwardAnnualDividendYield": "0.0282", "PayoutRatio": "0.5501", "DividendDate": "2020-08-20", "ExDividendDate": "2020-07-17", "LastSplitFactor": "2:1", "LastSplitDate": "2005-07-14"}