{"Symbol": "CBRE", "AssetType": "Common Stock", "Name": "CBRE Group, Inc", "Description": "CBRE Group, Inc. operates as a commercial real estate services and investment company worldwide. It operates through Advisory Services, Global Workplace Solutions, and Real Estate Investments segments. The Advisory Services segment provides strategic advice and execution to owners, investors, and occupiers of real estate in connection with leasing; property sales and mortgage services under the CBRE Capital Markets brand; property and project management services, including construction management, marketing, building engineering, accounting, and financial services for owners of and investors in office, industrial, and retail properties; and valuation services that include market value appraisals, litigation support, discounted cash flow analyses, and feasibility studies, as well as consulting services, such as property condition reports, hotel advisory, and environmental consulting. The Global Workplace Solutions segment offers facilities management, project management, and transaction management services. The Real Estate Investments segment provides investment management services under the CBRE Global Investors brand to pension funds, insurance companies, sovereign wealth funds, foundations, endowments, and other institutional investors; development services under the Trammell Crow Company brand primarily to users of and investors in commercial real estate; and flexible-space solutions under the CBRE Hana brand, which includes office suites, conference rooms and event space, and communal co-working space for institutional property owners. It also develops residential-led and mixed-use sites in London under the Telford Homes brand. The company was founded in 1906 and is headquartered in Los Angeles, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Real Estate", "Industry": "Real Estate Services", "Address": "400 South Hope Street, Los Angeles, CA, United States, 90071", "FullTimeEmployees": "100000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "16442034176", "EBITDA": "1740337024", "PERatio": "14.0089", "PEGRatio": "2.893", "BookValue": "19.064", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.385", "RevenuePerShareTTM": "72.526", "ProfitMargin": "0.0472", "OperatingMarginTTM": "0.0517", "ReturnOnAssetsTTM": "0.0517", "ReturnOnEquityTTM": "0.1975", "RevenueTTM": "24315060224", "GrossProfitTTM": "5205078000", "DilutedEPSTTM": "3.385", "QuarterlyEarningsGrowthYOY": "-0.636", "QuarterlyRevenueGrowthYOY": "-0.058", "AnalystTargetPrice": "50.83", "TrailingPE": "14.0089", "ForwardPE": "17.0068", "PriceToSalesRatioTTM": "0.6614", "PriceToBookRatio": "2.5425", "EVToRevenue": "0.7792", "EVToEBITDA": "11.0324", "Beta": "1.6786", "52WeekHigh": "64.75", "52WeekLow": "29.17", "50DayMovingAverage": "44.73", "200DayMovingAverage": "44.8965", "SharesOutstanding": "335278016", "SharesFloat": "324426720", "SharesShort": "8344693", "SharesShortPriorMonth": "6631780", "ShortRatio": "4.66", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0298", "PercentInsiders": "0.841", "PercentInstitutions": "96.326", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:1", "LastSplitDate": "2006-06-02"}