{"Symbol": "CTL", "AssetType": "Common Stock", "Name": "CenturyLink, Inc", "Description": "CenturyLink, Inc., a facilities-based communications company, provides various integrated services under ?CenturyLink' name to business and residential customers in the United States and internationally. The company operates through five segments: International and Global Accounts Management, Enterprise, Small and Medium Business, Wholesale, and Consumer. It offers IP and data services, including VPN data network, Ethernet, internet protocol (IP), and content delivery services. CenturyLink, Inc. also offers transport and infrastructure services comprising high bandwidth optical networks; unlit optical fiber networks, and related professional and management services; private line services, a direct circuit or channel specifically dedicated for connecting two or more organizational sites; colocation and data center services; and consulting services, which include network management, installation and maintenance of data equipment, and building of proprietary fiber-optic broadband networks for government and business customers. In addition, the company provides voice and collaboration services, including primary rate interface service, local inbound service, switched one-plus, toll free, long distance, and international services; and voice over internet protocol services, as well as satellite television services under DIRECTV name. Further, it offers IT and managed service that include network, hosting, public and private cloud, and other IT services, as well as intuitive management tools. Additionally, the company is involved in leasing and subleasing of space. As of December 31, 2019, it served approximately 4.7 million broadband subscribers. CenturyLink, Inc. was founded in 1968 and is headquartered in Monroe, Louisiana.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Telecom Services", "Address": "100 CenturyLink Drive, Monroe, LA, United States, 71203", "FullTimeEmployees": "40000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "11985136640", "EBITDA": "8682000384", "PERatio": "10.0354", "PEGRatio": "419.2256", "BookValue": "12.27", "DividendPerShare": "1", "DividendYield": "0.0939", "EPS": "1.123", "RevenuePerShareTTM": "20.478", "ProfitMargin": "0.0552", "OperatingMarginTTM": "0.1778", "ReturnOnAssetsTTM": "0.038", "ReturnOnEquityTTM": "0.0896", "RevenueTTM": "22019000320", "GrossProfitTTM": "12324000000", "DilutedEPSTTM": "1.123", "QuarterlyEarningsGrowthYOY": "0.009", "QuarterlyRevenueGrowthYOY": "-0.034", "AnalystTargetPrice": "9.66", "TrailingPE": "10.0354", "ForwardPE": "8.4602", "PriceToSalesRatioTTM": "0.5549", "PriceToBookRatio": "0.9245", "EVToRevenue": "2.0644", "EVToEBITDA": "5.4668", "Beta": "0.9604", "52WeekHigh": "15.3", "52WeekLow": "8.45", "50DayMovingAverage": "10.4219", "200DayMovingAverage": "10.3524", "SharesOutstanding": "1097539968", "SharesFloat": "991493790", "SharesShort": "113364430", "SharesShortPriorMonth": "110842420", "ShortRatio": "9.01", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1176", "PercentInsiders": "0.789", "PercentInstitutions": "78.272", "ForwardAnnualDividendRate": "1", "ForwardAnnualDividendYield": "0.0939", "PayoutRatio": "0.885", "DividendDate": "2020-09-11", "ExDividendDate": "2020-08-28", "LastSplitFactor": "3:2", "LastSplitDate": "1999-04-01"}