{"Symbol": "CHD", "AssetType": "Common Stock", "Name": "Church & Dwight Co., Inc", "Description": "Church & Dwight Co., Inc. develops, manufactures, and markets household, personal care, and specialty products in the United States and internationally. It operates in three segments: Consumer Domestic, Consumer International, and Specialty Products Division. The company offers cat litters, carpet deodorization, laundry detergents, and baking soda, as well as other baking soda based products under the ARM & HAMMER brand; condoms, lubricants, and vibrators under the TROJAN brand; stain removers, cleaning solutions, laundry detergents, and bleach alternatives under the OXICLEAN brand; battery-operated and manual toothbrushes under the SPINBRUSH brand; home pregnancy and ovulation test kits under the FIRST RESPONSE brand; depilatories under the NAIR brand; oral analgesics under the ORAJEL brand; laundry detergents under the XTRA brand; gummy dietary supplements under the L'IL CRITTERS and VITAFUSION brands; dry shampoos under the BATISTE brand; water flossers and replacement showerheads under the WATERPIK brand; and hair removal products under the FLAWLESS brand. It provides specialty products, including animal productivity products, such as MEGALAC rumen bypass fat, a supplement, which enables cows to maintain energy levels during the period of high milk production; BIO-CHLOR and FERMENTEN, which are designed to help reduce health issues associated with calving, as well as provides needed protein; and CELMANAX refined functional carbohydrate, a yeast based prebiotic. In addition, the company offers sodium bicarbonate; and cleaning and deodorizing products. It sells its consumer products through supermarkets, mass merchandisers, wholesale clubs, drugstores, convenience stores, home stores, dollar and other discount stores, pet and other specialty stores, and Websites and other e-commerce channels; and specialty products to industrial customers and livestock producers through distributors. The company was founded in 1846 and is headquartered in Ewing, New Jersey.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Household & Personal Products", "Address": "Princeton South Corporate Center, Ewing, NJ, United States, 08628", "FullTimeEmployees": "4800", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "24276146176", "EBITDA": "1119399936", "PERatio": "33.6014", "PEGRatio": "4.5736", "BookValue": "12.142", "DividendPerShare": "0.96", "DividendYield": "0.0098", "EPS": "2.859", "RevenuePerShareTTM": "18.667", "ProfitMargin": "0.157", "OperatingMarginTTM": "0.2074", "ReturnOnAssetsTTM": "0.0877", "ReturnOnEquityTTM": "0.2574", "RevenueTTM": "4593099776", "GrossProfitTTM": "1984000000", "DilutedEPSTTM": "2.859", "QuarterlyEarningsGrowthYOY": "0.364", "QuarterlyRevenueGrowthYOY": "0.106", "AnalystTargetPrice": "92.73", "TrailingPE": "33.6014", "ForwardPE": "35.3357", "PriceToSalesRatioTTM": "5.2631", "PriceToBookRatio": "7.9254", "EVToRevenue": "5.4848", "EVToEBITDA": "21.5391", "Beta": "0.4049", "52WeekHigh": "97.15", "52WeekLow": "59.36", "50DayMovingAverage": "92.065", "200DayMovingAverage": "77.463", "SharesOutstanding": "247312000", "SharesFloat": "246681299", "SharesShort": "4055638", "SharesShortPriorMonth": "6538385", "ShortRatio": "2.48", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0187", "PercentInsiders": "0.201", "PercentInstitutions": "86.362", "ForwardAnnualDividendRate": "0.96", "ForwardAnnualDividendYield": "0.0098", "PayoutRatio": "0.3269", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-13", "LastSplitFactor": "2:1", "LastSplitDate": "2016-09-02"}