{"Symbol": "CI", "AssetType": "Common Stock", "Name": "Cigna Corporation", "Description": "Cigna Corporation provides insurance and related products and services. It operates through Health Services, Integrated Medical, International Markets, and Group Disability and Other segments. The Health Services segment provides pharmacy benefits management, specialty pharmacy services, clinical solutions, home delivery, and health management services. The Integrated Medical segment offers medical, pharmacy, dental, behavioral health, vision, health advocacy programs, and other products and services to insured and self-insured clients; Medicare Advantage, Medicare Supplement, and Medicare Part D plans to Medicare-eligible beneficiaries, as well as Medicaid plans; and health insurance coverage to on and off the public exchanges. The International Markets segment offers supplemental health, life, and accident insurance products; and health care coverage, as well as health care benefits to mobile employees of multinational organizations. This segment offers health coverage, hospitalization, dental, critical illness, personal accident, term life, and variable universal life products. The Group Disability and Other segment provides group long-term and short-term disability, group life, accident, voluntary, and specialty insurance products, as well as related services; permanent insurance contracts to corporations to provide coverage on the lives of certain employees for the purpose of financing employer-paid future benefit obligations; and reinsurance, settlement annuity, individual life insurance, and annuity and retirement benefit business. The company distributes its products and services through insurance brokers and consultants; directly to employers, unions and other groups, or individuals; and private and public exchanges. Cigna Corporation has a strategic alliance with Priority Health to make health care coverage accessible to Michigan employers, their employees and families. The company was founded in 1792 and is headquartered in Bloomfield, Connecticut.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Healthcare Plans", "Address": "900 Cottage Grove Road, Bloomfield, CT, United States, 06002", "FullTimeEmployees": "73700", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "66588225536", "EBITDA": "11528999936", "PERatio": "12.6152", "PEGRatio": "0.8373", "BookValue": "128.642", "DividendPerShare": "0.04", "DividendYield": "0.0002", "EPS": "14.042", "RevenuePerShareTTM": "416.743", "ProfitMargin": "0.034", "OperatingMarginTTM": "0.0594", "ReturnOnAssetsTTM": "0.0366", "ReturnOnEquityTTM": "0.1159", "RevenueTTM": "154628997120", "GrossProfitTTM": "25256000000", "DilutedEPSTTM": "14.042", "QuarterlyEarningsGrowthYOY": "0.278", "QuarterlyRevenueGrowthYOY": "0.012", "AnalystTargetPrice": "242", "TrailingPE": "12.6152", "ForwardPE": "9.5877", "PriceToSalesRatioTTM": "0.4299", "PriceToBookRatio": "1.375", "EVToRevenue": "0.6107", "EVToEBITDA": "0", "Beta": "0.6648", "52WeekHigh": "224.64", "52WeekLow": "118.5", "50DayMovingAverage": "178.547", "200DayMovingAverage": "184.2326", "SharesOutstanding": "367200992", "SharesFloat": "365933787", "SharesShort": "3501765", "SharesShortPriorMonth": "3175801", "ShortRatio": "1.8", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0096", "PercentInsiders": "1.449", "PercentInstitutions": "92.715", "ForwardAnnualDividendRate": "0.04", "ForwardAnnualDividendYield": "0.0002", "PayoutRatio": "0.0028", "DividendDate": "2020-04-09", "ExDividendDate": "2020-03-09", "LastSplitFactor": "3:1", "LastSplitDate": "2007-06-05"}