{"Symbol": "CINF", "AssetType": "Common Stock", "Name": "Cincinnati Financial Corporation", "Description": "Cincinnati Financial Corporation, together with its subsidiary, provides property casualty insurance products in the United States. The company operates in five segments: Commercial Lines Insurance, Personal Lines Insurance, Excess and Surplus Lines Insurance, Life Insurance, and Investments. The Commercial Lines Insurance segment offers coverage for commercial casualty, commercial property, commercial auto, and workers' compensation. It also provides director and officer liability insurance, contract and commercial surety bonds, and fidelity bonds; and machinery and equipment coverage. The Personal Lines Insurance segment offers personal auto insurance; homeowners insurance; and dwelling fire, inland marine, personal umbrella liability, and watercraft coverages to individuals. The Excess and Surplus Lines Insurance segment offers commercial casualty insurance that covers businesses for third-party liability from accidents occurring on their premises or arising out of their operations, such as injuries sustained from products; and commercial property insurance, which insures buildings, inventory, equipment, and business income from loss or damage due to various causes, such as fire, wind, hail, water, theft, and vandalism. The Life Insurance segment provides term life insurance products; universal life insurance products; worksite products, such as term life; and whole life insurance products, as well as markets deferred annuities and immediate annuities. The Investments segment invests in fixed-maturity investments, including taxable and tax-exempt bonds, and redeemable preferred stocks; and equity investments comprising common and nonredeemable preferred stocks. The company also offers commercial leasing and financing services; and insurance brokerage services. Cincinnati Financial Corporation was founded in 1950 and is headquartered in Fairfield, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceProperty & Casualty", "Address": "6200 South Gilmore Road, Fairfield, OH, United States, 45014-5141", "FullTimeEmployees": "5148", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13136946176", "EBITDA": "776000000", "PERatio": "23.8468", "PEGRatio": "-158.72", "BookValue": "57.575", "DividendPerShare": "2.4", "DividendYield": "0.03", "EPS": "3.416", "RevenuePerShareTTM": "39.821", "ProfitMargin": "0.0861", "OperatingMarginTTM": "0.1079", "ReturnOnAssetsTTM": "0.0175", "ReturnOnEquityTTM": "0.0606", "RevenueTTM": "6466999808", "GrossProfitTTM": "2634000000", "DilutedEPSTTM": "3.416", "QuarterlyEarningsGrowthYOY": "1.174", "QuarterlyRevenueGrowthYOY": "0.419", "AnalystTargetPrice": "82", "TrailingPE": "23.8468", "ForwardPE": "22.8311", "PriceToSalesRatioTTM": "2.0064", "PriceToBookRatio": "1.3797", "EVToRevenue": "2.0155", "EVToEBITDA": "0", "Beta": "0.5923", "52WeekHigh": "118.19", "52WeekLow": "48.19", "50DayMovingAverage": "79.4225", "200DayMovingAverage": "75.3996", "SharesOutstanding": "160854000", "SharesFloat": "146984716", "SharesShort": "4058532", "SharesShortPriorMonth": "3164851", "ShortRatio": "4.29", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0353", "PercentInsiders": "6.571", "PercentInstitutions": "64.91", "ForwardAnnualDividendRate": "2.4", "ForwardAnnualDividendYield": "0.03", "PayoutRatio": "0.6967", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-15", "LastSplitFactor": "105:100", "LastSplitDate": "2005-04-04"}