{"Symbol": "CMS", "AssetType": "Common Stock", "Name": "CMS Energy Corporation", "Description": "CMS Energy Corporation operates as an energy company primarily in Michigan. The company operates in four segments: Electric Utility, Gas Utility, Enterprises, and EnerBank. The Electric Utility segment is involved in the generation, purchase, transmission, distribution, and sale of electricity. This segment generates electricity through coal, wind, gas, renewable energy, oil, and nuclear sources. Its transmission and distribution system comprises 213 miles of transmission overhead lines; 205 miles of high-voltage distribution overhead lines; 4 miles of high-voltage distribution underground lines; 4,430 miles of high-voltage distribution overhead lines; 19 miles of high-voltage distribution underground lines; 66,917 miles of electric distribution overhead lines; 9,314 miles of underground distribution lines; substations; and a battery facility. The Gas Utility segment engages in the purchase, transmission, storage, distribution, and sale of natural gas, which includes 2,426 miles of transmission lines; 15 gas storage fields; 27,729 miles of distribution mains; and 8 compressor stations. The Enterprises segment is involved in the independent power production and marketing, including the development and operation of renewable generation. It owns interests in independent power plants totaling 1,335 megawatts. The EnterBank segment operates an industrial bank providing unsecured consumer installment loans for financing home improvements. It serves 1.8 million electric and 1.8 million gas customers, including residential, commercial, and diversified industrial customers. CMS Energy Corporation was founded in 1987 and is headquartered in Jackson, Michigan.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Utilities", "Industry": "UtilitiesRegulated Electric", "Address": "One Energy Plaza, Jackson, MI, United States, 49201", "FullTimeEmployees": "8128", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17674989568", "EBITDA": "2279000064", "PERatio": "22.9129", "PEGRatio": "3.1572", "BookValue": "18.212", "DividendPerShare": "1.63", "DividendYield": "0.0271", "EPS": "2.64", "RevenuePerShareTTM": "23.429", "ProfitMargin": "0.1133", "OperatingMarginTTM": "0.2119", "ReturnOnAssetsTTM": "0.0327", "ReturnOnEquityTTM": "0.1489", "RevenueTTM": "6648000000", "GrossProfitTTM": "2564000000", "DilutedEPSTTM": "2.64", "QuarterlyEarningsGrowthYOY": "0.449", "QuarterlyRevenueGrowthYOY": "-0.001", "AnalystTargetPrice": "64.71", "TrailingPE": "22.9129", "ForwardPE": "22.8311", "PriceToSalesRatioTTM": "2.5959", "PriceToBookRatio": "3.3213", "EVToRevenue": "4.6563", "EVToEBITDA": "12.6347", "Beta": "0.2132", "52WeekHigh": "69.17", "52WeekLow": "46.03", "50DayMovingAverage": "61.6761", "200DayMovingAverage": "59.9275", "SharesOutstanding": "286280992", "SharesFloat": "284759738", "SharesShort": "5125200", "SharesShortPriorMonth": "5191375", "ShortRatio": "3.25", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0206", "PercentInsiders": "0.456", "PercentInstitutions": "94.554", "ForwardAnnualDividendRate": "1.63", "ForwardAnnualDividendYield": "0.0271", "PayoutRatio": "0.5985", "DividendDate": "2020-08-31", "ExDividendDate": "2020-08-06", "LastSplitFactor": "None", "LastSplitDate": "None"}