{"Symbol": "GLW", "AssetType": "Common Stock", "Name": "Corning Incorporated", "Description": "Corning Incorporated engages in display technologies, optical communications, environmental technologies, specialty materials, and life sciences businesses worldwide. The company's Display Technologies segment manufactures glass substrates for organic light-emitting diodes and liquid crystal displays used in televisions, notebook computers, and flat panel desktop monitors. Its Optical Communications segment manufactures optical fibers and cables; and hardware and equipment products, including cable assemblies, fiber optic hardware and connectors, optical components and couplers, closures, network interface devices, and other accessories for various carrier network applications. This segment also offers operator-grade distributed antenna systems; optical network evolution wireless platform; subscriber demarcation, connection and protection devices, various digital subscriber line passive solutions, and outside plant enclosures; and coaxial RF interconnects for the cable television industry and microwave applications. The company's Environmental Technologies segment manufactures ceramic substrates and filter products for emissions control in mobile, gasoline, and diesel applications. Its Specialty Materials segment manufactures products that provide material formulations for glass, glass ceramics, and fluoride crystals. The company's Life Sciences segment offers laboratory products comprising consumables, such as plastic vessels, specialty surfaces, cell culture media, and serum, as well as general labware and equipment under the Corning, Falcon, Pyrex, and Axygen brands. It also offers pharmaceutical glass tubing and packages. Corning Incorporated has a strategic collaboration with Intel Corporation to accelerate the availability of 5G in buildings. The company was formerly known as Corning Glass Works and changed its name to Corning Incorporated in April 1989. Corning Incorporated was founded in 1851 and is headquartered in Corning, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Electronic Components", "Address": "One Riverfront Plaza, Corning, NY, United States, 14831", "FullTimeEmployees": "49500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "25671852032", "EBITDA": "2272999936", "PERatio": "231.8571", "PEGRatio": "2.6875", "BookValue": "12.845", "DividendPerShare": "0.88", "DividendYield": "0.0268", "EPS": "0.136", "RevenuePerShareTTM": "13.991", "ProfitMargin": "0.0189", "OperatingMarginTTM": "0.0702", "ReturnOnAssetsTTM": "0.017", "ReturnOnEquityTTM": "0.0158", "RevenueTTM": "10702999552", "GrossProfitTTM": "4035000000", "DilutedEPSTTM": "0.136", "QuarterlyEarningsGrowthYOY": "-0.441", "QuarterlyRevenueGrowthYOY": "-0.129", "AnalystTargetPrice": "29.79", "TrailingPE": "231.8571", "ForwardPE": "29.4985", "PriceToSalesRatioTTM": "2.5051", "PriceToBookRatio": "2.5364", "EVToRevenue": "3.1177", "EVToEBITDA": "16.3891", "Beta": "1.1687", "52WeekHigh": "33.86", "52WeekLow": "17.44", "50DayMovingAverage": "31.2414", "200DayMovingAverage": "25.2431", "SharesOutstanding": "761776000", "SharesFloat": "759148182", "SharesShort": "20946409", "SharesShortPriorMonth": "23709541", "ShortRatio": "4.21", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0276", "PercentInsiders": "0.325", "PercentInstitutions": "75.62", "ForwardAnnualDividendRate": "0.88", "ForwardAnnualDividendYield": "0.0268", "PayoutRatio": "6", "DividendDate": "2020-09-30", "ExDividendDate": "2020-08-27", "LastSplitFactor": "3:1", "LastSplitDate": "2000-10-04"}