{"Symbol": "DHR", "AssetType": "Common Stock", "Name": "Danaher Corporation", "Description": "Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The company operates through three segments; Life Sciences, Diagnostics, and Environmental & Applied Solutions. The Life Sciences segment provides mass spectrometers; cellular analysis, lab automation, and centrifugation instruments; microscopes; and genomics consumables. This segment also offers filtration, separation, and purification technologies to the biopharmaceutical, food and beverage, medical, aerospace, microelectronics, and general industrial sectors. The Diagnostics segment provides chemistry, immunoassay, microbiology, and automation systems, as well as hematology and molecular diagnostics products. This segment offers analytical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The Environmental & Applied Solutions segment offers instrumentation, consumables, software, services, and disinfection systems to analyze, treat, and manage ultra-pure, potable, industrial, waste, ground, source, and ocean water in residential, commercial, industrial, and natural resource applications. This segment also provides equipment, software, services, and consumables for various color and appearance management, packaging design and quality management, packaging converting, printing, marking, coding, and traceability applications for consumer, pharmaceutical, and industrial products. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is headquartered in Washington, the District of Columbia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "2200 Pennsylvania Avenue NW, Washington, DC, United States, 20037-1701", "FullTimeEmployees": "60000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "148954611712", "EBITDA": "4670400000", "PERatio": "51.6136", "PEGRatio": "2.5773", "BookValue": "46.523", "DividendPerShare": "0.72", "DividendYield": "0.0035", "EPS": "4.682", "RevenuePerShareTTM": "26.629", "ProfitMargin": "0.1835", "OperatingMarginTTM": "0.1748", "ReturnOnAssetsTTM": "0.0331", "ReturnOnEquityTTM": "0.086", "RevenueTTM": "18886899712", "GrossProfitTTM": "9983700000", "DilutedEPSTTM": "4.682", "QuarterlyEarningsGrowthYOY": "0.276", "QuarterlyRevenueGrowthYOY": "0.192", "AnalystTargetPrice": "219", "TrailingPE": "51.6136", "ForwardPE": "40.1606", "PriceToSalesRatioTTM": "7.7966", "PriceToBookRatio": "4.3946", "EVToRevenue": "8.7421", "EVToEBITDA": "31.399", "Beta": "0.8896", "52WeekHigh": "210.575", "52WeekLow": "119.6", "50DayMovingAverage": "201.8467", "200DayMovingAverage": "169.1688", "SharesOutstanding": "709409024", "SharesFloat": "629110851", "SharesShort": "5684842", "SharesShortPriorMonth": "6971214", "ShortRatio": "2.49", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.009", "PercentInsiders": "11.468", "PercentInstitutions": "82.128", "ForwardAnnualDividendRate": "0.72", "ForwardAnnualDividendYield": "0.0035", "PayoutRatio": "0.1768", "DividendDate": "2020-07-31", "ExDividendDate": "2020-06-25", "LastSplitFactor": "1319:1000", "LastSplitDate": "2016-07-05"}