{"Symbol": "XRAY", "AssetType": "Common Stock", "Name": "DENTSPLY SIRONA Inc", "Description": "DENTSPLY SIRONA Inc. designs, develops, manufactures, and markets various dental products and technologies, and other consumable dental products and equipment primarily for the professional dental market worldwide. The company operates in two segments, Technologies & Equipment; and Consumables. Its dental supplies include endodontic instruments and materials, dental anesthetics, prophylaxis pastes, dental sealants, impression materials, restorative materials, tooth whiteners, and topical fluoride products; and small equipment products comprise dental hand pieces, intraoral curing light systems, dental diagnostic systems, and ultrasonic scalers and polishers. The company also offers dental laboratory products, such as dental prosthetics that include artificial teeth, precious metal dental alloys, dental ceramics, and crown and bridge materials; and laboratory-based CAD/CAM milling systems, amalgamators, mixing machines, and porcelain furnaces. In addition, it provides dental technology products, including dental implants and related scanning equipment, treatment software, and orthodontic appliances for dental practitioners and specialist; and dental equipment, such as treatment centers, imaging equipment, and computer aided design and machining systems for dental practitioners. Further, the company offers healthcare consumable products, such as urology catheters, medical drills, and other non-medical products. It markets and sells dental products through distributors, dealers, and importers to dentists; dental hygienists, assistants, laboratories, and schools; and urology products directly to patients, as well as through distributors to urologists, urology nurses, general practitioners, and direct-to-patients. The company was formerly known as DENTSPLY International Inc. and changed its name to DENTSPLY SIRONA Inc. in February 2016. DENTSPLY SIRONA Inc. was founded in 1899 and is headquartered in Charlotte, North Carolina.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "13320 Ballantyne Corporate Place, Charlotte, NC, United States, 28277-3607", "FullTimeEmployees": "15200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "9997284352", "EBITDA": "634400000", "PERatio": "126.1892", "PEGRatio": "18.9096", "BookValue": "21.26", "DividendPerShare": "0.4", "DividendYield": "0.0089", "EPS": "0.377", "RevenuePerShareTTM": "15.548", "ProfitMargin": "-0.014", "OperatingMarginTTM": "0.0928", "ReturnOnAssetsTTM": "0.0232", "ReturnOnEquityTTM": "-0.0098", "RevenueTTM": "3438500096", "GrossProfitTTM": "2190400000", "DilutedEPSTTM": "-0.223", "QuarterlyEarningsGrowthYOY": "2.018", "QuarterlyRevenueGrowthYOY": "-0.514", "AnalystTargetPrice": "48.77", "TrailingPE": "126.1892", "ForwardPE": "29.4118", "PriceToSalesRatioTTM": "2.8834", "PriceToBookRatio": "2.1049", "EVToRevenue": "3.184", "EVToEBITDA": "32.0499", "Beta": "1.0302", "52WeekHigh": "60.87", "52WeekLow": "31.575", "50DayMovingAverage": "44.2678", "200DayMovingAverage": "43.1878", "SharesOutstanding": "218496000", "SharesFloat": "217602742", "SharesShort": "5292068", "SharesShortPriorMonth": "5014836", "ShortRatio": "3.39", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0295", "PercentInsiders": "0.357", "PercentInstitutions": "95.953", "ForwardAnnualDividendRate": "0.4", "ForwardAnnualDividendYield": "0.0089", "PayoutRatio": "1.0473", "DividendDate": "2020-10-09", "ExDividendDate": "2020-09-24", "LastSplitFactor": "2:1", "LastSplitDate": "2006-07-18"}