{"Symbol": "DUK", "AssetType": "Common Stock", "Name": "Duke Energy Corporation", "Description": "Duke Energy Corporation, together with its subsidiaries, operates as an energy company in the United States. It operates through three segments: Electric Utilities and Infrastructure, Gas Utilities and Infrastructure, and Commercial Renewables. The Electric Utilities and Infrastructure segment generates, transmits, distributes, and sells electricity in the Carolinas, Florida, and the Midwest; and uses coal, hydroelectric, natural gas, oil, renewable sources, and nuclear fuel to generate electricity. It also engages in the wholesale of electricity to municipalities, electric cooperative utilities, and load-serving entities. This segment serves approximately 7.8 million retail electric customers in 6 states in the Southeast and Midwest regions of the United States covering a service territory of approximately 91,000 square miles; and owns approximately 51,144 megawatts (MW) of generation capacity. The Gas Utilities and Infrastructure segment distributes natural gas to residential, commercial, industrial, and power generation natural gas customers; and owns, operates, and invests in pipeline transmission and natural gas storage facilities. It has approximately 1.6 million customers, including 1.1 million customers in North Carolina, South Carolina, and Tennessee, as well as 535,000 customers in southwestern Ohio and northern Kentucky. The Commercial Renewables segment acquires, owns, develops, builds, and operates wind and solar renewable generation projects, including nonregulated renewable energy and energy storage services to utilities, electric cooperatives, municipalities, and commercial and industrial customers. It has 22 wind, 126 solar, and 1 battery storage facilities, as well as 11 fuel cell locations with a capacity of 2,282 MW across 19 states. The company was formerly known as Duke Energy Holding Corp. and changed its name to Duke Energy Corporation in April 2005. The company was incorporated in 2005 and is headquartered in Charlotte, North Carolina.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Utilities", "Industry": "UtilitiesRegulated Electric", "Address": "550 South Tryon Street, Charlotte, NC, United States, 28202-1803", "FullTimeEmployees": "29000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "59915644928", "EBITDA": "10940999680", "PERatio": "28.2092", "PEGRatio": "3.2672", "BookValue": "59.214", "DividendPerShare": "3.86", "DividendYield": "0.0474", "EPS": "2.798", "RevenuePerShareTTM": "32.776", "ProfitMargin": "0.0897", "OperatingMarginTTM": "0.2333", "ReturnOnAssetsTTM": "0.0223", "ReturnOnEquityTTM": "0.0421", "RevenueTTM": "23992000512", "GrossProfitTTM": "11560000000", "DilutedEPSTTM": "2.798", "QuarterlyEarningsGrowthYOY": "0.004", "QuarterlyRevenueGrowthYOY": "-0.077", "AnalystTargetPrice": "92.43", "TrailingPE": "28.2092", "ForwardPE": "15.748", "PriceToSalesRatioTTM": "2.3869", "PriceToBookRatio": "1.3442", "EVToRevenue": "5.1688", "EVToEBITDA": "13.1348", "Beta": "0.3363", "52WeekHigh": "103.79", "52WeekLow": "62.13", "50DayMovingAverage": "82.4786", "200DayMovingAverage": "84.7587", "SharesOutstanding": "735432000", "SharesFloat": "734395178", "SharesShort": "36674689", "SharesShortPriorMonth": "35717802", "ShortRatio": "10.52", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0499", "PercentInsiders": "0.1", "PercentInstitutions": "65.292", "ForwardAnnualDividendRate": "3.86", "ForwardAnnualDividendYield": "0.0474", "PayoutRatio": "1.3404", "DividendDate": "2020-09-16", "ExDividendDate": "2020-08-13", "LastSplitFactor": "1:3", "LastSplitDate": "2012-07-03"}