{"Symbol": "DXC", "AssetType": "Common Stock", "Name": "DXC Technology Company", "Description": "DXC Technology Company, together with its subsidiaries, provides information technology services and solutions primarily in North America, Europe, Asia, and Australia. It operates in two segments, Global Business Services (GBS) and Global Infrastructure Services (GIS). The GBS segment offers a portfolio of analytics services and extensive partner ecosystem that help its customers to gain rapid insights, automate operations, and accelerate their digital transformation journeys; and software engineering and solutions that enable businesses to run and manage their mission-critical functions, transform their operations, and develop new ways of doing business. This segment also uses various technologies and methods to accelerate the creation, modernization, delivery, and maintenance of secure applications allowing customers to innovate faster while reducing risk, time to market, and total cost of ownership. In addition, it offers business process services, which include digital integration and optimization of front and back office processes, and agile process automation. The GIS segment adapts legacy apps to cloud, migrate the right workloads, and securely manage their multi-cloud environments; and offers security solutions help predict attacks, proactively respond to threats, and ensure compliance, as well as to protect data, applications, and infrastructure. It also provides IT outsourcing services support infrastructure, applications, and workplace IT operations, including hardware, software, physical/virtual end-user devices, collaboration tools, and IT support services. In addition, this segment offers workplace and mobility services to fit its customer's employee, business, and IT needs from intelligent collaboration; and modern device management, digital support services, Internet of Things and mobility services. The company was founded in 1959 and is headquartered in Tysons, Virginia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "1775 Tysons Boulevard, Tysons, VA, United States, 22102", "FullTimeEmployees": "138000", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "5686342656", "EBITDA": "2927000064", "PERatio": "6.9884", "PEGRatio": "0.28", "BookValue": "18.076", "DividendPerShare": "0.84", "DividendYield": "0.0507", "EPS": "4.207", "RevenuePerShareTTM": "75.184", "ProfitMargin": "-0.299", "OperatingMarginTTM": "0.0635", "ReturnOnAssetsTTM": "0.0252", "ReturnOnEquityTTM": "-0.7086", "RevenueTTM": "19189000192", "GrossProfitTTM": "4676000000", "DilutedEPSTTM": "-22.48", "QuarterlyEarningsGrowthYOY": "-0.807", "QuarterlyRevenueGrowthYOY": "-0.079", "AnalystTargetPrice": "23.54", "TrailingPE": "0", "ForwardPE": "9.3197", "PriceToSalesRatioTTM": "0.2628", "PriceToBookRatio": "1.0936", "EVToRevenue": "0.6892", "EVToEBITDA": "12.094", "Beta": "2.4099", "52WeekHigh": "38.37", "52WeekLow": "7.9", "50DayMovingAverage": "18.5328", "200DayMovingAverage": "17.221", "SharesOutstanding": "254195008", "SharesFloat": "252532157", "SharesShort": "8322337", "SharesShortPriorMonth": "9128093", "ShortRatio": "2.67", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0372", "PercentInsiders": "0.621", "PercentInstitutions": "96.324", "ForwardAnnualDividendRate": "0.84", "ForwardAnnualDividendYield": "0.0507", "PayoutRatio": "0", "DividendDate": "2020-04-14", "ExDividendDate": "2020-03-24", "LastSplitFactor": "1156:1000", "LastSplitDate": "2018-06-01"}