{"Symbol": "EMN", "AssetType": "Common Stock", "Name": "Eastman Chemical Company", "Description": "Eastman Chemical Company operates as an advanced materials and specialty additives company worldwide. The company's Additives & Functional Products segment offers specialty coalescent, specialty and commodity solvents, paint additives, and specialty polymers; hydrocarbon and rosin resins; insoluble sulfur and anti-degradant rubber additives; performance resins; amine derivative-based building blocks; heat transfer and aviation fluids; organic acid-based solutions; and metam-based soil fumigants, thiram and ziram based fungicides, and plant growth regulators. It serves the transportation, consumables, building and construction, animal nutrition, crop protection, energy, personal and home care, and other markets. Its Advanced Materials segment provides copolyesters, cellulose esters, polyvinyl butyral (PVB) sheets, and window and protective films, and aftermarket applied film products for value-added end uses in the transportation, consumables, building and construction, durable goods, and health and wellness markets. The company's Chemical Intermediates segment offers Olefin and acetyl derivatives, ethylene, and commodity solvents; primary non-phthalate and phthalate plasticizers, and niche non- phthalate plasticizers; and methylamines and salts higher amines and solvents to the industrial chemicals and processing, building and construction, health and wellness, and agrochemicals. Its Fibers segment provides cellulose acetate tow, triacetin, cellulose acetate flake, and acetic anhydride for use in filtration media primarily cigarette filters; natural and solution dyed acetate yarns for use in consumables, and health and wellness markets; and wet-laid nonwoven media, specialty and engineered papers, and cellulose acetate fibers for transportation, industrial, agriculture and mining, aerospace, personal hygiene, and consumables markets. Eastman Chemical Company was founded in 1920 and is headquartered in Kingsport, Tennessee.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Basic Materials", "Industry": "Chemicals", "Address": "200 South Wilcox Drive, Kingsport, TN, United States, 37662", "FullTimeEmployees": "14500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "10704831488", "EBITDA": "1671000064", "PERatio": "17.2837", "PEGRatio": "5.5448", "BookValue": "44.501", "DividendPerShare": "2.64", "DividendYield": "0.0334", "EPS": "4.22", "RevenuePerShareTTM": "63.934", "ProfitMargin": "0.0664", "OperatingMarginTTM": "0.1255", "ReturnOnAssetsTTM": "0.0423", "ReturnOnEquityTTM": "0.097", "RevenueTTM": "8695000064", "GrossProfitTTM": "2234000000", "DilutedEPSTTM": "4.22", "QuarterlyEarningsGrowthYOY": "-0.892", "QuarterlyRevenueGrowthYOY": "-0.186", "AnalystTargetPrice": "81.42", "TrailingPE": "17.2837", "ForwardPE": "12.6422", "PriceToSalesRatioTTM": "1.1507", "PriceToBookRatio": "1.6435", "EVToRevenue": "1.7624", "EVToEBITDA": "10.6865", "Beta": "1.6736", "52WeekHigh": "83.99", "52WeekLow": "34.44", "50DayMovingAverage": "74.2361", "200DayMovingAverage": "64.3725", "SharesOutstanding": "135350000", "SharesFloat": "134400573", "SharesShort": "2673170", "SharesShortPriorMonth": "2724358", "ShortRatio": "2.84", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0223", "PercentInsiders": "0.621", "PercentInstitutions": "84.054", "ForwardAnnualDividendRate": "2.64", "ForwardAnnualDividendYield": "0.0334", "PayoutRatio": "0.6147", "DividendDate": "2020-10-02", "ExDividendDate": "2020-09-14", "LastSplitFactor": "2:1", "LastSplitDate": "2011-10-04"}