{"Symbol": "ETN", "AssetType": "Common Stock", "Name": "Eaton Corporation plc", "Description": "Eaton Corporation plc operates as a power management company worldwide. Its Electrical Products segment offers electrical and industrial components, wiring devices, and structural support systems; and residential, single phase power quality, emergency lighting and fire detection, and circuit protection and lighting products. The company's Electrical Systems and Services segment provides power distribution and assemblies, three phase power quality products, hazardous duty electrical equipment, explosion-proof instrumentation, utility power distribution equipment, power reliability equipment, and services. Its Hydraulics segment offers power, controls and sensing, and fluid conveyance products; and filtration systems solutions, industrial drum and disc brakes, and golf grips. The company's Aerospace segment provides hydraulic power generation and fuel systems, controls and sensing, and fluid and conveyance products for commercial and military use. Its Vehicle segment offers transmissions, clutches, hybrid power systems, superchargers, engine valves and valve actuation systems, cylinder heads, locking and limited slip differentials, transmission controls, and fuel vapor components for vehicle industry. The company's eMobility segment provides voltage inverters, converters, fuses, circuit protection units, vehicle controls, power distribution products, fuel tank isolation valves, and commercial vehicle hybrid systems. It serves industrial, institutional, governmental, utility, commercial, residential, information technology, renewable energy, marine, agriculture, oil and gas, construction, mining, forestry, material handling, truck and bus, machine tools, molding, primary metals, and power generation markets, as well as original equipment manufacturers and aftermarket customers. The company was founded in 1916 and is based in Dublin, Ireland.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "Eaton House, Dublin, Ireland, 4", "FullTimeEmployees": "93000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "41908473856", "EBITDA": "2832999936", "PERatio": "27.4435", "PEGRatio": "3.5917", "BookValue": "35.461", "DividendPerShare": "2.92", "DividendYield": "0.0282", "EPS": "3.736", "RevenuePerShareTTM": "46.822", "ProfitMargin": "0.0803", "OperatingMarginTTM": "0.1039", "ReturnOnAssetsTTM": "0.0398", "ReturnOnEquityTTM": "0.1011", "RevenueTTM": "19196999680", "GrossProfitTTM": "7052000000", "DilutedEPSTTM": "3.736", "QuarterlyEarningsGrowthYOY": "-0.915", "QuarterlyRevenueGrowthYOY": "-0.303", "AnalystTargetPrice": "105.4", "TrailingPE": "27.4435", "ForwardPE": "28.8184", "PriceToSalesRatioTTM": "2.1892", "PriceToBookRatio": "2.8789", "EVToRevenue": "2.5493", "EVToEBITDA": "16.5612", "Beta": "1.1511", "52WeekHigh": "105.78", "52WeekLow": "56.415", "50DayMovingAverage": "97.8144", "200DayMovingAverage": "87.4191", "SharesOutstanding": "400100000", "SharesFloat": "398859690", "SharesShort": "4923925", "SharesShortPriorMonth": "4008426", "ShortRatio": "3.2", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0123", "PercentInsiders": "0.243", "PercentInstitutions": "84.769", "ForwardAnnualDividendRate": "2.92", "ForwardAnnualDividendYield": "0.0282", "PayoutRatio": "0.7742", "DividendDate": "2020-08-28", "ExDividendDate": "2020-08-13", "LastSplitFactor": "2:1", "LastSplitDate": "2011-03-01"}