{"Symbol": "ECL", "AssetType": "Common Stock", "Name": "Ecolab Inc", "Description": "Ecolab Inc. provides water, hygiene, and energy technologies and services worldwide. The company operates through Global Industrial, Global Institutional, Global Energy, and Other segments. Its Global Industrial segment offers water treatment and process applications, and cleaning and sanitizing solutions primarily to industrial customers within the manufacturing, food and beverage processing, chemical, mining and primary metals, power generation, pulp and paper, and commercial laundry industries. The company's Global Institutional segment provides specialized cleaning and sanitizing products to the foodservice, hospitality, lodging, healthcare, government, education, and retail industries. Its Global Energy segment offers the process chemicals and water treatment needs of the petroleum and petrochemical industries in upstream and downstream applications. This segment also provides additives for drilling and well stimulation, corrosion inhibitors, oil and water separation, scale control, paraffin and asphaltene control, biocides, hydrate control, hydrogen sulfide removal, oil dispersants, foamers and anti-foamers, flow improvers, anti-foulants, crude desalting, monomer inhibitors, anti-oxidants, fuel and lubricant additives, and water treatment. The company's Other segment offers pest elimination services to detect, eliminate, and prevent pests, such as rodents and insects in restaurants, food and beverage processors, educational and healthcare facilities, hotels, quick service restaurant and grocery operations, and other institutional and commercial customers. This segment also produces and sells colloidal silica for binding and polishing applications in semiconductor, catalyst, and aerospace component manufacturing, as well as chemical industries. Ecolab Inc. sells its products through field sales and corporate account personnel, distributors, and dealers. The company was founded in 1923 and is headquartered in St. Paul, Minnesota.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Basic Materials", "Industry": "Specialty Chemicals", "Address": "1 Ecolab Place, Saint Paul, MN, United States, 55102-2233", "FullTimeEmployees": "45000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "59073265664", "EBITDA": "3157199872", "PERatio": "41.4905", "PEGRatio": "5.8491", "BookValue": "20.517", "DividendPerShare": "1.88", "DividendYield": "0.0093", "EPS": "5.29", "RevenuePerShareTTM": "50.343", "ProfitMargin": "-0.0591", "OperatingMarginTTM": "0.1496", "ReturnOnAssetsTTM": "0.0698", "ReturnOnEquityTTM": "0.1983", "RevenueTTM": "14518800384", "GrossProfitTTM": "6221400000", "DilutedEPSTTM": "-2.979", "QuarterlyEarningsGrowthYOY": "-0.04", "QuarterlyRevenueGrowthYOY": "-0.153", "AnalystTargetPrice": "193.92", "TrailingPE": "41.4905", "ForwardPE": "45.4545", "PriceToSalesRatioTTM": "3.9691", "PriceToBookRatio": "9.6058", "EVToRevenue": "4.3119", "EVToEBITDA": "21.7904", "Beta": "0.9516", "52WeekHigh": "231.36", "52WeekLow": "132.0301", "50DayMovingAverage": "198.6983", "200DayMovingAverage": "191.948", "SharesOutstanding": "285384992", "SharesFloat": "253047826", "SharesShort": "3237508", "SharesShortPriorMonth": "2906567", "ShortRatio": "2.72", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.013", "PercentInsiders": "0.515", "PercentInstitutions": "87.896", "ForwardAnnualDividendRate": "1.88", "ForwardAnnualDividendYield": "0.0093", "PayoutRatio": "0.3937", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-14", "LastSplitFactor": "2:1", "LastSplitDate": "2003-06-09"}