{"Symbol": "FLT", "AssetType": "Common Stock", "Name": "FLEETCOR Technologies, Inc", "Description": "FLEETCOR Technologies, Inc. operates as a business payments company that simplifies the way businesses manage and pay expenses. The company's portfolio of brands help companies automate, secure, digitize, and control payments on behalf of employees and suppliers. It offers payment solutions in five primary categories, including fuel, lodging, tolls, corporate payments, and gift. The company provides fuel payment solutions to businesses and government entities that operate vehicle fleets, as well as to oil and leasing companies, and fuel marketers. Its fuel payment products are in the form of plastic cards, electronic RFID tags, mobile apps, and paper vouchers to purchase fuel, oil, vehicle maintenance supplies and services, and building supplies. The company offers lodging payment solutions to businesses that have employees who travel overnight for work purposes; to airlines to accommodate traveling crews and distressed passengers whose flights have been canceled; and electronic toll and parking payments products to businesses and consumers in the form of RFID tags affixed to vehicles' windshields, as well as prepaid paper vouchers. Its corporate payments solutions enable customers to manage and control electronic payments across enterprise, optimize corporate spending, and offer innovative services. The company's gift card product management and processing services comprise card design, production and packaging, delivery and fulfillment, card and account management, transaction processing, promotion development and management, website design and hosting, program analytics, and card distribution channel management. It also provides other payment products for vehicle maintenance, employee benefit payment, and long haul transportation-related services. The company serves businesses, partners, merchants, and payment network in North America, Latin America, Europe, and the Asia Pacific. The company was founded in 1986 and is headquartered in Atlanta, Georgia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "3280 Peachtree Road, Atlanta, GA, United States, 30305", "FullTimeEmployees": "8700", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "21319763968", "EBITDA": "1342401024", "PERatio": "28.8372", "PEGRatio": "1.2876", "BookValue": "35.294", "DividendPerShare": "None", "DividendYield": "0", "EPS": "8.626", "RevenuePerShareTTM": "30.006", "ProfitMargin": "0.2988", "OperatingMarginTTM": "0.4371", "ReturnOnAssetsTTM": "0.062", "ReturnOnEquityTTM": "0.2252", "RevenueTTM": "2566168064", "GrossProfitTTM": "2137179000", "DilutedEPSTTM": "8.626", "QuarterlyEarningsGrowthYOY": "-0.369", "QuarterlyRevenueGrowthYOY": "-0.188", "AnalystTargetPrice": "287.1", "TrailingPE": "28.8372", "ForwardPE": "23.2019", "PriceToSalesRatioTTM": "8.5927", "PriceToBookRatio": "7.0269", "EVToRevenue": "9.5577", "EVToEBITDA": "17.8079", "Beta": "1.4687", "52WeekHigh": "327.48", "52WeekLow": "168.51", "50DayMovingAverage": "251.1622", "200DayMovingAverage": "242.8907", "SharesOutstanding": "84051904", "SharesFloat": "82397798", "SharesShort": "2598978", "SharesShortPriorMonth": "3092043", "ShortRatio": "4.05", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0357", "PercentInsiders": "1.844", "PercentInstitutions": "98.578", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}