{"Symbol": "FTNT", "AssetType": "Common Stock", "Name": "Fortinet, Inc", "Description": "Fortinet, Inc. provides broad, integrated, and automated cybersecurity solutions worldwide. It offers FortiGate hardware and software licenses that provide various security and networking functions, including firewall, intrusion prevention, anti-malware, virtual private network, application control, Web filtering, anti-spam, and wide area network (WAN) acceleration. The company also provides FortiSwitch product family that offers secure switching solutions for connecting customers end devices; FortiAP product family, which provides secure wireless networking solutions; FortiExtender appliance provides a WAN connection to its FortiGate products; FortiAnalyzer product family, which offers centralized network logging, analyzing, and reporting solutions; and FortiManager product family that provides central and scalable management solution for its FortiGate products. It offers FortiWeb product family provides web application firewall solutions; FortiMail product family that secure email gateway solutions; FortiSandbox technology that delivers proactive detection and mitigation services; and FortiSIEM family of software solutions, which offers a cloud-ready security information and event management solutions, as well as FortiToken and FortiAuthenticator product families for multi-factor authentication to safeguard systems, assets, and data; and FortiNAC product family to implement zero trust network access strategies. The company provides security subscription, technical support, professional, and training services. It sells its security solutions to channel partners and directly to various customers in telecommunications, technology, government, financial services, education, retail, manufacturing, and healthcare industries. Fortinet, Inc. provides its products and services in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company was founded in 2000 and is headquartered in Sunnyvale, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "899 Kifer Road, Sunnyvale, CA, United States, 94086", "FullTimeEmployees": "7756", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "21458923520", "EBITDA": "479200000", "PERatio": "55.2594", "PEGRatio": "2.9294", "BookValue": "3.362", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.388", "RevenuePerShareTTM": "13.951", "ProfitMargin": "0.1746", "OperatingMarginTTM": "0.1755", "ReturnOnAssetsTTM": "0.0771", "ReturnOnEquityTTM": "0.4935", "RevenueTTM": "2354299904", "GrossProfitTTM": "1650300000", "DilutedEPSTTM": "2.388", "QuarterlyEarningsGrowthYOY": "0.619", "QuarterlyRevenueGrowthYOY": "0.18", "AnalystTargetPrice": "139.36", "TrailingPE": "55.2594", "ForwardPE": "47.3934", "PriceToSalesRatioTTM": "9.6712", "PriceToBookRatio": "39.296", "EVToRevenue": "8.4298", "EVToEBITDA": "38.3798", "Beta": "0.9626", "52WeekHigh": "151.95", "52WeekLow": "70.2", "50DayMovingAverage": "132.7458", "200DayMovingAverage": "122.0473", "SharesOutstanding": "161832000", "SharesFloat": "137341610", "SharesShort": "4938063", "SharesShortPriorMonth": "5379415", "ShortRatio": "3.15", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.041", "PercentInsiders": "16.657", "PercentInstitutions": "79.117", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2011-06-02"}