{"Symbol": "FOXA", "AssetType": "Common Stock", "Name": "Fox Corporation", "Description": "Fox Corporation operates as a news, sports, and entertainment company in the United States. The company operates through Cable Network Programming; Television; and Other, Corporate and Eliminations segments. The Cable Network Programming segment produces and licenses news, business news, and sports content for distribution primarily through cable television systems, direct broadcast satellite operators, telecommunications companies, and online multi-channel video programming distributors. It operates FOX News, a national cable news channel; FOX Business, a business news national cable channel; FS1 and FS2 multi-sport national networks; FOX Sports Racing, a video programming service that comprises motor sports programming; and FOX Soccer Plus video programming network for live soccer and rugby competitions; FOX Deportes, a Spanish-language sports programming service; and Big Ten Network, a national video programming service. The Television segment acquires, produces, markets, and distributes broadcast network programming. It operates The FOX Network, a national television broadcast network that broadcasts sports programming and entertainment; MyNetworkTV, a programming distribution service; Fox Alternative Entertainment, a full-service production studio that develops and produces unscripted and alternative programming; Bento Box, which develops and produces animated programing; and Tubi, a free advertising-supported video-on-demand service. This segment owns and operates 29 broadcast television stations. The Other, Corporate and Eliminations segment owns the FOX Studios lot that provides production and post-production services, including 15 sound stages, 4 scoring and mixing stages, 2 broadcast studios, theaters and screening rooms, editing bays, and other production facilities in Los Angeles, California. The company was incorporated in 2018 and is based in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Broadcasting", "Address": "1211 Avenue of the Americas, New York, NY, United States, 10036", "FullTimeEmployees": "9000", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "16916263936", "EBITDA": "2779000064", "PERatio": "17.0185", "PEGRatio": "14.3349", "BookValue": "16.693", "DividendPerShare": "0.46", "DividendYield": "0.0168", "EPS": "1.62", "RevenuePerShareTTM": "20.07", "ProfitMargin": "0.0812", "OperatingMarginTTM": "0.203", "ReturnOnAssetsTTM": "0.0757", "ReturnOnEquityTTM": "0.1033", "RevenueTTM": "12302999552", "GrossProfitTTM": "4496000000", "DilutedEPSTTM": "1.62", "QuarterlyEarningsGrowthYOY": "-0.731", "QuarterlyRevenueGrowthYOY": "-0.038", "AnalystTargetPrice": "28.8", "TrailingPE": "17.0185", "ForwardPE": "13.624", "PriceToSalesRatioTTM": "1.3804", "PriceToBookRatio": "1.6518", "EVToRevenue": "1.6717", "EVToEBITDA": "9.8357", "Beta": "None", "52WeekHigh": "39.735", "52WeekLow": "19.81", "50DayMovingAverage": "25.9382", "200DayMovingAverage": "26.9484", "SharesOutstanding": "343679008", "SharesFloat": "462415579", "SharesShort": "26990678", "SharesShortPriorMonth": "22750324", "ShortRatio": "6.88", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0974", "PercentInsiders": "1.823", "PercentInstitutions": "105.937", "ForwardAnnualDividendRate": "0.46", "ForwardAnnualDividendYield": "0.0168", "PayoutRatio": "0.284", "DividendDate": "2020-10-07", "ExDividendDate": "2020-09-01", "LastSplitFactor": "None", "LastSplitDate": "None"}