{"Symbol": "GD", "AssetType": "Common Stock", "Name": "General Dynamics Corporation", "Description": "General Dynamics Corporation operates as an aerospace and defense company worldwide. It operates through five segments: Aerospace, Combat Systems, Information Technology, Mission Systems, and Marine Systems. The Aerospace segment designs, manufactures, and supports business-jet aircraft; and offers business-aviation services, including maintenance, fixed-base operation, government fleet, aircraft management, charter, and staffing services. The Combat Systems segment engages in the design, development, production, modernization, and sustainment of combat vehicles, weapons systems, and munitions. This segment offers wheeled combat and tactical vehicles; main battle tanks and tracked combat vehicles; weapons systems, armaments, and munitions; and maintenance, logistics support, and sustainment services. The Information Technology segment provides information technology (IT), IT infrastructure modernization, and professional services, as well as cloud, cyber, software development, systems engineering, and data analytics services and solutions. The Mission Systems segment offers mission-critical C4ISR products and systems, such as space, intelligence, and cyber systems; ground systems and products; and naval, air, and electronic systems. The Marine Systems segment designs and builds nuclear-powered submarines, surface combatants, and auxiliary and combat-logistics ships for the United States Navy and Jones Act ships for commercial customers. This segment provides nuclear-powered submarines; surface combatants; auxiliary and combat-logistics ships; commercial product carriers and containerships; design and engineering support services; and maintenance, modernization, and lifecycle support services, as well as repair services for navy ships. The company was founded in 1899 and is headquartered in Reston, Virginia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "11011 Sunset Hills Road, Reston, VA, United States, 20190", "FullTimeEmployees": "100000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "44164571136", "EBITDA": "5234999808", "PERatio": "13.5382", "PEGRatio": "2.9571", "BookValue": "48.52", "DividendPerShare": "4.4", "DividendYield": "0.0281", "EPS": "11.268", "RevenuePerShareTTM": "133.834", "ProfitMargin": "0.0847", "OperatingMarginTTM": "0.1139", "ReturnOnAssetsTTM": "0.0558", "ReturnOnEquityTTM": "0.2439", "RevenueTTM": "38547001344", "GrossProfitTTM": "7059000000", "DilutedEPSTTM": "11.268", "QuarterlyEarningsGrowthYOY": "-0.213", "QuarterlyRevenueGrowthYOY": "-0.03", "AnalystTargetPrice": "172.78", "TrailingPE": "13.5382", "ForwardPE": "13.7174", "PriceToSalesRatioTTM": "1.1456", "PriceToBookRatio": "3.149", "EVToRevenue": "1.4894", "EVToEBITDA": "11.0468", "Beta": "0.9978", "52WeekHigh": "193.76", "52WeekLow": "100.55", "50DayMovingAverage": "150.6411", "200DayMovingAverage": "145.7101", "SharesOutstanding": "286932000", "SharesFloat": "248930204", "SharesShort": "2812908", "SharesShortPriorMonth": "3084975", "ShortRatio": "1.97", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0121", "PercentInsiders": "5.888", "PercentInstitutions": "88.36", "ForwardAnnualDividendRate": "4.4", "ForwardAnnualDividendYield": "0.0281", "PayoutRatio": "0.3766", "DividendDate": "2020-11-13", "ExDividendDate": "2020-10-08", "LastSplitFactor": "2:1", "LastSplitDate": "2006-03-27"}