{"Symbol": "GILD", "AssetType": "Common Stock", "Name": "Gilead Sciences, Inc", "Description": "Gilead Sciences, Inc., a research-based biopharmaceutical company, discovers, develops, and commercializes medicines in the areas of unmet medical needs in the United States, Europe, and internationally. The company's products include Biktarvy, Descovy, Odefsey, Genvoya, Stribild, Complera/Eviplera, Atripla, and Truvada for the treatment of human immunodeficiency virus (HIV) infection; and Vosevi, Vemlidy, Epclusa, Harvoni, and Viread products for treating liver diseases. It also provides Yescarta, a chimeric antigen receptor T cell therapy for adult patients with relapsed or refractory large B-cell lymphoma; Zydelig, a kinase inhibitor; Letairis, an oral formulation of an endothelin receptor antagonist for pulmonary arterial hypertension; Ranexa, a tablet to treat chronic angina; and AmBisome, an antifungal agent to treat serious invasive fungal infections. In addition, the company offers its products under the name Cayston, Emtriva, Hepsera, Sovaldi, and Tybost. Further, it develops product candidates for the treatment of viral diseases, inflammatory and fibrotic diseases, and oncology. The company markets its products through its commercial teams; and in conjunction with third-party distributors and corporate partners. Gilead Sciences, Inc. has collaboration agreements with Bristol-Myers Squibb Company; Janssen Sciences Ireland UC; Japan Tobacco Inc.; Galapagos NV; Second Genome; Gadeta; Carna Biosciences Inc.; Nurix Therapeutics, Inc.; Humanigen, Inc.; Kiniksa Pharmaceuticals, Ltd.; Kyverna Therapeutics, Inc.; Glympse Bio, Inc.; Renown Institute for Health Innovation; Goldfinch Bio, Inc.; Insitro, Inc.; Novo Nordisk A/S; Yuhan Corporation; Kite Pharma, Inc.; oNKo-innate Pty. Ltd.; and Roche Holding AG. The company has partnership with Arcus Biosciences, Inc. to co-develop and co-commercialize next-generation cancer immunotherapies. Gilead Sciences, Inc. was founded in 1987 and is headquartered in Foster City, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "333 Lakeside Drive, Foster City, CA, United States, 94404", "FullTimeEmployees": "11800", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "83735961600", "EBITDA": "5564000256", "PERatio": "18.9051", "PEGRatio": "0.4523", "BookValue": "14.376", "DividendPerShare": "2.72", "DividendYield": "0.0407", "EPS": "3.896", "RevenuePerShareTTM": "17.564", "ProfitMargin": "-0.0116", "OperatingMarginTTM": "0.188", "ReturnOnAssetsTTM": "0.0437", "ReturnOnEquityTTM": "-0.014", "RevenueTTM": "22173999104", "GrossProfitTTM": "17774000000", "DilutedEPSTTM": "-0.204", "QuarterlyEarningsGrowthYOY": "-0.208", "QuarterlyRevenueGrowthYOY": "-0.095", "AnalystTargetPrice": "77.75", "TrailingPE": "18.9051", "ForwardPE": "9.7466", "PriceToSalesRatioTTM": "3.7425", "PriceToBookRatio": "4.5588", "EVToRevenue": "3.9402", "EVToEBITDA": "48.5657", "Beta": "0.656", "52WeekHigh": "85.79", "52WeekLow": "60.89", "50DayMovingAverage": "70.5811", "200DayMovingAverage": "74.1876", "SharesOutstanding": "1253720064", "SharesFloat": "1248533951", "SharesShort": "22934264", "SharesShortPriorMonth": "25221075", "ShortRatio": "2.24", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.015", "PercentInsiders": "0.406", "PercentInstitutions": "80.769", "ForwardAnnualDividendRate": "2.72", "ForwardAnnualDividendYield": "0.0407", "PayoutRatio": "0.659", "DividendDate": "2020-09-29", "ExDividendDate": "2020-09-14", "LastSplitFactor": "2:1", "LastSplitDate": "2013-01-28"}