{"Symbol": "HIG", "AssetType": "Common Stock", "Name": "The Hartford Financial Services Group, Inc", "Description": "The Hartford Financial Services Group, Inc. provides insurance and financial services to individual and business customers in the United States and internationally. Its Commercial Lines segment offers workers' compensation, property, automobile, liability, umbrella, bond, marine, livestock, and reinsurance products; and customized insurance products and risk management services, including professional liability, bond, surety, and specialty casualty coverages through regional offices, branches, sales and policyholder service centers, independent retail agents and brokers, wholesale agents, and reinsurance brokers. The company's Personal Lines segment provides automobile, homeowners, and personal umbrella coverages through direct-to-consumer channel and independent agents. Its Property & Casualty Other Operations segment offers coverage for asbestos and environmental exposures. The company's Group Benefits segment provides group life, and accident and disability coverages, as well as other group coverages to members of employer and affinity groups, and associations through direct insurance policies; reinsurance to other insurance companies; employer paid and voluntary product coverages; disability underwriting, administration, and claims processing to self-funded employer plans; and a single-company leave management solution. This segment distributes its group insurance products and services through brokers, consultants, third-party administrators, trade associations, and private exchanges. Its Hartford Funds segment offers investment products for retail and retirement accounts; exchange-traded products through broker-dealer organizations, independent financial advisers, defined contribution plans, financial consultants, bank trust groups, and registered investment advisers; and investment-management and administrative services, such as product design, implementation, and oversight. The company was founded in 1810 and is headquartered in Hartford, Connecticut.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceDiversified", "Address": "One Hartford Plaza, Hartford, CT, United States, 06155", "FullTimeEmployees": "19500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14886626304", "EBITDA": "3200999936", "PERatio": "8.3711", "PEGRatio": "1.41", "BookValue": "46.741", "DividendPerShare": "1.3", "DividendYield": "0.0317", "EPS": "4.966", "RevenuePerShareTTM": "57.598", "ProfitMargin": "0.088", "OperatingMarginTTM": "0.1304", "ReturnOnAssetsTTM": "0.0241", "ReturnOnEquityTTM": "0.1127", "RevenueTTM": "20718000128", "GrossProfitTTM": "7642000000", "DilutedEPSTTM": "4.966", "QuarterlyEarningsGrowthYOY": "0.265", "QuarterlyRevenueGrowthYOY": "-0.006", "AnalystTargetPrice": "52.33", "TrailingPE": "8.3711", "ForwardPE": "8.4531", "PriceToSalesRatioTTM": "0.7256", "PriceToBookRatio": "0.8879", "EVToRevenue": "0.9287", "EVToEBITDA": "0", "Beta": "0.9753", "52WeekHigh": "62.75", "52WeekLow": "25.43", "50DayMovingAverage": "41.5022", "200DayMovingAverage": "40.4097", "SharesOutstanding": "358196000", "SharesFloat": "356498554", "SharesShort": "2860752", "SharesShortPriorMonth": "3147665", "ShortRatio": "1.32", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.009", "PercentInsiders": "0.433", "PercentInstitutions": "93.807", "ForwardAnnualDividendRate": "1.3", "ForwardAnnualDividendYield": "0.0317", "PayoutRatio": "0.2522", "DividendDate": "2020-10-02", "ExDividendDate": "2020-08-31", "LastSplitFactor": "2:1", "LastSplitDate": "1998-07-16"}