{"Symbol": "HPE", "AssetType": "Common Stock", "Name": "Hewlett Packard Enterprise Company", "Description": "Hewlett Packard Enterprise Company provides solutions that allow customers to capture, analyze, and act upon data from edge to cloud. The company offers industry standard servers for multi-workload computing; mission-critical servers; storage solutions; and solutions for secondary workloads and traditional tape, storage networking, and disk products, such as HPE MSA and HPE XP. It also provides mobility and Internet of Things solutions under the Aruba brand, which include wired and wireless local area network products, such as Wi-Fi access points, switches, routers, and sensors; software products, such as cloud-based management, network management, network access control, analytics and assurance, and location services; and professional and support services, as well as as-a-service and consumption models for the intelligent edge portfolio of products. In addition, the company offers various flexible investment solutions, which comprise leasing, financing, IT consumption, and utility programs and asset management services for customers to facilitate unique technology deployment models and the acquisition of complete IT solutions, including hardware, software, and services from Hewlett Packard Enterprise and others. Further, it invests in communications and media solutions, Hewlett Packard labs, and various business incubation projects. The company serves commercial and large enterprise groups, including business and public sector enterprises; and through various partners comprising resellers, distribution partners, original equipment manufacturers, independent software vendors, systems integrators, and advisory firms. Hewlett Packard Enterprise Company was founded in 1939 and is headquartered in San Jose, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "6280 America Center Drive, San Jose, CA, United States, 95002", "FullTimeEmployees": "61600", "FiscalYearEnd": "October", "LatestQuarter": "2020-07-31", "MarketCapitalization": "12178420736", "EBITDA": "4687000064", "PERatio": "11.6404", "PEGRatio": "8.1894", "BookValue": "12.562", "DividendPerShare": "0.48", "DividendYield": "0.0496", "EPS": "0.001", "RevenuePerShareTTM": "20.789", "ProfitMargin": "0", "OperatingMarginTTM": "0.0777", "ReturnOnAssetsTTM": "0.0241", "ReturnOnEquityTTM": "0.0001", "RevenueTTM": "26989000704", "GrossProfitTTM": "9500000000", "DilutedEPSTTM": "0.001", "QuarterlyEarningsGrowthYOY": "0.979", "QuarterlyRevenueGrowthYOY": "-0.056", "AnalystTargetPrice": "11.21", "TrailingPE": "11.6404", "ForwardPE": "6.7159", "PriceToSalesRatioTTM": "0.4663", "PriceToBookRatio": "0.7698", "EVToRevenue": "0.868", "EVToEBITDA": "5.1388", "Beta": "1.2886", "52WeekHigh": "17.59", "52WeekLow": "7.43", "50DayMovingAverage": "9.7014", "200DayMovingAverage": "10.0584", "SharesOutstanding": "1286000000", "SharesFloat": "1282579240", "SharesShort": "29642161", "SharesShortPriorMonth": "32293838", "ShortRatio": "3.04", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0267", "PercentInsiders": "0.253", "PercentInstitutions": "85.652", "ForwardAnnualDividendRate": "0.48", "ForwardAnnualDividendYield": "0.0496", "PayoutRatio": "0.514", "DividendDate": "2020-10-07", "ExDividendDate": "2020-09-08", "LastSplitFactor": "1289:1000", "LastSplitDate": "2017-09-01"}