{"Symbol": "HOLX", "AssetType": "Common Stock", "Name": "Hologic, Inc", "Description": "Hologic, Inc. develops, manufactures, and supplies diagnostics products, medical imaging systems, surgical products, and light-based aesthetic and medical treatment systems for women in the United States and internationally. The company offers Aptima molecular diagnostic assays to detect the infectious microorganisms; Aptima quantitative viral load tests for HIV, Hepatitis C, and Hepatitis B; ThinPrep System for use in cytology applications; Rapid Fetal Fibronectin Test that assists physicians in assessing the risk of pre-term birth; and various diagnostic tests for acute respiratory ailments. It also provides breast imaging and analytics, such as 2D and 3D mammography systems and reading workstations, minimally invasive breast biopsy guidance systems and devices, breast biopsy site markers and localization, specimen radiology, and ultrasound and connectivity solutions; and breast conserving surgery products. In addition, the company offers aesthetic treatment systems, as well as TempSure, a radio frequency energy-sourced platform, which offers non-surgical and surgical aesthetic treatments and procedures. Further, it offers NovaSure Endometrial Ablation System for the treatment of abnormal uterine bleeding; MyoSure Hysteroscopic Tissue Removal System for the removal of fibroids, polyps, and other pathology within the uterus; and Fluent Fluid Management System that provides liquid distention during diagnostic and operative hysteroscopic procedures. Additionally, the company offers Horizon DXA, a dual energy X-ray system; and the Fluoroscan Insight FD mini C-arm to perform minimally invasive orthopedic surgical procedures. It sells its products through direct sales and service forces, and independent distributors and sales representatives. Hologic, Inc. has a collaboration with RadNet, Inc. to advance the use of artificial intelligence in breast health. The company was incorporated in 1985 and is headquartered in Marlborough, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "250 Campus Drive, Marlborough, MA, United States, 01752", "FullTimeEmployees": "6478", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "15989733376", "EBITDA": "1060800000", "PERatio": "31.766", "PEGRatio": "0.557", "BookValue": "8.716", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.866", "RevenuePerShareTTM": "12.437", "ProfitMargin": "0.1508", "OperatingMarginTTM": "0.202", "ReturnOnAssetsTTM": "0.0625", "ReturnOnEquityTTM": "0.2205", "RevenueTTM": "3295399936", "GrossProfitTTM": "2075200000", "DilutedEPSTTM": "1.866", "QuarterlyEarningsGrowthYOY": "0.518", "QuarterlyRevenueGrowthYOY": "-0.035", "AnalystTargetPrice": "77.73", "TrailingPE": "31.766", "ForwardPE": "17.2117", "PriceToSalesRatioTTM": "4.8213", "PriceToBookRatio": "6.8585", "EVToRevenue": "5.474", "EVToEBITDA": "23.0235", "Beta": "1.5203", "52WeekHigh": "73.63", "52WeekLow": "26.49", "50DayMovingAverage": "65.1111", "200DayMovingAverage": "52.1015", "SharesOutstanding": "258984992", "SharesFloat": "256703582", "SharesShort": "4685811", "SharesShortPriorMonth": "4127663", "ShortRatio": "1.35", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0161", "PercentInsiders": "0.333", "PercentInstitutions": "99.568", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2008-04-03"}