{"Symbol": "ITW", "AssetType": "Common Stock", "Name": "Illinois Tool Works Inc", "Description": "Illinois Tool Works Inc. manufactures and sells industrial products and equipment worldwide. It operates through seven segments: Automotive OEM; Food Equipment; Test & Measurement and Electronics; Welding; Polymers & Fluids; Construction Products; and Specialty Products. The Automotive OEM segment offers plastic and metal components, fasteners, and assemblies for automobiles, light trucks, and other industrial uses. The Food Equipment segment provides warewashing, cooking, refrigeration, and food processing equipment; kitchen exhaust, ventilation, and pollution control systems; and food equipment maintenance and repair services. The Test & Measurement and Electronics segment produces equipment, consumables, and related software for testing and measuring of materials and structures, as well as equipment and consumables used in the production of electronic subassemblies and microelectronics. The Welding segment produces arc welding equipment; and metal arc welding consumables and related accessories. The Polymers & Fluids segment produces adhesives, sealants, lubrication and cutting fluids, and fluids and polymers for auto aftermarket maintenance and appearance. The Construction Products segment offers engineered fastening systems and solutions for the residential construction, renovation/remodel, and commercial construction markets. The Specialty Products segment offers beverage packaging equipment and consumables, product coding and marking equipment and consumables, and appliance components and fasteners. It serves the automotive OEM/tiers, commercial food equipment, construction, general industrial, and automotive aftermarket end markets. The company distributes its products directly to industrial manufacturers, as well as through independent distributors. Illinois Tool Works Inc. was founded in 1912 and is headquartered in Glenview, Illinois.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "155 Harlem Avenue, Glenview, IL, United States, 60025-4075", "FullTimeEmployees": "45000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "63849119744", "EBITDA": "3332999936", "PERatio": "29.2162", "PEGRatio": "4.4302", "BookValue": "7.455", "DividendPerShare": "4.56", "DividendYield": "0.0227", "EPS": "6.811", "RevenuePerShareTTM": "39.875", "ProfitMargin": "0.1716", "OperatingMarginTTM": "0.2292", "ReturnOnAssetsTTM": "0.1239", "ReturnOnEquityTTM": "0.8018", "RevenueTTM": "12739999744", "GrossProfitTTM": "5922000000", "DilutedEPSTTM": "6.811", "QuarterlyEarningsGrowthYOY": "-0.472", "QuarterlyRevenueGrowthYOY": "-0.29", "AnalystTargetPrice": "181.22", "TrailingPE": "29.2162", "ForwardPE": "34.7222", "PriceToSalesRatioTTM": "5.005", "PriceToBookRatio": "26.6492", "EVToRevenue": "5.3979", "EVToEBITDA": "20.0376", "Beta": "1.1714", "52WeekHigh": "202.665", "52WeekLow": "122.28", "50DayMovingAverage": "190.5317", "200DayMovingAverage": "170.2004", "SharesOutstanding": "316163008", "SharesFloat": "289096513", "SharesShort": "6539580", "SharesShortPriorMonth": "7934892", "ShortRatio": "6.98", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0221", "PercentInsiders": "0.209", "PercentInstitutions": "82.275", "ForwardAnnualDividendRate": "4.56", "ForwardAnnualDividendYield": "0.0227", "PayoutRatio": "0.6294", "DividendDate": "2020-10-14", "ExDividendDate": "2020-09-29", "LastSplitFactor": "2:1", "LastSplitDate": "2006-05-26"}