{"Symbol": "INTU", "AssetType": "Common Stock", "Name": "Intuit Inc", "Description": "Intuit Inc. provides financial management and compliance products and services for consumers, small businesses, self-employed, and accounting professionals in the United States, Canada, and internationally. The company operates in three segments: Small Business & Self-Employed, Consumer, and Strategic Partner. The Small Business & Self-Employed segment provides QuickBooks online services and desktop software solutions comprising QuickBooks Enterprise, a hosted solution; QuickBooks Online Advanced, an online enterprise solution; QuickBooks Self-Employed solution; and QuickBooks Online Accountant and QuickBooks Accountant Desktop Plus solutions; payroll solutions, such as online payroll processing, direct deposit of employee paychecks, payroll reports, electronic payment of federal and state payroll taxes, and electronic filing of federal and state payroll tax forms. This segment also offers payment-processing solutions, including credit and debit cards, and ACH payment services; and financial supplies and financing for small businesses. Its Consumer segment provides TurboTax income tax preparation products and services; and personal finance. The company's Strategic Partner segment offers Lacerte, ProSeries, and ProFile desktop tax-preparation software products; and ProConnect Tax Online tax products, electronic tax filing service, and bank products and related services. It sells products and services through various sales and distribution channels, including multi-channel shop-and-buy experiences, Websites and call centers, mobile application stores, and retail and other channels. Intuit Inc. has a collaboration agreement with Red Hat, Inc. on Argo CD, a declarative continuous delivery tool for Kubernetes deployments. The company was founded in 1983 and is headquartered in Mountain View, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "2700 Coast Avenue, Mountain View, CA, United States, 94043", "FullTimeEmployees": "10600", "FiscalYearEnd": "July", "LatestQuarter": "2020-07-31", "MarketCapitalization": "92726804480", "EBITDA": "2372000000", "PERatio": "49.9119", "PEGRatio": "3.1179", "BookValue": "19.508", "DividendPerShare": "2.36", "DividendYield": "0.0068", "EPS": "6.92", "RevenuePerShareTTM": "29.421", "ProfitMargin": "0.2378", "OperatingMarginTTM": "0.2834", "ReturnOnAssetsTTM": "0.158", "ReturnOnEquityTTM": "0.4124", "RevenueTTM": "7679000064", "GrossProfitTTM": "6323000000", "DilutedEPSTTM": "6.92", "QuarterlyEarningsGrowthYOY": "-0.213", "QuarterlyRevenueGrowthYOY": "0.827", "AnalystTargetPrice": "357.06", "TrailingPE": "49.9119", "ForwardPE": "41.3223", "PriceToSalesRatioTTM": "11.8743", "PriceToBookRatio": "17.6396", "EVToRevenue": "11.2785", "EVToEBITDA": "35.6411", "Beta": "1.0181", "52WeekHigh": "360", "52WeekLow": "187.675", "50DayMovingAverage": "310.2683", "200DayMovingAverage": "281.8566", "SharesOutstanding": "260771008", "SharesFloat": "252840307", "SharesShort": "2380825", "SharesShortPriorMonth": "2227811", "ShortRatio": "2.22", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0095", "PercentInsiders": "3.492", "PercentInstitutions": "89.805", "ForwardAnnualDividendRate": "2.36", "ForwardAnnualDividendYield": "0.0068", "PayoutRatio": "0.3064", "DividendDate": "2020-10-19", "ExDividendDate": "2020-07-09", "LastSplitFactor": "2:1", "LastSplitDate": "2006-07-07"}