{"Symbol": "LHX", "AssetType": "Common Stock", "Name": "L3Harris Technologies, Inc", "Description": "L3Harris Technologies, Inc., an aerospace and defense technology company, provides mission-critical solutions for government and commercial customers worldwide. The company's Integrated Mission Systems segment provides multi-mission intelligence, surveillance, and reconnaissance (ISR) systems; and communication systems, as well as fleet management support, sensor development, modifications, and periodic depot maintenance services for ISR and airborne missions. It also manufactures and integrates maritime integrated command, control, communications, computers, and cyber ISR systems for maritime platforms; unmanned surface and undersea autonomous solutions; power and ship control systems; and other electronic and electrical products and systems, as well as designs and manufactures electro-optical and infrared sensors and surveillance, and targeting systems. Its Space and Airborne Systems segment offers space payloads, sensors, and full-mission solutions; classified intelligence and cyber defense solutions; and avionics and electronic warfare systems. The company's Communication Systems segment provides tactical radio communications, SATCOM terminals, and battlefield management networks; broadband secured mobile networked communication equipment, including airborne, space, and surface data link terminals, as well as ground stations and transportable tactical SATCOM systems; helmet and weapon mounted integrated night vision systems; and radios, systems applications, and equipment for public safety and professional communications. Its Aviation Systems segment offers defense aviation products; security, detection, and other commercial aviation products; commercial and military pilot training solutions; and mission networks for air traffic management. The company was formerly known as Harris Corporation and changed its name to L3Harris Technologies, Inc. in June 2019. L3Harris Technologies, Inc. was founded in 1895 and is headquartered in Melbourne, Florida.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "1025 West NASA Boulevard, Melbourne, FL, United States, 32919", "FullTimeEmployees": "50000", "FiscalYearEnd": "June", "LatestQuarter": "2020-07-31", "MarketCapitalization": "38422175744", "EBITDA": "4364000256", "PERatio": "22.9329", "PEGRatio": "1.6244", "BookValue": "103.411", "DividendPerShare": "3.4", "DividendYield": "0.0191", "EPS": "7.351", "RevenuePerShareTTM": "88.739", "ProfitMargin": "0.068", "OperatingMarginTTM": "0.1289", "ReturnOnAssetsTTM": "0.0432", "ReturnOnEquityTTM": "0.0896", "RevenueTTM": "24003999744", "GrossProfitTTM": "5358000000", "DilutedEPSTTM": "7.351", "QuarterlyEarningsGrowthYOY": "0.083", "QuarterlyRevenueGrowthYOY": "1.874", "AnalystTargetPrice": "234.72", "TrailingPE": "22.9329", "ForwardPE": "16.0772", "PriceToSalesRatioTTM": "2.3816", "PriceToBookRatio": "1.7722", "EVToRevenue": "3.4953", "EVToEBITDA": "19.6997", "Beta": "0.7465", "52WeekHigh": "230.99", "52WeekLow": "142.01", "50DayMovingAverage": "174.9894", "200DayMovingAverage": "183.8205", "SharesOutstanding": "216195008", "SharesFloat": "214971728", "SharesShort": "2498866", "SharesShortPriorMonth": "2504596", "ShortRatio": "1.76", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0116", "PercentInsiders": "0.481", "PercentInstitutions": "86.566", "ForwardAnnualDividendRate": "3.4", "ForwardAnnualDividendYield": "0.0191", "PayoutRatio": "0.3633", "DividendDate": "2020-09-22", "ExDividendDate": "2020-09-08", "LastSplitFactor": "10000:9448", "LastSplitDate": "2009-05-11"}