{"Symbol": "LDOS", "AssetType": "Common Stock", "Name": "Leidos Holdings, Inc", "Description": "Leidos Holdings, Inc. provides services and solutions in the defense, intelligence, civil, and health markets in the United States and internationally. It operates through three segments: Defense Solutions, Civil, and Health. The Defense Solutions segment offers national security solutions and systems for air, land, sea, space, and cyberspace for the U.S. Intelligence Community, Department of Defense, military services, the U.S. Department of Homeland Security, and government agencies of U.S. allies abroad, as well as other federal, civilian, and commercial customers in the national security industry. Its solutions include technology, intelligence systems, command and control platforms, data analytics, logistics, and cybersecurity solutions, as well as intelligence analysis and operations support services to critical missions. The Civil segment provides systems integration services to Air Navigation Service providers, including the Federal Aviation Administration, Transportation Security Administration, and airport operators; and vehicle and cargo inspection system, which enables the scanning of vehicles and cargo that produces an image using a low radiation dose. It also offers information technology (IT) solutions in cloud computing, mobility, application modernization, DevOps, data center, network modernization, asset management, help desk operations, and digital workplace enablement; federal environment and infrastructure; and logistics services. The Health segment offers solutions to federal and commercial customers responsible for health and well-being of people worldwide, including complex systems integration, managed health services, enterprise IT transformation, and life sciences services. Leidos Holdings, Inc. was founded in 1969 and is headquartered in Reston, Virginia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "11951 Freedom Drive, Reston, VA, United States, 20190", "FullTimeEmployees": "37000", "FiscalYearEnd": "January", "LatestQuarter": "2020-07-31", "MarketCapitalization": "13042033664", "EBITDA": "1222000000", "PERatio": "21.3924", "PEGRatio": "2.34", "BookValue": "24.915", "DividendPerShare": "1.36", "DividendYield": "0.015", "EPS": "4.231", "RevenuePerShareTTM": "81.634", "ProfitMargin": "0.0526", "OperatingMarginTTM": "0.0838", "ReturnOnAssetsTTM": "0.0565", "ReturnOnEquityTTM": "0.1772", "RevenueTTM": "11591999488", "GrossProfitTTM": "1548000000", "DilutedEPSTTM": "4.231", "QuarterlyEarningsGrowthYOY": "0.14", "QuarterlyRevenueGrowthYOY": "0.068", "AnalystTargetPrice": "117.92", "TrailingPE": "21.3924", "ForwardPE": "17.3913", "PriceToSalesRatioTTM": "1.1241", "PriceToBookRatio": "3.6368", "EVToRevenue": "1.5364", "EVToEBITDA": "15.1061", "Beta": "1.1181", "52WeekHigh": "125.84", "52WeekLow": "68", "50DayMovingAverage": "91.385", "200DayMovingAverage": "95.9323", "SharesOutstanding": "142194000", "SharesFloat": "141377360", "SharesShort": "2725992", "SharesShortPriorMonth": "2583872", "ShortRatio": "2.56", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.023", "PercentInsiders": "0.648", "PercentInstitutions": "78.629", "ForwardAnnualDividendRate": "1.36", "ForwardAnnualDividendYield": "0.015", "PayoutRatio": "0.3215", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-14", "LastSplitFactor": "405:1000", "LastSplitDate": "2013-09-30"}