{"Symbol": "LNC", "AssetType": "Common Stock", "Name": "Lincoln National Corporation", "Description": "Lincoln National Corporation, through its subsidiaries, operates multiple insurance and retirement businesses in the United States. It operates through four segments: Annuities, Retirement Plan Services, Life Insurance, and Group Protection. The Annuities segment offers variable, fixed, and indexed variable annuities. The Retirement Plan Services segment provides employers with retirement plan products and services primarily in the defined contribution retirement plan marketplace. This segment offers individual and group variable annuities, group fixed annuities, and mutual fund-based programs; and a range of plan services, including plan recordkeeping, compliance testing, participant education, and trust and custodial services. The Life Insurance segment provides life insurance products, including term insurance, such as single and survivorship versions of universal life insurance; variable universal life insurance; indexed universal life insurance products; and critical illness and long-term care riders. The Group Protection segment offers group non-medical insurance products comprising short and long-term disability, statutory disability and paid family medical leave administration and absence management services, term life, dental, vision and accident, and critical illness benefits and services to the employer marketplace through various forms of employee-paid and employer-paid plans. The company distributes its products through consultants, brokers, planners, agents, financial advisors, third-party administrators, and other intermediaries. Lincoln National Corporation was founded in 1905 and is headquartered in Radnor, Pennsylvania.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceLife", "Address": "150 North Radnor Chester Road, Radnor, PA, United States, 19087", "FullTimeEmployees": "11357", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6941467648", "EBITDA": "708000000", "PERatio": "33.6455", "PEGRatio": "1.24", "BookValue": "107.277", "DividendPerShare": "1.6", "DividendYield": "0.0443", "EPS": "1.106", "RevenuePerShareTTM": "86.246", "ProfitMargin": "0.0135", "OperatingMarginTTM": "0.0373", "ReturnOnAssetsTTM": "0.0012", "ReturnOnEquityTTM": "0.0116", "RevenueTTM": "16924999680", "GrossProfitTTM": "4589000000", "DilutedEPSTTM": "1.106", "QuarterlyEarningsGrowthYOY": "-0.88", "QuarterlyRevenueGrowthYOY": "-0.184", "AnalystTargetPrice": "44.64", "TrailingPE": "33.6455", "ForwardPE": "4.583", "PriceToSalesRatioTTM": "0.433", "PriceToBookRatio": "0.345", "EVToRevenue": "0.5724", "EVToEBITDA": "0", "Beta": "2.2236", "52WeekHigh": "62.95", "52WeekLow": "16.1105", "50DayMovingAverage": "37.1725", "200DayMovingAverage": "36.0136", "SharesOutstanding": "193248000", "SharesFloat": "181811696", "SharesShort": "8501890", "SharesShortPriorMonth": "7555828", "ShortRatio": "4.8", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0502", "PercentInsiders": "0.696", "PercentInstitutions": "85.965", "ForwardAnnualDividendRate": "1.6", "ForwardAnnualDividendYield": "0.0443", "PayoutRatio": "1.4", "DividendDate": "2020-11-01", "ExDividendDate": "2020-10-09", "LastSplitFactor": "2:1", "LastSplitDate": "1999-06-22"}