{"Symbol": "LYV", "AssetType": "Common Stock", "Name": "Live Nation Entertainment, Inc", "Description": "Live Nation Entertainment, Inc. operates as a live entertainment company. It operates through Concerts, Ticketing, and Sponsorship & Advertising segments. The Concerts segment promotes live music events in its owned or operated venues, and in rented third-party venues; operates and manages music venues; and produces music festivals and creates associated content. This segment also provides management and other services to artists. The Ticketing segment manages the ticketing operations, including the provision of ticketing software and services to clients, as well as ticket resale services; and offers online access for customers relating to ticket and event information through its primary Websites, livenation.com and ticketmaster.com. This segment sells tickets for its events, as well as for third-party clients in various live event categories, such as arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums, and theaters. It sells tickets through Websites, mobile apps, ticket outlets, and telephone call centers. The Sponsorship & Advertising segment sells sponsorships and placement of advertising, including signage, online advertising, and promotional programs, as well as live streaming and music-related content; and ads across its distribution network of venues, events, and Websites. This segment also manages the development of strategic sponsorship programs, as well as develops, books, and produces custom events or programs for specific brands. As of December 31, 2019, it owned, operated, or leased 143 entertainment venues in North America and 79 entertainment venues internationally. The company was formerly known as Live Nation, Inc. and changed its name to Live Nation Entertainment, Inc. in January 2010. Live Nation Entertainment, Inc. was incorporated in 2005 and is headquartered in Beverly Hills, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Entertainment", "Address": "9348 Civic Center Drive, Beverly Hills, CA, United States, 90210", "FullTimeEmployees": "10500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "12579064832", "EBITDA": "657284992", "PERatio": "182.4925", "PEGRatio": "2.65", "BookValue": "1.612", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.043", "RevenuePerShareTTM": "38.395", "ProfitMargin": "-0.0905", "OperatingMarginTTM": "-0.0666", "ReturnOnAssetsTTM": "-0.0304", "ReturnOnEquityTTM": "-0.5437", "RevenueTTM": "8102908928", "GrossProfitTTM": "3080787000", "DilutedEPSTTM": "-3.768", "QuarterlyEarningsGrowthYOY": "0.011", "QuarterlyRevenueGrowthYOY": "-0.977", "AnalystTargetPrice": "50.8", "TrailingPE": "0", "ForwardPE": "128.2051", "PriceToSalesRatioTTM": "1.4913", "PriceToBookRatio": "36.3823", "EVToRevenue": "1.9223", "EVToEBITDA": "18.2876", "Beta": "1.1055", "52WeekHigh": "76.6", "52WeekLow": "21.7", "50DayMovingAverage": "50.4978", "200DayMovingAverage": "47.3475", "SharesOutstanding": "217255008", "SharesFloat": "141309609", "SharesShort": "15513400", "SharesShortPriorMonth": "14477023", "ShortRatio": "6.93", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.1082", "PercentInsiders": "26.97", "PercentInstitutions": "77.458", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}