{"Symbol": "LKQ", "AssetType": "Common Stock", "Name": "LKQ Corporation", "Description": "LKQ Corporation, together with its subsidiaries, distributes replacement parts, components, and systems used in the repair and maintenance of vehicles. It operates in three segments: North America, Europe, and Specialty. The company distributes bumper covers, automotive body panels, and lights, as well as automotive glass products, such as windshields; salvage products, including mechanical and collision parts comprising engines; transmissions; door assemblies; sheet metal products, such as trunk lids, fenders, and hoods; lights and bumper assemblies; scrap metal and other materials to metals recyclers; and brake pads, discs and sensors, clutches, steering and suspension products, filters, and oil and automotive fluids, as well as electrical products, including spark plugs and batteries. It also operates self-service retail operations under the LKQ Pick Your Part name; and designs, manufactures, and markets vehicle equipment and accessories. In addition, the company distributes recreational vehicle appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, cargo management products, wheels, tires, and suspension products. It serves collision and mechanical repair shops, and new and used car dealerships, as well as retail customers. The company operates in the United States, Canada, the United Kingdom, Germany, Belgium, the Netherlands, Luxembourg, Italy, the Czech Republic, Poland, Slovakia, Austria, Taiwan, and various other European countries. LKQ Corporation was founded in 1998 and is headquartered in Chicago, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Auto Parts", "Address": "500 West Madison Street, Chicago, IL, United States, 60661", "FullTimeEmployees": "51000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "10099483648", "EBITDA": "1224790016", "PERatio": "17.4396", "PEGRatio": "2.148", "BookValue": "16.835", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.819", "RevenuePerShareTTM": "38.514", "ProfitMargin": "0.0472", "OperatingMarginTTM": "0.0785", "ReturnOnAssetsTTM": "0.0467", "ReturnOnEquityTTM": "0.1107", "RevenueTTM": "11784891392", "GrossProfitTTM": "4855794000", "DilutedEPSTTM": "1.819", "QuarterlyEarningsGrowthYOY": "-0.186", "QuarterlyRevenueGrowthYOY": "-0.191", "AnalystTargetPrice": "37", "TrailingPE": "17.4396", "ForwardPE": "16.8919", "PriceToSalesRatioTTM": "0.8256", "PriceToBookRatio": "1.8869", "EVToRevenue": "1.1677", "EVToEBITDA": "11.7254", "Beta": "1.7241", "52WeekHigh": "36.63", "52WeekLow": "13.31", "50DayMovingAverage": "29.8983", "200DayMovingAverage": "26.217", "SharesOutstanding": "304292992", "SharesFloat": "280016117", "SharesShort": "4926654", "SharesShortPriorMonth": "4673335", "ShortRatio": "2.76", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.028", "PercentInsiders": "0.716", "PercentInstitutions": "98.391", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2012-09-19"}