{"Symbol": "L", "AssetType": "Common Stock", "Name": "Loews Corporation", "Description": "Loews Corporation provides commercial property and casualty insurance in the United States and internationally. It operates through five segments: CNA Financial Corporation; Diamond Offshore Drilling, Inc.; Boardwalk Pipeline Partners, LP; Loews Hotels Holding Corporation; and Corporate segments. The company offers specialty insurance products, such as management and professional liability coverages and products; and surety and fidelity bonds. It also provides commercial property insurance products that include property, marine, and boiler and machinery coverages; casualty insurance products comprising workers' compensation, general and product liability, commercial auto, and umbrella coverages; loss-sensitive insurance programs; and warranty, risk management, information, and claims administration services. The company markets its insurance products and services through independent agents, brokers, and managing general underwriters. In addition, it offers contract drilling services through a fleet of 15 offshore drilling rigs consisting of 4 drillships and 11 semisubmersible rigs. Further, the company is involved in the transportation and storage of natural gas and natural gas liquids (NGLs) through natural gas pipelines covering approximately 13,610 miles of interconnected pipelines; 455 miles of NGL pipelines in Louisiana and Texas; and 14 underground storage fields with an aggregate gas capacity of approximately 205 billion cubic feet of natural gas. Additionally, the company operates a chain of 26 hotels; and develops, manufactures, and markets a range of extrusion blow-molded and injection molded plastic containers for customers in the pharmaceutical, dairy, household chemicals, food/nutraceuticals, industrial/specialty chemicals, and water and beverage/juice segments, as well as manufactures commodity and differentiated plastic resins from recycled plastic materials. Loews Corporation was incorporated in 1969 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceProperty & Casualty", "Address": "667 Madison Avenue, New York, NY, United States, 10065-8087", "FullTimeEmployees": "18605", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "10278273024", "EBITDA": "495000000", "PERatio": "14.8306", "PEGRatio": "2.69", "BookValue": "61.346", "DividendPerShare": "0.25", "DividendYield": "0.007", "EPS": "1.789", "RevenuePerShareTTM": "44.39", "ProfitMargin": "-0.0911", "OperatingMarginTTM": "-0.0346", "ReturnOnAssetsTTM": "-0.0035", "ReturnOnEquityTTM": "-0.0804", "RevenueTTM": "12935999488", "GrossProfitTTM": "6636000000", "DilutedEPSTTM": "-4.042", "QuarterlyEarningsGrowthYOY": "-0.729", "QuarterlyRevenueGrowthYOY": "-0.362", "AnalystTargetPrice": "52", "TrailingPE": "14.8306", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.8073", "PriceToBookRatio": "0.5846", "EVToRevenue": "1.4964", "EVToEBITDA": "0", "Beta": "0.761", "52WeekHigh": "54.23", "52WeekLow": "27.325", "50DayMovingAverage": "36.5839", "200DayMovingAverage": "36.2781", "SharesOutstanding": "280444000", "SharesFloat": "238548638", "SharesShort": "2803008", "SharesShortPriorMonth": "2978897", "ShortRatio": "3.74", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0118", "PercentInsiders": "15.238", "PercentInstitutions": "68.283", "ForwardAnnualDividendRate": "0.25", "ForwardAnnualDividendYield": "0.007", "PayoutRatio": "0.0814", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-18", "LastSplitFactor": "3:1", "LastSplitDate": "2006-05-09"}