{"Symbol": "MAS", "AssetType": "Common Stock", "Name": "Masco Corporation", "Description": "Masco Corporation designs, manufactures, and distributes home improvement and building products in North America, Europe, and internationally. The company operates through two segments, Plumbing Products and Decorative Architectural Products. The Plumbing Products segment offers faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, toilets, acrylic tubs, shower trays, spas, exercise pools, and fitness systems; brass, copper, and composite plumbing system components; thermoplastic extrusions, extruded plastic profiles, specialized fabrications, and PEX tubing products; and other non-decorative plumbing products. This segment provides its products under the DELTA, BRIZO, PEERLESS, HANSGROHE, AXOR, GINGER, NEWPORT BRASS, BRASSTECH, WALTEC, BRISTAN, HERITAGE, MIROLIN, HPPE, HOT SPRING, CALDERA, FREEFLOW SPAS, FANTASY SPAS, ENDLESS POOLS, BRASSCRAFT, PLUMB SHOP, COBRA, COBRA PRO, and MASTER PLUMBER brands. The Decorative Architectural Products segment offers paints, primers, specialty coatings, stains, and waterproofing products; cabinet and door hardware, functional hardware, wall plates, hook and rail products, and picture hanging accessories; decorative bath hardware, and shower accessories and doors; and decorative indoor and outdoor lighting fixtures, ceiling fans, landscape lighting, and LED lighting systems. This segment provides its products under the BEHR, KILZ, LIBERTY, BRAINERD, FRANKLIN BRASS, KICHLER, and LAN brands. It sells its products to the plumbing, heating, and hardware wholesalers; home centers and online retailers; hardware stores; electrical and landscape distributors; lighting showrooms; building supply outlets; and other mass merchandisers. Masco Corporation was founded in 1929 and is headquartered in Livonia, Michigan.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Building Products & Equipment", "Address": "17450 College Parkway, Livonia, MI, United States, 48152", "FullTimeEmployees": "22000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "15647460352", "EBITDA": "1243000064", "PERatio": "24.4351", "PEGRatio": "1.8193", "BookValue": "0.141", "DividendPerShare": "0.54", "DividendYield": "0.0091", "EPS": "4.811", "RevenuePerShareTTM": "24.364", "ProfitMargin": "0.199", "OperatingMarginTTM": "0.1615", "ReturnOnAssetsTTM": "0.1235", "ReturnOnEquityTTM": "13.037", "RevenueTTM": "6700000256", "GrossProfitTTM": "2371000000", "DilutedEPSTTM": "4.811", "QuarterlyEarningsGrowthYOY": "0.033", "QuarterlyRevenueGrowthYOY": "-0.041", "AnalystTargetPrice": "64.21", "TrailingPE": "24.4351", "ForwardPE": "21.692", "PriceToSalesRatioTTM": "2.4057", "PriceToBookRatio": "0", "EVToRevenue": "2.5543", "EVToEBITDA": "15.8019", "Beta": "1.5005", "52WeekHigh": "60.1", "52WeekLow": "28.68", "50DayMovingAverage": "56.7483", "200DayMovingAverage": "46.2899", "SharesOutstanding": "261532000", "SharesFloat": "260057008", "SharesShort": "4453940", "SharesShortPriorMonth": "4453276", "ShortRatio": "2.16", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0196", "PercentInsiders": "0.762", "PercentInstitutions": "100.948", "ForwardAnnualDividendRate": "0.54", "ForwardAnnualDividendYield": "0.0091", "PayoutRatio": "0.2197", "DividendDate": "2020-08-10", "ExDividendDate": "2020-07-09", "LastSplitFactor": "1138:1000", "LastSplitDate": "2015-07-01"}