{"Symbol": "MDT", "AssetType": "Common Stock", "Name": "Medtronic plc", "Description": "Medtronic plc develops, manufactures, distributes, and sells device-based medical therapies to hospitals, physicians, clinicians, and patients worldwide. It operates through four segments: Cardiac and Vascular Group, Minimally Invasive Therapies Group, Restorative Therapies Group, and Diabetes Group. The Cardiac and Vascular Group segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; AF ablation products; insertable cardiac monitor systems; mechanical circulatory support; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves; percutaneous coronary intervention stents, surgical valve replacement and repair products, endovascular stent grafts, percutaneous angioplasty balloons, and products to treat superficial venous diseases in the lower extremities. The Minimally Invasive Therapies Group segment offers surgical products, including surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, and gynecology products; electrosurgical hardware and instruments, and mesh fixation devices; and gastrointestinal, inhalation therapy, and renal care solutions. The Restorative Therapies Group segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; colorectal surgeons; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The Diabetes Group segment offers insulin pumps and consumables, and continuous glucose monitoring systems. The company was founded in 1949 and is headquartered in Dublin, Ireland.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "20 On Hatch, Dublin, Ireland, 2", "FullTimeEmployees": "90000", "FiscalYearEnd": "April", "LatestQuarter": "2020-07-31", "MarketCapitalization": "146123079680", "EBITDA": "6817999872", "PERatio": "32.9663", "PEGRatio": "3.268", "BookValue": "37.442", "DividendPerShare": "2.32", "DividendYield": "0.0216", "EPS": "3.26", "RevenuePerShareTTM": "20.826", "ProfitMargin": "0.158", "OperatingMarginTTM": "0.1484", "ReturnOnAssetsTTM": "0.028", "ReturnOnEquityTTM": "0.0876", "RevenueTTM": "27926999040", "GrossProfitTTM": "19650000000", "DilutedEPSTTM": "3.26", "QuarterlyEarningsGrowthYOY": "-0.438", "QuarterlyRevenueGrowthYOY": "-0.132", "AnalystTargetPrice": "115.74", "TrailingPE": "32.9663", "ForwardPE": "26.5957", "PriceToSalesRatioTTM": "5.1975", "PriceToBookRatio": "2.8703", "EVToRevenue": "5.7307", "EVToEBITDA": "22.8925", "Beta": "0.6775", "52WeekHigh": "122.1477", "52WeekLow": "72.13", "50DayMovingAverage": "99.6086", "200DayMovingAverage": "96.357", "SharesOutstanding": "1343289984", "SharesFloat": "1341827539", "SharesShort": "6891490", "SharesShortPriorMonth": "7766259", "ShortRatio": "1.58", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0051", "PercentInsiders": "0.072", "PercentInstitutions": "85.817", "ForwardAnnualDividendRate": "2.32", "ForwardAnnualDividendYield": "0.0216", "PayoutRatio": "0.6748", "DividendDate": "2020-10-16", "ExDividendDate": "2020-09-24", "LastSplitFactor": "2:1", "LastSplitDate": "1999-09-27"}