{"Symbol": "MRK", "AssetType": "Common Stock", "Name": "Merck & Co., Inc", "Description": "Merck & Co., Inc. provides healthcare solutions worldwide. The company offers therapeutic and preventive agents for cardiovascular, type 2 diabetes, chronic hepatitis C virus, HIV-1 infection, intra-abdominal, fungal infection, insomnia, and inflammatory diseases; neuromuscular blocking agents; cholesterol modifying medicines; and anti-bacterial and vaginal contraceptive products. It provides products to prevent chemotherapy-induced and post-operative nausea and vomiting; treat non-small-cell lung, ovarian and breast, esophageal, thyroid, cervical, and brain cancers; and prevent diseases caused by human papillomavirus, as well as vaccines for measles, mumps, rubella, varicella, shingles, rotavirus gastroenteritis, and pneumococcal diseases. In addition, the company offers drugs for hepatocellular and merkel cell carcinoma; antibiotic and anti-inflammatory drugs for infectious and respiratory diseases, fertility disorders, and pneumonia in cattle, bovine, and swine; vaccines for poultry; parasiticides for sea lice in salmon; and antibiotics and vaccines for fish. Further, it provides companion animal products; diabetes mellitus treatment and anthelmintic products for dogs and cats; products to treat fleas, ticks, mosquitoes, and sandflies; horse fertility management products for swine; and dog, cat, and horse vaccines. Additionally, the company offers services and solutions that focus on engagement, clinical, and health analytics. Merck & Co., Inc. has collaborations with AstraZeneca PLC; Bayer AG; Eisai Co., Ltd.; Almac Discovery Ltd.; Skyhawk Therapeutics, Inc.; Ridgeback Biotherapeutics; Shanghai Junshi Biosciences Co., Ltd.; and FUJIFILM Corporation. It serves drug wholesalers and retailers, hospitals, and government agencies; managed health care providers; and physicians and physician distributors, veterinarians, and animal producers. The company was founded in 1891 and is headquartered in Kenilworth, New Jersey.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "2000 Galloping Hill Road, Kenilworth, NJ, United States, 07033", "FullTimeEmployees": "71000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "217919340544", "EBITDA": "19046000640", "PERatio": "20.8808", "PEGRatio": "1.565", "BookValue": "10.929", "DividendPerShare": "2.44", "DividendYield": "0.0289", "EPS": "4.104", "RevenuePerShareTTM": "18.573", "ProfitMargin": "0.222", "OperatingMarginTTM": "0.331", "ReturnOnAssetsTTM": "0.1119", "ReturnOnEquityTTM": "0.3785", "RevenueTTM": "47194001408", "GrossProfitTTM": "33684000000", "DilutedEPSTTM": "4.104", "QuarterlyEarningsGrowthYOY": "0.146", "QuarterlyRevenueGrowthYOY": "-0.076", "AnalystTargetPrice": "95.29", "TrailingPE": "20.8808", "ForwardPE": "14.9701", "PriceToSalesRatioTTM": "4.6425", "PriceToBookRatio": "7.8525", "EVToRevenue": "5.0182", "EVToEBITDA": "13.9173", "Beta": "0.4907", "52WeekHigh": "92.64", "52WeekLow": "65.25", "50DayMovingAverage": "81.8892", "200DayMovingAverage": "79.1837", "SharesOutstanding": "2529240064", "SharesFloat": "2526458905", "SharesShort": "11796980", "SharesShortPriorMonth": "14642574", "ShortRatio": "1.51", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0047", "PercentInsiders": "0.076", "PercentInstitutions": "78.555", "ForwardAnnualDividendRate": "2.44", "ForwardAnnualDividendYield": "0.0289", "PayoutRatio": "0.5791", "DividendDate": "2020-10-07", "ExDividendDate": "2020-09-14", "LastSplitFactor": "2:1", "LastSplitDate": "1999-02-17"}