{"Symbol": "MCHP", "AssetType": "Common Stock", "Name": "Microchip Technology Incorporated", "Description": "Microchip Technology Incorporated develops, manufactures, and sells semiconductor products for various embedded control applications in the Americas, Europe, and Asia. The company offers general purpose and specialized 8-bit, 16-bit, and 32-bit microcontrollers; 32-bit microprocessors; and microcontrollers for automotive, industrial, computing, communication, lighting, power supplies, motor control, human machine interface, security, and wired and wireless connectivity applications. It also provides development tools that enable system designers to program microcontroller products for specific applications; field-programmable gate array (FPGA) products; and analog, power, interface, mixed signal, and timing products comprising power management, linear, mixed-signal, high-voltage, thermal management, discrete diodes and metal oxide semiconductor field effect transistors (MOSFETS), radio frequency (RF), drivers, safety, security, timing, USB, Ethernet, wireless, and other interface products. In addition, the company offers memory products consisting of serial electrically erasable programmable read-only memory, serial flash memories, parallel flash memories, serial static random access memories, and serial electrically erasable random access memories for the production of very small footprint devices; and licenses its SuperFlash embedded flash and Smartbits one time programmable NVM technologies to foundries, integrated device manufacturers, and design partners for use in the manufacture of microcontroller products, gate array, RF, analog, and neuromorphic compute products that require embedded non-volatile memory, as well as provides engineering services. Further, it offers wafer foundry and assembly and test subcontracting manufacturing services; and aerospace and timing systems products, application specific integrated circuits, and complex programmable logic devices. Microchip Technology Incorporated was founded in 1989 and is headquartered in Chandler, Arizona.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductors", "Address": "2355 West Chandler Boulevard, Chandler, AZ, United States, 85224-6199", "FullTimeEmployees": "18000", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "28953720832", "EBITDA": "1932199936", "PERatio": "42.7928", "PEGRatio": "1.5211", "BookValue": "21.792", "DividendPerShare": "1.47", "DividendYield": "0.0131", "EPS": "2.505", "RevenuePerShareTTM": "21.797", "ProfitMargin": "0.1223", "OperatingMarginTTM": "0.1389", "ReturnOnAssetsTTM": "0.0259", "ReturnOnEquityTTM": "0.1193", "RevenueTTM": "5261300224", "GrossProfitTTM": "3242100000", "DilutedEPSTTM": "2.505", "QuarterlyEarningsGrowthYOY": "1.4", "QuarterlyRevenueGrowthYOY": "-0.01", "AnalystTargetPrice": "119.19", "TrailingPE": "42.7928", "ForwardPE": "18.8679", "PriceToSalesRatioTTM": "5.2503", "PriceToBookRatio": "4.929", "EVToRevenue": "6.8542", "EVToEBITDA": "19.3413", "Beta": "1.5676", "52WeekHigh": "113.28", "52WeekLow": "53.15", "50DayMovingAverage": "104.6103", "200DayMovingAverage": "92.6927", "SharesOutstanding": "252452000", "SharesFloat": "246963219", "SharesShort": "19675740", "SharesShortPriorMonth": "19752431", "ShortRatio": "8.32", "ShortPercentOutstanding": "0.08", "ShortPercentFloat": "0.0887", "PercentInsiders": "2.198", "PercentInstitutions": "109.961", "ForwardAnnualDividendRate": "1.47", "ForwardAnnualDividendYield": "0.0131", "PayoutRatio": "0.5845", "DividendDate": "2020-09-04", "ExDividendDate": "2020-08-20", "LastSplitFactor": "3:2", "LastSplitDate": "2002-05-09"}