{"Symbol": "MHK", "AssetType": "Common Stock", "Name": "Mohawk Industries, Inc", "Description": "Mohawk Industries, Inc. designs, manufactures, sources, distributes, and markets flooring products for remodeling and new constructions of residential and commercial spaces in the United States, Europe, Russia, and internationally. It operates through three segments: Global Ceramic, Flooring North America (Flooring NA), and Flooring Rest of the World (Flooring ROW). The Global Ceramic segment provides a range of ceramic tile, porcelain tile, and natural stone products; and sources, markets, and distributes other tile related products. This segment markets and distributes its products under the American Olean, Daltile, Eliane, EmilGroup, KAI, Kerama Marazzi, Marazzi, and Ragno brands. The Flooring NA segment offers floor covering product lines in a range of colors, textures, and patterns, including carpets, carpet tiles, rugs and mats, carpet pads, hardwood, laminate, medium-density fiberboards, luxury vinyl tiles (LVT), and sheet vinyl products. This segment markets and distributes its flooring products under the Aladdin Commercial, Durkan, IVC, Karastan, Mohawk, Mohawk Group, Mohawk Home, Pergo, Portico, and Quick-Step brands. The Flooring ROW segment provides hardwood flooring and vinyl flooring, as well as laminates, roofing elements, sheet vinyl, LVT, insulation boards, medium-density fiberboards, chipboards, and other woods products under the Balterio, Feltex, Godfrey Hirst, Hycraft, IVC, Leoline, Moduleo, Pergo, Quick-Step, and Unilin and Xtratherm brands; and licenses its intellectual property to flooring manufacturers. The company sells its products through independent distributors, home centers, company-operated service centers and stores, floor covering retailers, ceramic specialists, commercial contractors, commercial end users, mass merchandisers, department stores, e-commerce retailers, shop at home, buying groups, retailers, and wholesalers, as well as private labeling programs. Mohawk Industries, Inc. was founded in 1988 and is headquartered in Calhoun, Georgia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Furnishings, Fixtures & Appliances", "Address": "160 South Industrial Boulevard, Calhoun, GA, United States, 30701", "FullTimeEmployees": "41800", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6659936256", "EBITDA": "1217163776", "PERatio": "14.4933", "PEGRatio": "2.5", "BookValue": "111.227", "DividendPerShare": "None", "DividendYield": "0", "EPS": "49.8953", "RevenuePerShareTTM": "129.449", "ProfitMargin": "0.052", "OperatingMarginTTM": "0.0671", "ReturnOnAssetsTTM": "0.0286", "ReturnOnEquityTTM": "0.0613", "RevenueTTM": "9279259648", "GrossProfitTTM": "2768245000", "DilutedEPSTTM": "49.8953", "QuarterlyEarningsGrowthYOY": "-0.078", "QuarterlyRevenueGrowthYOY": "-0.207", "AnalystTargetPrice": "93.46", "TrailingPE": "14.4933", "ForwardPE": "21.1864", "PriceToSalesRatioTTM": "0.7514", "PriceToBookRatio": "0.8717", "EVToRevenue": "0.9938", "EVToEBITDA": "8.9191", "Beta": "1.4231", "52WeekHigh": "153.05", "52WeekLow": "56.62", "50DayMovingAverage": "86.675", "200DayMovingAverage": "91.0051", "SharesOutstanding": "71195000", "SharesFloat": "58398448", "SharesShort": "1995705", "SharesShortPriorMonth": "2602302", "ShortRatio": "1.61", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0419", "PercentInsiders": "20.027", "PercentInstitutions": "87.819", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:2", "LastSplitDate": "1997-12-05"}