{"Symbol": "MCO", "AssetType": "Common Stock", "Name": "Moody's Corporation", "Description": "Moody's Corporation provides credit ratings and assessment services; and credit, capital markets, and economic research, data, and analytical tools worldwide. It operates through two segments, Moody's Investors Service and Moody's Analytics. The Moody's Investors Service segment publishes credit ratings and provides assessment services on various debt obligations and entities that issue such obligations, such as various corporate and governmental obligations, structured finance securities, and commercial paper programs. This segment provides ratings in approximately 130 countries. Its ratings are disseminated through press releases to the public through print and electronic media, including the Internet and real-time information systems used by securities traders and investors. As of December 31, 2019, this segment had ratings relationships with approximately 4,900 non-financial corporate issuers; 4,100 financial institutions issuers; 17,200 public finance issuers; and 1,000 infrastructure and project finance issuers, as well as 9,500 structured finance transactions. The Moody's Analytics segment develops a range of products and services that support financial analysis and risk management activities of institutional participants in financial markets; and offers subscription based research, data, and analytical products comprising credit ratings, credit research, quantitative credit scores and other analytical tools, economic research and forecasts, business intelligence and company information products, and commercial real estate data and analytical tools. It also offers software solutions, as well as related risk management services; and offshore analytical and research services with learning solutions and certification programs. The company was formerly known as Dun and Bradstreet Company and changed its name to Moody's Corporation in September 2000. Moody's Corporation was founded in 1900 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Financial Data & Stock Exchanges", "Address": "7 World Trade Center, New York, NY, United States, 10007", "FullTimeEmployees": "11279", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "57152770048", "EBITDA": "2567000064", "PERatio": "32", "PEGRatio": "2.7971", "BookValue": "5.546", "DividendPerShare": "2.24", "DividendYield": "0.0074", "EPS": "9.124", "RevenuePerShareTTM": "27.627", "ProfitMargin": "0.334", "OperatingMarginTTM": "0.4544", "ReturnOnAssetsTTM": "0.1413", "ReturnOnEquityTTM": "1.9209", "RevenueTTM": "5198000128", "GrossProfitTTM": "3442000000", "DilutedEPSTTM": "9.124", "QuarterlyEarningsGrowthYOY": "0.66", "QuarterlyRevenueGrowthYOY": "0.182", "AnalystTargetPrice": "310.58", "TrailingPE": "32", "ForwardPE": "32.3625", "PriceToSalesRatioTTM": "10.6904", "PriceToBookRatio": "52.6774", "EVToRevenue": "11.4493", "EVToEBITDA": "22.6891", "Beta": "1.1382", "52WeekHigh": "297.16", "52WeekLow": "164.19", "50DayMovingAverage": "286.0769", "200DayMovingAverage": "258.7538", "SharesOutstanding": "187700000", "SharesFloat": "186762973", "SharesShort": "1403478", "SharesShortPriorMonth": "1634396", "ShortRatio": "2.26", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0086", "PercentInsiders": "0.408", "PercentInstitutions": "94.565", "ForwardAnnualDividendRate": "2.24", "ForwardAnnualDividendYield": "0.0074", "PayoutRatio": "0.2322", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-19", "LastSplitFactor": "2:1", "LastSplitDate": "2005-05-19"}