{"Symbol": "NWL", "AssetType": "Common Stock", "Name": "Newell Brands Inc", "Description": "Newell Brands Inc. designs, manufactures, sources, and distributes consumer and commercial products worldwide. The company operates through four segments: Appliances and Cookware, Food and Commercial, Home and Outdoor Living, and Learning and Development. The Appliances and Cookware segment offers household products, including kitchen appliances, gourmet cookware, bakeware, and cutlery under the Calphalon, Crock-Pot, Mr. Coffee, Oster, and Sunbeam brands. The Food and Commercial segment offers food storage and home storage products, and fresh preserving products, vacuum sealing products, commercial cleaning and maintenance solutions, hygiene systems, and material handling solutions under the Ball, FoodSaver, Rubbermaid, Sistema, Rubbermaid Commercial Products, Mapa, Quickie, and Spontex brands. The Home and Outdoor Living segment offers products for outdoor and outdoor-related activities, home fragrance, and connected home and security products under the Chesapeake Bay Candle, Coleman, Contigo, ExOfficio, First Alert, Marmot, WoodWick, and Yankee Candle brands. The Learning and Development segment offers writing instruments, including markers and highlighters, pens, and pencils; art products; activity-based adhesive and cutting products; labeling solutions; and baby gear and infant care products under the Aprica, Baby Jogger, Dymo, Elmer's, EXPO, Graco, Mr. Sketch, NUK, Paper Mate, Parker, Prismacolor, Sharpie, Tigex Waterman, and X-Acto brands. It markets its products to clubs, department stores, drug/grocery stores, mass merchants, specialty retailers, distributors and e-commerce companies, home centers, sporting goods retailers, warehouse clubs, office superstores and supply stores, contract stationers, and travel retail, as well as sells directly to consumers via on-line. Newell Brands Inc. was formerly known as Newell Rubbermaid Inc. and changed its name to Newell Brands Inc. in April 2016. The company was founded in 1903 and is based in Atlanta, Georgia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Household & Personal Products", "Address": "6655 Peachtree Dunwoody Road, Atlanta, GA, United States, 30328", "FullTimeEmployees": "30000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6882145792", "EBITDA": "1174499968", "PERatio": "32.25", "PEGRatio": "1.42", "BookValue": "8.232", "DividendPerShare": "0.92", "DividendYield": "0.0576", "EPS": "0.252", "RevenuePerShareTTM": "21.692", "ProfitMargin": "-0.1124", "OperatingMarginTTM": "0.0791", "ReturnOnAssetsTTM": "0.0285", "ReturnOnEquityTTM": "-0.2497", "RevenueTTM": "9189900288", "GrossProfitTTM": "3235300000", "DilutedEPSTTM": "-2.44", "QuarterlyEarningsGrowthYOY": "-0.151", "QuarterlyRevenueGrowthYOY": "-0.149", "AnalystTargetPrice": "17.3", "TrailingPE": "32.25", "ForwardPE": "14.3266", "PriceToSalesRatioTTM": "0.7471", "PriceToBookRatio": "1.9672", "EVToRevenue": "1.4215", "EVToEBITDA": "9.3445", "Beta": "1.0478", "52WeekHigh": "20.99", "52WeekLow": "10.44", "50DayMovingAverage": "16.6781", "200DayMovingAverage": "14.8198", "SharesOutstanding": "424300000", "SharesFloat": "420744366", "SharesShort": "12010944", "SharesShortPriorMonth": "13231472", "ShortRatio": "3.84", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0451", "PercentInsiders": "0.776", "PercentInstitutions": "90.556", "ForwardAnnualDividendRate": "0.92", "ForwardAnnualDividendYield": "0.0576", "PayoutRatio": "2.0909", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-28", "LastSplitFactor": "2:1", "LastSplitDate": "1994-09-02"}