{"Symbol": "NLSN", "AssetType": "Common Stock", "Name": "Nielsen Holdings plc", "Description": "Nielsen Holdings plc, together with its subsidiaries, operates as a measurement and data analytics company. It operates in two segments, Connect and Media. The Connect segment provides retail transactional measurement data, consumer behavior information, and analytics primarily to businesses in the consumer packaged goods industry. This segment offers data on retail measurement services, such as market share, competitive sales volumes, and insights into activities, such as distribution, pricing, merchandising, and promotion; consumer panel measurement, which offers insight into shopper behavior comprising trial and repeat purchase for new products, brand or retailer loyalty, and customer segmentation; and analytical services that help clients in taking business decisions in product development and marketing cycles. The Media segment provides viewership and listening data, and analytics principally to the media and advertising industries covering television, radio, print, online, digital, mobile viewing, and listening platforms. This segment offers television audience measurement services; audio audience measurement services; digital audience measurement services, such as digital media and market research, audience analytics, and social media measurement; mobile measurement services comprising measurement and consumer research for telecom and media companies; total audience measurement services; brand effect; social content ratings; advertising effectiveness measurement; and outcome measurement solutions. Nielsen Holdings plc offers media and marketing information, analytics, and manufacturer and retailer expertise about what and where consumers read, watch, and listen. The company was formerly known as Nielsen N.V. and changed its name to Nielsen Holdings plc in August 2015. Nielsen Holdings plc was founded in 1923 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Consulting Services", "Address": "675 Avenue of the Americas, New York, NY, United States, 10010", "FullTimeEmployees": "46000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "5547524608", "EBITDA": "997000000", "PERatio": "None", "PEGRatio": "1.77", "BookValue": "5.665", "DividendPerShare": "0.24", "DividendYield": "0.0161", "EPS": "-1.942", "RevenuePerShareTTM": "17.859", "ProfitMargin": "-0.0989", "OperatingMarginTTM": "0.0995", "ReturnOnAssetsTTM": "0.0266", "ReturnOnEquityTTM": "-0.2368", "RevenueTTM": "6361999872", "GrossProfitTTM": "3676000000", "DilutedEPSTTM": "-1.769", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.081", "AnalystTargetPrice": "17.7", "TrailingPE": "0", "ForwardPE": "10.2987", "PriceToSalesRatioTTM": "0.8556", "PriceToBookRatio": "2.6973", "EVToRevenue": "2.1701", "EVToEBITDA": "53.9305", "Beta": "1.1896", "52WeekHigh": "23.305", "52WeekLow": "11.62", "50DayMovingAverage": "15.2556", "200DayMovingAverage": "14.9531", "SharesOutstanding": "356753984", "SharesFloat": "320561274", "SharesShort": "40508427", "SharesShortPriorMonth": "34103598", "ShortRatio": "13.49", "ShortPercentOutstanding": "0.11", "ShortPercentFloat": "0.1311", "PercentInsiders": "0.657", "PercentInstitutions": "107.575", "ForwardAnnualDividendRate": "0.24", "ForwardAnnualDividendYield": "0.0161", "PayoutRatio": "0", "DividendDate": "2020-09-03", "ExDividendDate": "2020-08-19", "LastSplitFactor": "None", "LastSplitDate": "None"}