{"Symbol": "NOC", "AssetType": "Common Stock", "Name": "Northrop Grumman Corporation", "Description": "Northrop Grumman Corporation operates as a security company. It provides various systems, products, and solutions in autonomous systems, cyber, space, strike, and logistics and modernization, as well as in command, control, communications and computers, intelligence, surveillance, and reconnaissance (C4ISR) to customers in the United States and internationally. The company operates through Aeronautics Systems, Defense Systems, Mission Systems, and Space Systems segments. It designs, develops, integrates, and produces manned aircrafts, autonomous systems, spacecraft systems, high-energy laser systems, microelectronics, and other systems and sub-systems for use in the areas of intelligence, surveillance and reconnaissance, strike operations, communications, earth observations, and space science. The company also designs, develops, integrates, and produces flights, armaments, and space systems to enable national security, civil government, and commercial customers in achieving their critical missions. Its space systems include launch vehicles and related propulsion systems; missile products and defense electronics; precision weapons, armament systems and ammunition; satellites and associated space components and services; and aerospace structures. In addition, it offers C4ISR systems; radar, electro-optical/infrared, and acoustic sensors; electronic warfare systems; cyber solutions; space and intelligence processing systems; air and missile defense integration systems; navigation systems; and shipboard missiles and encapsulated payload launch systems. Further, the company provides life-cycle solutions and services in support of networks and systems, including sustainment, modernization, training and simulation, software, engineering services, cyber, rapidly-deployable global logistics, and information technology. The company was founded in 1939 and is based in Falls Church, Virginia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "2980 Fairview Park Drive, Falls Church, VA, United States, 22042", "FullTimeEmployees": "90000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "57939783680", "EBITDA": "4236999936", "PERatio": "24.4562", "PEGRatio": "1.3554", "BookValue": "58.257", "DividendPerShare": "5.8", "DividendYield": "0.017", "EPS": "14.211", "RevenuePerShareTTM": "206.548", "ProfitMargin": "0.0691", "OperatingMarginTTM": "0.0928", "ReturnOnAssetsTTM": "0.0485", "ReturnOnEquityTTM": "0.2533", "RevenueTTM": "34700001280", "GrossProfitTTM": "7259000000", "DilutedEPSTTM": "14.211", "QuarterlyEarningsGrowthYOY": "0.188", "QuarterlyRevenueGrowthYOY": "0.051", "AnalystTargetPrice": "393.22", "TrailingPE": "24.4562", "ForwardPE": "15.7233", "PriceToSalesRatioTTM": "1.6967", "PriceToBookRatio": "5.9907", "EVToRevenue": "2.0576", "EVToEBITDA": "16.6391", "Beta": "0.7852", "52WeekHigh": "385.005", "52WeekLow": "263.31", "50DayMovingAverage": "327.0094", "200DayMovingAverage": "324.8715", "SharesOutstanding": "166714000", "SharesFloat": "165982188", "SharesShort": "1486916", "SharesShortPriorMonth": "1218866", "ShortRatio": "1.58", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0112", "PercentInsiders": "0.491", "PercentInstitutions": "84.057", "ForwardAnnualDividendRate": "5.8", "ForwardAnnualDividendYield": "0.017", "PayoutRatio": "0.3791", "DividendDate": "2020-09-16", "ExDividendDate": "2020-08-28", "LastSplitFactor": "10000:9035", "LastSplitDate": "2011-03-31"}