{"Symbol": "OKE", "AssetType": "Common Stock", "Name": "ONEOK, Inc", "Description": "ONEOK, Inc., together with its subsidiaries, engages in gathering, processing, storage, and transportation of natural gas in the United States. It operates through Natural Gas Gathering and Processing, Natural Gas Liquids, and Natural Gas Pipelines segments. The company owns natural gas gathering pipelines and processing plants in the Mid-Continent and Rocky Mountain regions. It also gathers, treats, fractionates, and transports natural gas liquids (NGL), as well as stores, markets, and distributes NGL products. The company owns NGL gathering and distribution pipelines in Oklahoma, Kansas, Texas, New Mexico, Montana, North Dakota, Wyoming, and Colorado; terminal and storage facilities in Missouri, Nebraska, Iowa, and Illinois; and NGL distribution and refined petroleum products pipelines in Kansas, Missouri, Nebraska, Iowa, Illinois, and Indiana, as well as owns and operates truck- and rail-loading, and -unloading facilities that interconnect with its NGL fractionation and pipeline assets. In addition, it operates regulated interstate and intrastate natural gas transmission pipelines and natural gas storage facilities. Further, the company owns and operates a parking garage in downtown Tulsa, Oklahoma; and leases excess office space to others. It serves integrated and independent exploration and production companies; NGL and natural gas gathering and processing companies; crude oil and natural gas production companies; propane distributors; ethanol producers; and petrochemical, refining, and NGL marketing companies, as well as natural gas distribution companies, electric-generation facilities, industrial companies, municipalities, producers, processors, and marketing companies. The company was founded in 1906 and is headquartered in Tulsa, Oklahoma.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Midstream", "Address": "100 West Fifth Street, Tulsa, OK, United States, 74103", "FullTimeEmployees": "2882", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "12131155968", "EBITDA": "2349497088", "PERatio": "18.1477", "PEGRatio": "1.9934", "BookValue": "14.049", "DividendPerShare": "3.74", "DividendYield": "0.1378", "EPS": "1.488", "RevenuePerShareTTM": "21", "ProfitMargin": "0.0713", "OperatingMarginTTM": "0.2097", "ReturnOnAssetsTTM": "0.0535", "ReturnOnEquityTTM": "0.0988", "RevenueTTM": "8724235264", "GrossProfitTTM": "3376327000", "DilutedEPSTTM": "1.488", "QuarterlyEarningsGrowthYOY": "-0.574", "QuarterlyRevenueGrowthYOY": "-0.324", "AnalystTargetPrice": "33.57", "TrailingPE": "18.1477", "ForwardPE": "10.7643", "PriceToSalesRatioTTM": "1.2905", "PriceToBookRatio": "1.9247", "EVToRevenue": "2.9179", "EVToEBITDA": "13.0964", "Beta": "2.0137", "52WeekHigh": "78.48", "52WeekLow": "12.16", "50DayMovingAverage": "28.5242", "200DayMovingAverage": "34.2638", "SharesOutstanding": "444201984", "SharesFloat": "441132515", "SharesShort": "9115161", "SharesShortPriorMonth": "12938255", "ShortRatio": "1.73", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.026", "PercentInsiders": "0.674", "PercentInstitutions": "75.919", "ForwardAnnualDividendRate": "3.74", "ForwardAnnualDividendYield": "0.1378", "PayoutRatio": "2.4664", "DividendDate": "2020-08-14", "ExDividendDate": "2020-07-31", "LastSplitFactor": "11422:1000", "LastSplitDate": "2014-02-03"}