{"Symbol": "PAYX", "AssetType": "Common Stock", "Name": "Paychex, Inc", "Description": "Paychex, Inc. provides integrated human capital management solutions for human resources (HR), payroll, benefits, and insurance services for small- to medium-sized businesses in the United States and Europe. The company offers payroll processing services; payroll tax administration services; employee payment services; and regulatory compliance services, such as new-hire reporting and garnishment processing. It also provides HR solutions, including payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and the on-site availability of a professionally trained HR representative; and retirement services administration, including plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. In addition, the company offers cloud-based HR administration software products for employee benefits management and administration, time and attendance, recruiting, and onboarding solutions; plan administration outsourcing and state unemployment insurance services; various business services to small to medium-sized businesses comprising payroll funding and outsourcing services, which include payroll processing, invoicing, and tax preparation; and payment processing services, financial fitness programs, and a small-business loan resource center. Further, it provides insurance services for property and casualty coverage, such as workers' compensation, business-owner policies, cyber security protection, and commercial auto, as well as health and benefits coverage, including health, dental, vision, and life. The company markets and sells its services primarily through its direct sales force. Paychex, Inc. was founded in 1979 and is headquartered in Rochester, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Staffing & Employment Services", "Address": "911 Panorama Trail South, Rochester, NY, United States, 14625-2396", "FullTimeEmployees": "15600", "FiscalYearEnd": "May", "LatestQuarter": "2020-05-31", "MarketCapitalization": "27793911808", "EBITDA": "1670200064", "PERatio": "25.1776", "PEGRatio": "4.4322", "BookValue": "7.752", "DividendPerShare": "2.48", "DividendYield": "0.0325", "EPS": "3.04", "RevenuePerShareTTM": "11.271", "ProfitMargin": "0.2718", "OperatingMarginTTM": "0.3615", "ReturnOnAssetsTTM": "0.106", "ReturnOnEquityTTM": "0.4066", "RevenueTTM": "4040499968", "GrossProfitTTM": "2759700000", "DilutedEPSTTM": "3.04", "QuarterlyEarningsGrowthYOY": "-0.047", "QuarterlyRevenueGrowthYOY": "-0.067", "AnalystTargetPrice": "74.18", "TrailingPE": "25.1776", "ForwardPE": "26.8817", "PriceToSalesRatioTTM": "6.8385", "PriceToBookRatio": "9.8728", "EVToRevenue": "6.7879", "EVToEBITDA": "16.2711", "Beta": "0.8934", "52WeekHigh": "90.535", "52WeekLow": "47.8727", "50DayMovingAverage": "73.9242", "200DayMovingAverage": "71.5217", "SharesOutstanding": "358800000", "SharesFloat": "320130187", "SharesShort": "10332067", "SharesShortPriorMonth": "10721621", "ShortRatio": "6.23", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0335", "PercentInsiders": "10.76", "PercentInstitutions": "70.51", "ForwardAnnualDividendRate": "2.48", "ForwardAnnualDividendYield": "0.0325", "PayoutRatio": "0.8158", "DividendDate": "2020-08-27", "ExDividendDate": "2020-07-31", "LastSplitFactor": "3:2", "LastSplitDate": "2000-05-23"}