{"Symbol": "PNR", "AssetType": "Common Stock", "Name": "Pentair plc", "Description": "Pentair plc provides various smart water solutions worldwide. It operates through three segments: Aquatic Systems, Filtration Solutions, and Flow Technologies. The Aquatic Systems segment manufactures and sells residential and commercial pool equipment and accessories, including pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment, and pool accessories for residential and commercial pool maintenance, pool repair, renovation, service and construction, and aquaculture solution applications. This segment offers its products under the Kreepy Krauly, Pentair, and Sta-Rite brand names. The Filtration Solutions segment designs, manufactures, and markets components and systems, such as point-of-entry and point-of-use filtration, valves, and automated controls for residential and commercial applications, as well as advanced filtration, oil and gas separation, membrane technology, and energy recovery for food and beverage, and industrial applications. This segment offers its products under the Codeline, Everpure, Haffmans, Pelican, RainSoft, Sdmo, and X-Flow brand names. The Flow Technologies segment manufactures and sells light duty diaphragm pumps, high-flow turbine pumps, and solid handling pumps. Its pumps are used in residential and municipal wells, water treatment, wastewater solids handling, pressure boosting, fluid delivery, circulation and transfer, fire suppression, flood control, agricultural irrigation, and crop spray applications. This segment offers its products under the Aurora, Berkeley, Fairbanks-Nijhuis, Hydromatic, Hypro, Jung Pumpen, Pentair, Myers, Sta-Rite, and Shurflo brand names. It serves businesses engaged in wholesale and retail distribution in the residential and commercial, food and beverage, and industrial verticals, as well as end-users, consumers, and original equipment manufacturers. Pentair plc was founded in 1966 and is headquartered in London, the United Kingdom.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "Regal House, London, United Kingdom, TW13 QS", "FullTimeEmployees": "9500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "7666654208", "EBITDA": "511900000", "PERatio": "22.6866", "PEGRatio": "2.4365", "BookValue": "11.752", "DividendPerShare": "0.76", "DividendYield": "0.0167", "EPS": "1.978", "RevenuePerShareTTM": "17.266", "ProfitMargin": "0.1158", "OperatingMarginTTM": "0.1506", "ReturnOnAssetsTTM": "0.0657", "ReturnOnEquityTTM": "0.1814", "RevenueTTM": "2892100096", "GrossProfitTTM": "1051500000", "DilutedEPSTTM": "1.978", "QuarterlyEarningsGrowthYOY": "-0.362", "QuarterlyRevenueGrowthYOY": "-0.108", "AnalystTargetPrice": "47", "TrailingPE": "22.6866", "ForwardPE": "20.9205", "PriceToSalesRatioTTM": "2.656", "PriceToBookRatio": "3.8803", "EVToRevenue": "2.9348", "EVToEBITDA": "16.7149", "Beta": "1.3571", "52WeekHigh": "47.43", "52WeekLow": "22.01", "50DayMovingAverage": "43.9872", "200DayMovingAverage": "37.6463", "SharesOutstanding": "165908992", "SharesFloat": "164727500", "SharesShort": "2023382", "SharesShortPriorMonth": "2186570", "ShortRatio": "1.64", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0138", "PercentInsiders": "0.254", "PercentInstitutions": "90.885", "ForwardAnnualDividendRate": "0.76", "ForwardAnnualDividendYield": "0.0167", "PayoutRatio": "0.3682", "DividendDate": "2020-08-07", "ExDividendDate": "2020-07-23", "LastSplitFactor": "1489:1000", "LastSplitDate": "2018-05-01"}