{"Symbol": "PFE", "AssetType": "Common Stock", "Name": "Pfizer Inc", "Description": "Pfizer Inc. develops, manufactures, and sells healthcare products worldwide. It offers medicines and vaccines in various therapeutic areas, including internal medicine, such as cardiovascular metabolic and pain under the Eliquis, Chantix/Champix, and Premarin family brands; oncology, such as biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Sutent, Xtandi, Xalkori, Inlyta, Braftovi + Mektovi brands; and sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Vfend, and Zithromax brands. The company also provides medicines and vaccines in various therapeutic areas, such as pneumococcal disease, meningococcal disease, and tick-borne encephalitis under the Prevnar 13/Prevenar 13 (pediatric/adult), FSME-IMMUN, Nimenrix, and Trumenba brands; biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, and Eucrisa brands; and amyloidosis, hemophilia, and endocrine diseases under the Vyndaqel/Vyndamax, BeneFIX, Genotropin, and Refacto AF/Xyntha brands. In addition, the company is involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, and individual provider offices, as well as disease control and prevention centers. The company has collaboration and/or co-promotion agreements with Bristol-Myers Squibb Company and Astellas Pharma US, Inc.; licensing agreement with Akcea Therapeutics, Inc; strategic alliance with Verily Life Sciences LLC; collaboration agreements with Merck KGaA and Valneva SE; clinical trial collaboration and supply agreement with IDEAYA Biosciences, Inc.; material transfer and collaboration agreement with BioNTech SE to co-develop COVID-19 vaccine; clinical supply collaboration with Jiangsu Alphamab Biopharmaceuticals Co., Ltd; and research collaboration and license agreement with BioInvent International AB. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "235 East 42nd Street, New York, NY, United States, 10017", "FullTimeEmployees": "88300", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "206715928576", "EBITDA": "20054999040", "PERatio": "14.9368", "PEGRatio": "2.7283", "BookValue": "11.584", "DividendPerShare": "1.52", "DividendYield": "0.0412", "EPS": "2.526", "RevenuePerShareTTM": "8.872", "ProfitMargin": "0.2881", "OperatingMarginTTM": "0.2982", "ReturnOnAssetsTTM": "0.0549", "ReturnOnEquityTTM": "0.2281", "RevenueTTM": "49196998656", "GrossProfitTTM": "41739000000", "DilutedEPSTTM": "2.526", "QuarterlyEarningsGrowthYOY": "-0.315", "QuarterlyRevenueGrowthYOY": "-0.11", "AnalystTargetPrice": "41.79", "TrailingPE": "14.9368", "ForwardPE": "13.2626", "PriceToSalesRatioTTM": "4.3227", "PriceToBookRatio": "3.264", "EVToRevenue": "5.3301", "EVToEBITDA": "10.9038", "Beta": "0.7335", "52WeekHigh": "40.97", "52WeekLow": "27.88", "50DayMovingAverage": "37.9061", "200DayMovingAverage": "35.6364", "SharesOutstanding": "5556879872", "SharesFloat": "5550989514", "SharesShort": "50222963", "SharesShortPriorMonth": "47474673", "ShortRatio": "1.7", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.009", "PercentInsiders": "0.041", "PercentInstitutions": "72.557", "ForwardAnnualDividendRate": "1.52", "ForwardAnnualDividendYield": "0.0412", "PayoutRatio": "0.585", "DividendDate": "2020-09-01", "ExDividendDate": "2020-07-30", "LastSplitFactor": "3:1", "LastSplitDate": "1999-07-01"}