{"Symbol": "PPG", "AssetType": "Common Stock", "Name": "PPG Industries, Inc", "Description": "PPG Industries, Inc. manufactures and distributes paints, coatings, and specialty materials worldwide. The company's Performance Coatings segment offers coatings, solvents, adhesives, sundries, and software for automotive and commercial transport/fleet repair and refurbishing, light industrial coatings, and specialty coatings for signs; and coatings, sealants, transparencies, transparent armor, adhesives, and packaging and chemical management services for commercial, military, regional jet, and general aviation aircraft. It also provides coatings and finishes for the protection of metals and structures, such as metal fabricators, heavy duty maintenance contractors, and manufacturers of ships, bridges, and rail cars; and paints, wood stains, and purchased sundries for painting and maintenance contractors, and consumers for decoration and maintenance of residential and commercial building structures. The company's Industrial Coatings segment provides coatings, adhesives and sealants, and metal pretreatments, as well as services and coatings applications for automotive original equipment manufacturers; appliances, agricultural and construction equipment, consumer electronics, automotive parts and accessories, building products, transportation vehicles and other finished products; and on-site coatings services. It also provides coatings for the protection, performance, and decoration of metal cans, closures, plastic tubes, industrial packaging, and promotional and specialty packaging. In addition, this segment offers amorphous precipitated silica for tire, battery separator, and other end-uses; TESLIN substrates for labels, e-passports, drivers' licenses, breathable membranes, and other loyalty and identification cards; and organic light emitting diode materials, displays and lighting lens materials, and optical lenses and color-change products, as well as photochromic dyes. The company was founded in 1883 and is headquartered in Pittsburgh, Pennsylvania.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Basic Materials", "Industry": "Specialty Chemicals", "Address": "One PPG Place, Pittsburgh, PA, United States, 15272", "FullTimeEmployees": "47600", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "29261146112", "EBITDA": "2036999936", "PERatio": "28.6232", "PEGRatio": "77.7134", "BookValue": "20.477", "DividendPerShare": "2.16", "DividendYield": "0.0179", "EPS": "4.226", "RevenuePerShareTTM": "58.657", "ProfitMargin": "0.0723", "OperatingMarginTTM": "0.1093", "ReturnOnAssetsTTM": "0.0525", "ReturnOnEquityTTM": "0.2015", "RevenueTTM": "13889999872", "GrossProfitTTM": "6527000000", "DilutedEPSTTM": "4.226", "QuarterlyEarningsGrowthYOY": "-0.621", "QuarterlyRevenueGrowthYOY": "-0.251", "AnalystTargetPrice": "125.91", "TrailingPE": "28.6232", "ForwardPE": "25.641", "PriceToSalesRatioTTM": "2.0693", "PriceToBookRatio": "5.8989", "EVToRevenue": "2.4008", "EVToEBITDA": "16.8253", "Beta": "1.2643", "52WeekHigh": "134.36", "52WeekLow": "69.77", "50DayMovingAverage": "114.6061", "200DayMovingAverage": "101.9401", "SharesOutstanding": "235976992", "SharesFloat": "235550244", "SharesShort": "3873255", "SharesShortPriorMonth": "3431682", "ShortRatio": "2.32", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0164", "PercentInsiders": "0.418", "PercentInstitutions": "78.903", "ForwardAnnualDividendRate": "2.16", "ForwardAnnualDividendYield": "0.0179", "PayoutRatio": "0.4834", "DividendDate": "2020-09-11", "ExDividendDate": "2020-08-07", "LastSplitFactor": "2:1", "LastSplitDate": "2015-06-15"}