{"Symbol": "PGR", "AssetType": "Common Stock", "Name": "The Progressive Corporation", "Description": "The Progressive Corporation, through its subsidiaries, provides personal and commercial auto insurance, residential property insurance, and other specialty property-casualty insurance and related services primarily in the United States. Its Personal Lines segment writes insurance for personal autos, and recreational and other vehicles. This segment's products include personal auto insurance; and special lines products, including insurance for motorcycles, ATVs, RVs, watercrafts, and snowmobiles. The company's Commercial Lines segment provides auto-related primary liability and physical damage insurance, and business-related general liability and property insurance for autos, vans, pick-up trucks, and dump trucks used by small businesses; tractors, trailers, and straight trucks primarily used by regional general freight and expeditor-type businesses, and non-fleet long-haul operators; dump trucks, log trucks, and garbage trucks used by dirt, sand and gravel, logging, and coal-type businesses; tow trucks and wreckers used in towing services and gas/service station businesses; and non-fleet taxis, black-car services, and airport taxis. Its Property segment provides residential property insurance for homes, condos, manufactured homes, and renters, as well as offers personal umbrella insurance, and primary and excess flood insurance. The company also offers policy issuance and claims adjusting services; home, condominium, renters, and other insurance; and business owner's policies, general liability, professional liability, and workers' compensation insurance. In addition, it offers reinsurance services. The Progressive Corporation sells its products and services through independent insurance agencies, as well as directly on Internet through mobile devices, and over the phone. The Progressive Corporation was founded in 1937 and is headquartered in Mayfield, Ohio.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceProperty & Casualty", "Address": "6300 Wilson Mills Road, Mayfield, OH, United States, 44143", "FullTimeEmployees": "41571", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "55612715008", "EBITDA": "6006499840", "PERatio": "12.7399", "PEGRatio": "7.4743", "BookValue": "27.634", "DividendPerShare": "0.4", "DividendYield": "0.0043", "EPS": "7.46", "RevenuePerShareTTM": "69.372", "ProfitMargin": "0.1086", "OperatingMarginTTM": "0.1404", "ReturnOnAssetsTTM": "0.0643", "ReturnOnEquityTTM": "0.2917", "RevenueTTM": "40544698368", "GrossProfitTTM": "5528900000", "DilutedEPSTTM": "7.46", "QuarterlyEarningsGrowthYOY": "0.831", "QuarterlyRevenueGrowthYOY": "0.161", "AnalystTargetPrice": "94.4", "TrailingPE": "12.7399", "ForwardPE": "15.6986", "PriceToSalesRatioTTM": "1.3769", "PriceToBookRatio": "3.4393", "EVToRevenue": "1.5148", "EVToEBITDA": "0", "Beta": "0.5374", "52WeekHigh": "95.37", "52WeekLow": "62.18", "50DayMovingAverage": "89.8053", "200DayMovingAverage": "80.7071", "SharesOutstanding": "585396992", "SharesFloat": "582961655", "SharesShort": "7033012", "SharesShortPriorMonth": "6632535", "ShortRatio": "2.82", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0121", "PercentInsiders": "0.292", "PercentInstitutions": "82.117", "ForwardAnnualDividendRate": "0.4", "ForwardAnnualDividendYield": "0.0043", "PayoutRatio": "0.0536", "DividendDate": "2020-10-15", "ExDividendDate": "2020-10-06", "LastSplitFactor": "1:1", "LastSplitDate": "2014-01-27"}