{"Symbol": "PVH", "AssetType": "Common Stock", "Name": "PVH Corp", "Description": "PVH Corp. operates as an apparel company in the United States and internationally. The company operates through six segments: Tommy Hilfiger North America, Tommy Hilfiger International, Calvin Klein North America, Calvin Klein International, Heritage Brands Wholesale, and Heritage Brands Retail. It designs, markets, and retails men's and women's apparel and accessories, including branded dress shirts, neckwear, sportswear, jeans wear, performance apparel, intimate apparel, underwear, outerwear, luggage products, swimwear, swim products, handbags, accessories, footwear, sleepwear, loungewear, hats, scarves, gloves, socks, watches and jewelry, eyeglasses and non-ophthalmic sunglasses, fragrance, bath products, cosmetics, furnishings, small leather goods, accessories, and other products. The company offers its products under its own brands, such as Tommy Hilfiger, Calvin Klein, Van Heusen, IZOD, ARROW, Warner's, Olga, Geoffrey Beene, and True&Co.; and licensed brands comprising Speedo, Kenneth Cole New York, Kenneth Cole Reaction, Unlisted, a Kenneth Cole Production, MICHAEL Michael Kors, Michael Kors Collection, DKNY, and Chaps, as well as various other licensed and private label brands. It also licenses its own brands over various products. The company distributes its products at wholesale in department, chain, and specialty stores, as well as through warehouse clubs, mass market, and off-price and independent retailers; and through company-operated full-price specialty and outlet stores, as well as through digital commerce sites. PVH Corp. was founded in 1881 and is based in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Apparel Manufacturing", "Address": "200 Madison Avenue, New York, NY, United States, 10016", "FullTimeEmployees": "21500", "FiscalYearEnd": "February", "LatestQuarter": "2020-05-31", "MarketCapitalization": "4227536896", "EBITDA": "555500032", "PERatio": "9.4143", "PEGRatio": "310.75", "BookValue": "63.544", "DividendPerShare": "0.15", "DividendYield": "0.0047", "EPS": "5.6", "RevenuePerShareTTM": "121.457", "ProfitMargin": "-0.0856", "OperatingMarginTTM": "0.0256", "ReturnOnAssetsTTM": "0.0111", "ReturnOnEquityTTM": "-0.1487", "RevenueTTM": "8896700416", "GrossProfitTTM": "5401300000", "DilutedEPSTTM": "-10.398", "QuarterlyEarningsGrowthYOY": "-0.105", "QuarterlyRevenueGrowthYOY": "-0.43", "AnalystTargetPrice": "59.4", "TrailingPE": "9.4143", "ForwardPE": "1000", "PriceToSalesRatioTTM": "0.4546", "PriceToBookRatio": "0.8665", "EVToRevenue": "0.9208", "EVToEBITDA": "9.754", "Beta": "2.0313", "52WeekHigh": "108.06", "52WeekLow": "28.4", "50DayMovingAverage": "51.7158", "200DayMovingAverage": "50.385", "SharesOutstanding": "71039104", "SharesFloat": "70421764", "SharesShort": "4159177", "SharesShortPriorMonth": "4843463", "ShortRatio": "3.44", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0773", "PercentInsiders": "1.109", "PercentInstitutions": "108.119", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0.0047", "PayoutRatio": "0.0134", "DividendDate": "2020-03-31", "ExDividendDate": "2020-03-19", "LastSplitFactor": "2:1", "LastSplitDate": "1991-10-10"}