{"Symbol": "PWR", "AssetType": "Common Stock", "Name": "Quanta Services, Inc", "Description": "Quanta Services, Inc. provides specialty contracting services in the United States, Canada, Australia, Latin America, and internationally. Its Electric Power Infrastructure Services segment designs, installs, upgrades, repairs, and maintains electric power transmission and distribution infrastructure, and substation facilities, as well as provides other engineering and technical services; designs, installs, maintains, and repairs commercial and industrial wiring; and operates a postsecondary educational institution. It also offers emergency restoration services, including the repair of infrastructure damaged by inclement weather; installation, maintenance, and upgrade of electric power infrastructure; and installation of smart grid technologies on electric power networks. In addition, this segment provides services related to development of solar, wind, and various natural gas generation facilities, as well as related switchyards and transmission infrastructure; and construction of electric power generation facilities. The company's Pipeline and Industrial Infrastructure Services segment designs, installs, repairs, and maintains pipeline transmission and distribution systems, gathering systems, production systems, storage systems, and compressor and pump stations, as well as offers related trenching, directional boring, and mechanized welding services; and designs, installs, and maintains fueling systems, and water and sewer infrastructure. This segment also provides pipeline protection, integrity testing, and rehabilitation and replacement, as well as pipeline support systems, and related structures and facilities fabrication services; and high-pressure and critical-path turnaround, electrical, piping, fabrication, and storage tank services. It serves electric power, energy, and communications companies, as well as commercial, industrial, and governmental entities. The company was founded in 1997 and is headquartered in Houston, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Engineering & Construction", "Address": "2800 Post Oak Boulevard, Houston, TX, United States, 77056", "FullTimeEmployees": "40300", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "7362039808", "EBITDA": "866457984", "PERatio": "20.4", "PEGRatio": "0.75", "BookValue": "28.425", "DividendPerShare": "0.2", "DividendYield": "0.0039", "EPS": "2.506", "RevenuePerShareTTM": "81.486", "ProfitMargin": "0.0313", "OperatingMarginTTM": "0.0488", "ReturnOnAssetsTTM": "0.0445", "ReturnOnEquityTTM": "0.0971", "RevenueTTM": "11736020992", "GrossProfitTTM": "1600252000", "DilutedEPSTTM": "2.506", "QuarterlyEarningsGrowthYOY": "1.775", "QuarterlyRevenueGrowthYOY": "-0.117", "AnalystTargetPrice": "54.38", "TrailingPE": "20.4", "ForwardPE": "17.0068", "PriceToSalesRatioTTM": "0.6375", "PriceToBookRatio": "1.7982", "EVToRevenue": "0.6969", "EVToEBITDA": "9.5467", "Beta": "1.128", "52WeekHigh": "51.82", "52WeekLow": "23.77", "50DayMovingAverage": "45.5078", "200DayMovingAverage": "37.9641", "SharesOutstanding": "138020992", "SharesFloat": "136426838", "SharesShort": "4867549", "SharesShortPriorMonth": "5087978", "ShortRatio": "4.25", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0401", "PercentInsiders": "0.917", "PercentInstitutions": "100.965", "ForwardAnnualDividendRate": "0.2", "ForwardAnnualDividendYield": "0.0039", "PayoutRatio": "0.076", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-30", "LastSplitFactor": "3:2", "LastSplitDate": "2000-04-10"}