{"Symbol": "ROK", "AssetType": "Common Stock", "Name": "Rockwell Automation, Inc", "Description": "Rockwell Automation, Inc. provides industrial automation and digital transformation solutions. It operates in two segments, Architecture & Software, and Control Products & Solutions. The Architecture & Software segment offers a portfolio of automation and information platforms, including hardware and software. Its products include programmable automation controllers; design, visualization, and simulation software; and human machine interface products, networking products, industrial computers, sensing devices, machine safety devices, motion control products, and independent cart technology products. This segment also offers manufacturing execution systems and analytics software to enhance operational productivity and meet regulatory requirements. The Control Products & Solutions segment offers low and medium voltage electro-mechanical and electronic motor starters, AC/DC variable frequency drives, motor control and circuit protection devices, operator and signaling devices, termination and protection devices, relays and timers, and electrical control accessories. This segment also provides pre-configured line and load power solutions, packaged drives, motor control centers, and intelligent packaged power and engineered to order automation equipment solutions; and professional lifecycle services, such as safety, security, and digital transformation consulting, as well as automation and information project delivery capabilities, plant network, cloud, cybersecurity, asset management and predictive analytics, and remote, on-site, and managed support services. It primarily serves a range of industries, which include the automotive, semiconductor, and warehousing and logistics; food and beverage, and life sciences; and oil and gas, metals, and chemicals through independent distributors and direct sales force worldwide. Rockwell Automation, Inc. was founded in 1903 and is headquartered in Milwaukee, Wisconsin.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "1201 South 2nd Street, Milwaukee, WI, United States, 53204", "FullTimeEmployees": "23000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "27332261888", "EBITDA": "1282000000", "PERatio": "34.8233", "PEGRatio": "3.7395", "BookValue": "6.644", "DividendPerShare": "4.08", "DividendYield": "0.0174", "EPS": "6.578", "RevenuePerShareTTM": "55.997", "ProfitMargin": "0.1185", "OperatingMarginTTM": "0.1733", "ReturnOnAssetsTTM": "0.1042", "ReturnOnEquityTTM": "0.6836", "RevenueTTM": "6489999872", "GrossProfitTTM": "2900100000", "DilutedEPSTTM": "6.578", "QuarterlyEarningsGrowthYOY": "0.241", "QuarterlyRevenueGrowthYOY": "-0.163", "AnalystTargetPrice": "219.3", "TrailingPE": "34.8233", "ForwardPE": "28.9017", "PriceToSalesRatioTTM": "4.1444", "PriceToBookRatio": "34.6968", "EVToRevenue": "4.4007", "EVToEBITDA": "24.5175", "Beta": "1.4874", "52WeekHigh": "238.49", "52WeekLow": "115.38", "50DayMovingAverage": "227.1286", "200DayMovingAverage": "197.7582", "SharesOutstanding": "115967000", "SharesFloat": "115141281", "SharesShort": "2804515", "SharesShortPriorMonth": "2576458", "ShortRatio": "4.35", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0242", "PercentInsiders": "0.668", "PercentInstitutions": "78.986", "ForwardAnnualDividendRate": "4.08", "ForwardAnnualDividendYield": "0.0174", "PayoutRatio": "0.6088", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-14", "LastSplitFactor": "2:1", "LastSplitDate": "1987-04-14"}