{"Symbol": "SRE", "AssetType": "Common Stock", "Name": "Sempra Energy", "Description": "Sempra Energy operates as an energy-services holding company in the United States and internationally. The company's San Diego Gas & Electric Company segment generates, transmits, and distributes electricity; and supplies natural gas. It provides electric services to a population of approximately 3.7 million and natural gas services to approximately 3.4 million of that population covering an area of 4,100 square miles. Its Southern California Gas Company segment owns and operates a natural gas distribution, transmission, and storage system that supplies natural gas to a population of approximately 22 million covering an area of 24,000 square miles. The company's Sempra Texas Utilities segment is involved in the regulated transmission and distribution of electricity serving approximately 3.6 million homes and businesses, and operating approximately 139,000 miles of transmission and distribution lines. Its transmission system included 17,799 circuit miles of transmission lines, 349 transmission stations, and 775 distribution substations; distribution system consisted of 121,747 miles of overhead and underground lines; and approximately 65 miles of electric transmission lines. Its Sempra Mexico segment develops, owns and operates, or holds interests in natural gas, electric, liquefied natural gas (LNG), liquid petroleum gas (LPG), ethane, and liquid fuels infrastructure; and engages in the purchase of LNG, and purchase and sale of natural gas. This segment operates a natural-gas-fired combined-cycle plant, and wind and solar power generation facilities. Its assets/facilities consisted of 1,850 miles of natural gas transmission pipelines, 13 compressor stations, 139 miles of ethane pipelines, 118 miles of LPG pipelines, and one LPG storage terminal. The company's Sempra LNG segment develops and holds interest in export of LNG; and owns, operates, buys, sells, and transports natural gas. The company was founded in 1998 and is headquartered in San Diego, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Utilities", "Industry": "UtilitiesDiversified", "Address": "488 8th Avenue, San Diego, CA, United States, 92101", "FullTimeEmployees": "18000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "36027334656", "EBITDA": "4688000000", "PERatio": "17.0234", "PEGRatio": "4.36", "BookValue": "69.826", "DividendPerShare": "4.18", "DividendYield": "0.0342", "EPS": "14.533", "RevenuePerShareTTM": "39.226", "ProfitMargin": "0.3912", "OperatingMarginTTM": "0.2731", "ReturnOnAssetsTTM": "0.0293", "ReturnOnEquityTTM": "0.1105", "RevenueTTM": "11256000512", "GrossProfitTTM": "4196000000", "DilutedEPSTTM": "14.533", "QuarterlyEarningsGrowthYOY": "5.04", "QuarterlyRevenueGrowthYOY": "0.133", "AnalystTargetPrice": "146", "TrailingPE": "17.0234", "ForwardPE": "16.6113", "PriceToSalesRatioTTM": "3.2589", "PriceToBookRatio": "1.7457", "EVToRevenue": "5.3274", "EVToEBITDA": "13.2054", "Beta": "0.7374", "52WeekHigh": "161.87", "52WeekLow": "88", "50DayMovingAverage": "126.3231", "200DayMovingAverage": "124.6268", "SharesOutstanding": "289260000", "SharesFloat": "288715866", "SharesShort": "5838041", "SharesShortPriorMonth": "6673129", "ShortRatio": "3.75", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0229", "PercentInsiders": "0.06", "PercentInstitutions": "87.621", "ForwardAnnualDividendRate": "4.18", "ForwardAnnualDividendYield": "0.0342", "PayoutRatio": "0.5544", "DividendDate": "2020-07-15", "ExDividendDate": "2020-09-24", "LastSplitFactor": "2:1", "LastSplitDate": "1992-05-28"}