{"Symbol": "NOW", "AssetType": "Common Stock", "Name": "ServiceNow, Inc", "Description": "ServiceNow, Inc. provides enterprise cloud computing solutions that defines, structures, consolidates, manages, and automates services for enterprises worldwide. The company offers information technology (IT) service management applications; and digital workflow products for customer service, human resources, security operations, integrated risk management, and other enterprise departments. It operates the Now platform that offers workflow automation, electronic service catalogs and portals, configuration management systems, data benchmarking, performance analytics, encryption, and collaboration and development tools. The company also provides IT service management product suite for enterprise's employees, customers, and partners; IT operations management product that connects a customer's physical and cloud-based IT infrastructure with applications and platforms; IT Asset Management product to automate IT asset lifecycles with workflows; IT business management product suite to manage IT priorities; and enterprise development operations product for developers' toolchain. In addition, it offers customer service management product for customer service cases and requests; human resources service delivery product; security operations product for security operations management requirements of third-party; governance, risk, and compliance product to create policies and controls; and field service management application. Further, the company provides professional, training, and customer support services; and certification programs. It serves government, financial services, healthcare, telecommunications, manufacturing, IT services, technology, oil and gas, education, and consumer products. The company sells its products through direct sales team and resale partners. The company was formerly known as Service-now.com and changed its name to ServiceNow, Inc. in May 2012. The company was founded in 2004 and is headquartered in Santa Clara, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "2225 Lawson Lane, Santa Clara, CA, United States, 95054", "FullTimeEmployees": "11901", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "95840542720", "EBITDA": "491401984", "PERatio": "130.2304", "PEGRatio": "3.6061", "BookValue": "12.924", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.546", "RevenuePerShareTTM": "20.856", "ProfitMargin": "0.1842", "OperatingMarginTTM": "0.0497", "ReturnOnAssetsTTM": "0.0221", "ReturnOnEquityTTM": "0.3895", "RevenueTTM": "3954789120", "GrossProfitTTM": "2663792000", "DilutedEPSTTM": "3.546", "QuarterlyEarningsGrowthYOY": "4.25", "QuarterlyRevenueGrowthYOY": "0.284", "AnalystTargetPrice": "470.37", "TrailingPE": "130.2304", "ForwardPE": "114.9425", "PriceToSalesRatioTTM": "24.9626", "PriceToBookRatio": "37.1832", "EVToRevenue": "23.0164", "EVToEBITDA": "170.9136", "Beta": "1.3379", "52WeekHigh": "501.82", "52WeekLow": "225", "50DayMovingAverage": "442.7689", "200DayMovingAverage": "369.4409", "SharesOutstanding": "191800000", "SharesFloat": "190625260", "SharesShort": "5144357", "SharesShortPriorMonth": "6393243", "ShortRatio": "3", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.027", "PercentInsiders": "0.772", "PercentInstitutions": "98.929", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}