{"Symbol": "STT", "AssetType": "Common Stock", "Name": "State Street Corporation", "Description": "State Street Corporation, through its subsidiaries, provides a range of financial products and services to institutional investors worldwide. It offers investment servicing products and services, including custody; product and participant level accounting; daily pricing and administration; master trust and master custody; depotbank services; record-keeping; cash management; foreign exchange, brokerage, and other trading services; securities finance; deposit and short-term investment facilities; loans and lease financing; investment manager and alternative investment manager operations outsourcing; performance, risk, and compliance analytics; and financial data management to support institutional investors. The company also engages in the investment servicing line of business, such as portfolio modeling and construction; trade order management; investment risk and compliance; and wealth management solutions. In addition, it provides investment management strategies and products, such as core and enhanced indexing, multi-asset strategies, active quantitative and fundamental active capabilities, and alternative investment strategies. Further, the company offers services and solutions, including environmental, social, and governance investing; defined benefit and defined contribution; and outsourced chief investment officer, as well as exchange-traded fund under the SPDR ETF brand. The company provides its products and services to mutual funds, collective investment funds and other investment pools, corporate and public retirement plans, insurance companies, foundations, endowments, and investment managers. State Street Corporation was founded in 1792 and is headquartered in Boston, Massachusetts.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Asset Management", "Address": "State Street Financial Center, Boston, MA, United States, 02111", "FullTimeEmployees": "39068", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "24624523264", "EBITDA": "None", "PERatio": "11.08", "PEGRatio": "2.2488", "BookValue": "63.573", "DividendPerShare": "2.08", "DividendYield": "0.0303", "EPS": "6.242", "RevenuePerShareTTM": "32.962", "ProfitMargin": "0.2095", "OperatingMarginTTM": "0.2805", "ReturnOnAssetsTTM": "0.0095", "ReturnOnEquityTTM": "0.0984", "RevenueTTM": "11815999488", "GrossProfitTTM": "11702000000", "DilutedEPSTTM": "6.242", "QuarterlyEarningsGrowthYOY": "0.31", "QuarterlyRevenueGrowthYOY": "0.005", "AnalystTargetPrice": "71.81", "TrailingPE": "11.08", "ForwardPE": "11.6959", "PriceToSalesRatioTTM": "2.3182", "PriceToBookRatio": "1.0893", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.5115", "52WeekHigh": "82.94", "52WeekLow": "42.1", "50DayMovingAverage": "66.472", "200DayMovingAverage": "61.8982", "SharesOutstanding": "351956000", "SharesFloat": "332942266", "SharesShort": "6018891", "SharesShortPriorMonth": "3310633", "ShortRatio": "2.89", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0171", "PercentInsiders": "0.465", "PercentInstitutions": "95.309", "ForwardAnnualDividendRate": "2.08", "ForwardAnnualDividendYield": "0.0303", "PayoutRatio": "0.3328", "DividendDate": "2020-07-16", "ExDividendDate": "2020-06-30", "LastSplitFactor": "2:1", "LastSplitDate": "2001-05-31"}