{"Symbol": "SNPS", "AssetType": "Common Stock", "Name": "Synopsys, Inc", "Description": "Synopsys, Inc. provides electronic design automation software products used to design and test integrated circuits. It offers Fusion Design Platform, a digital design implementation solution; Verification Continuum Platform that provides virtual prototyping, static and formal verification, simulation, emulation, field-programmable gate array (FPGA)-based prototyping, and debug solutions; and FPGA design products that are programmed to perform specific functions. The company also offers intellectual property (IP) solutions for USB, PCI Express, DDR, Ethernet, SATA, MIPI, HDMI, and Bluetooth low energy applications; analog IP, including data converters and audio codecs; and system-on-chip infrastructure IP, datapath and building block IP, and verification IP products, as well as mathematical and floating point components, and ARM AMBA interconnect fabric and peripherals. In addition, it provides logic libraries and embedded memories; configurable processor cores and application-specific instruction-set processor tools for embedded applications; IP subsystems for audio, sensor, and data fusion functionality; and security IP solutions. Further, the company offers Platform Architect tools for SoC architecture analysis and optimization; virtual prototyping solutions; and HAPS FPGA-based prototyping systems, as well as a series of tools used in the design of optical systems and photonic devices. Additionally, it provides security testing, managed services, programs and professional services, and training that enable its customers to detect and remediate security vulnerabilities, and defects in the software development lifecycle; manufacturing solutions; and professional and other services. The company was founded in 1986 and is headquartered in Mountain View, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "690 East Middlefield Road, Mountain View, CA, United States, 94043", "FullTimeEmployees": "13896", "FiscalYearEnd": "October", "LatestQuarter": "2020-07-31", "MarketCapitalization": "34808131584", "EBITDA": "758123008", "PERatio": "53.755", "PEGRatio": "2.79", "BookValue": "30.285", "DividendPerShare": "None", "DividendYield": "0", "EPS": "4.039", "RevenuePerShareTTM": "23.307", "ProfitMargin": "0.1788", "OperatingMarginTTM": "0.1718", "ReturnOnAssetsTTM": "0.0546", "ReturnOnEquityTTM": "0.147", "RevenueTTM": "3510923008", "GrossProfitTTM": "2667371000", "DilutedEPSTTM": "4.039", "QuarterlyEarningsGrowthYOY": "1.492", "QuarterlyRevenueGrowthYOY": "0.13", "AnalystTargetPrice": "228.36", "TrailingPE": "53.755", "ForwardPE": "36.1011", "PriceToSalesRatioTTM": "9.5939", "PriceToBookRatio": "7.1712", "EVToRevenue": "9.2801", "EVToEBITDA": "41.1199", "Beta": "1.1538", "52WeekHigh": "226.21", "52WeekLow": "104.9", "50DayMovingAverage": "202.8361", "200DayMovingAverage": "169.6512", "SharesOutstanding": "150788992", "SharesFloat": "150773720", "SharesShort": "1989510", "SharesShortPriorMonth": "2014362", "ShortRatio": "2.36", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.012", "PercentInsiders": "0.728", "PercentInstitutions": "91.044", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2003-09-24"}