{"Symbol": "TDY", "AssetType": "Common Stock", "Name": "Teledyne Technologies Incorporated", "Description": "Teledyne Technologies Incorporated provides instrumentation, digital imaging, aerospace and defense electronics, and engineered systems in the United States, the United Kingdom, Canada, the Netherlands, and internationally. The company's Instrumentation segment offers monitoring and control instruments for marine, environmental, industrial, and other applications, as well as electronic test and measurement equipment; and power and communications connectivity devices for distributed instrumentation systems and sensor networks deployed in mission critical and harsh environments. Its Digital Imaging segment provides image sensors and digital cameras for use in industrial, scientific, academic research, and medical applications; and hardware and software for image processing and automatic data collection in industrial, academic research, and medical applications, as well as manufacturing services for micro electro-mechanical systems. This segment also offers light detection and ranging systems; focal plane arrays, sensors, and subsystems; and geospatial software products. The company's Aerospace and Defense Electronics segment provides electronic components and subsystems, as well as communications products, such as defense electronics; environment interconnects; data acquisition and communications equipment for aircraft; components and subsystems for wireless and satellite communications; and general aviation batteries. Its Engineered Systems segment offers systems engineering and integration, technology development, and manufacturing solutions for defense, space, environmental, and energy applications; and designs and manufactures electrochemical energy systems and electronics for military applications. The company markets and sells its products and services through sales forces, third-party distributors, and commissioned sales representatives. Teledyne Technologies Incorporated was founded in 1960 and is headquartered in Thousand Oaks, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "1049 Camino Dos Rios, Thousand Oaks, CA, United States, 91360-2362", "FullTimeEmployees": "11790", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "11899504640", "EBITDA": "623500032", "PERatio": "30.4583", "PEGRatio": "0.98", "BookValue": "78.137", "DividendPerShare": "None", "DividendYield": "0", "EPS": "10.553", "RevenuePerShareTTM": "86.693", "ProfitMargin": "0.1259", "OperatingMarginTTM": "0.1605", "ReturnOnAssetsTTM": "0.071", "ReturnOnEquityTTM": "0.1488", "RevenueTTM": "3164300032", "GrossProfitTTM": "1244100000", "DilutedEPSTTM": "10.553", "QuarterlyEarningsGrowthYOY": "-0.114", "QuarterlyRevenueGrowthYOY": "-0.049", "AnalystTargetPrice": "375", "TrailingPE": "30.4583", "ForwardPE": "0", "PriceToSalesRatioTTM": "3.8372", "PriceToBookRatio": "4.1171", "EVToRevenue": "3.9304", "EVToEBITDA": "20.8921", "Beta": "0.9962", "52WeekHigh": "396.595", "52WeekLow": "195.34", "50DayMovingAverage": "319.0272", "200DayMovingAverage": "320.9944", "SharesOutstanding": "36863400", "SharesFloat": "36297934", "SharesShort": "475873", "SharesShortPriorMonth": "603461", "ShortRatio": "2.22", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0154", "PercentInsiders": "1.58", "PercentInstitutions": "86.086", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}