{"Symbol": "TFC", "AssetType": "Common Stock", "Name": "Truist Financial Corporation", "Description": "Truist Financial Corporation, a holding company, provides banking and trust services for small and mid-size businesses, public agencies, local governments, corporations, and individuals in the Southeastern and Mid-Atlantic United States. The company operates through three segments: Consumer Banking and Wealth, Corporate and Commercial Banking, and Insurance Holdings. Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; bankcard lending; consumer finance; home equity and mortgage lending; insurance, such as property and casualty, life, health, employee benefits, workers compensation and professional liability, surety coverage, title, and other insurance products; investment brokerage; mobile/online banking; and payment, lease financing, small business lending, and wealth management/private banking services. In addition, it offers association, capital market, institutional trust, insurance premium and commercial finance, international banking, leasing, merchant, commercial deposit and treasury, commercial middle market lending, floor plan lending, commercial mortgage lending, mortgage warehouse lending, private equity investment, real estate lending, and supply chain financing services. Further, the company provides retail and wholesale brokerage, equity and debt underwriting, and investment advice. As of December 31, 2019, the company operated through approximately 2,958 banking offices. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. Truist Financial Corporation was founded in 1872 and is headquartered in Charlotte, North Carolina.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "214 North Tryon Street, Charlotte, NC, United States, 28202", "FullTimeEmployees": "55769", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "53109309440", "EBITDA": "None", "PERatio": "12.898", "PEGRatio": "2.4603", "BookValue": "None", "DividendPerShare": "1.8", "DividendYield": "0.046", "EPS": "None", "RevenuePerShareTTM": "14.682", "ProfitMargin": "0.2214", "OperatingMarginTTM": "0.3553", "ReturnOnAssetsTTM": "0.0097", "ReturnOnEquityTTM": "0.071", "RevenueTTM": "16085000192", "GrossProfitTTM": "11953000000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "-0.386", "QuarterlyRevenueGrowthYOY": "0.752", "AnalystTargetPrice": "44.11", "TrailingPE": "12.898", "ForwardPE": "14.0252", "PriceToSalesRatioTTM": "2.3956", "PriceToBookRatio": "0.8573", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.4308", "52WeekHigh": "56.92", "52WeekLow": "24.01", "50DayMovingAverage": "38.0981", "200DayMovingAverage": "37.3153", "SharesOutstanding": "1347609984", "SharesFloat": "1342892301", "SharesShort": "15490687", "SharesShortPriorMonth": "11002517", "ShortRatio": "3.24", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0115", "PercentInsiders": "0.439", "PercentInstitutions": "72.18", "ForwardAnnualDividendRate": "1.8", "ForwardAnnualDividendYield": "0.046", "PayoutRatio": "0.5921", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-13", "LastSplitFactor": "2:1", "LastSplitDate": "1998-08-04"}