{"Symbol": "TYL", "AssetType": "Common Stock", "Name": "Tyler Technologies, Inc", "Description": "Tyler Technologies, Inc. provides integrated information management solutions and services for the public sector in the United States and internationally. The company operates in two segments, Enterprise Software; and Appraisal and Tax. It offers financial management solutions, including modular fund accounting systems for government agencies or not-for-profit entities; utility billing systems for the billing and collection of metered and non-metered services; products to automate city and county functions, such as municipal courts, parking tickets, equipment and project costing, animal and business licenses, permits and inspections, code enforcement, citizen complaint tracking, ambulance billing, fleet maintenance, and cemetery records management; and student information and transportation solutions for K-12 schools. The company also provides a suite of judicial solutions comprising court case management, court and law enforcement, prosecutor, and supervision systems to handle multi-jurisdictional county or statewide implementations, and single county systems; public safety software solutions; systems and software to automate the appraisal and assessment of real and personal property, as well as tax applications for agencies that bill and collect taxes; planning, regulatory, and maintenance software solutions for public sector agencies; software applications to enhance and automate operations involving records and document management; and data and insights solutions. In addition, it offers software as a service arrangements and electronic document filing solutions for courts and law offices; software and hardware installation, data conversion, training, product modification, and maintenance and support services; and property appraisal outsourcing services for taxing jurisdictions. The company has a strategic collaboration agreement with Amazon Web Services for cloud hosting services. The company was founded in 1966 and is headquartered in Plano, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "5101 Tennyson Parkway, Plano, TX, United States, 75024", "FullTimeEmployees": "5495", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14075426816", "EBITDA": "209440992", "PERatio": "73.9957", "PEGRatio": "4.7443", "BookValue": "45.471", "DividendPerShare": "None", "DividendYield": "0", "EPS": "4.599", "RevenuePerShareTTM": "28.219", "ProfitMargin": "0.1696", "OperatingMarginTTM": "0.1453", "ReturnOnAssetsTTM": "0.0466", "ReturnOnEquityTTM": "0.116", "RevenueTTM": "1111869056", "GrossProfitTTM": "516900000", "DilutedEPSTTM": "4.599", "QuarterlyEarningsGrowthYOY": "0.625", "QuarterlyRevenueGrowthYOY": "-0.015", "AnalystTargetPrice": "359.36", "TrailingPE": "73.9957", "ForwardPE": "62.8931", "PriceToSalesRatioTTM": "12.5417", "PriceToBookRatio": "7.4875", "EVToRevenue": "11.9743", "EVToEBITDA": "55.3262", "Beta": "0.7582", "52WeekHigh": "382.92", "52WeekLow": "245", "50DayMovingAverage": "349.398", "200DayMovingAverage": "332.5648", "SharesOutstanding": "40240800", "SharesFloat": "39642412", "SharesShort": "1237114", "SharesShortPriorMonth": "1197457", "ShortRatio": "4.88", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0358", "PercentInsiders": "1.665", "PercentInstitutions": "94.799", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "1990-01-31", "LastSplitFactor": "3:1", "LastSplitDate": "1990-05-15"}