{"Symbol": "URI", "AssetType": "Common Stock", "Name": "United Rentals, Inc", "Description": "United Rentals, Inc., through its subsidiaries, operates as an equipment rental company. It operates in two segments, General Rentals; and Trench, Power and Fluid Solutions. The General Rentals segment rents general construction and industrial equipment, including backhoes, skid-steer loaders, forklifts, earthmoving equipment, and material handling equipment; aerial work platforms, such as boom lifts and scissor lifts; and general tools and light equipment comprising pressure washers, water pumps, and power tools. It serves construction and industrial companies, manufacturers, utilities, municipalities, homeowners, and government entities. The Trench, Power and Fluid Solutions segment rents specialty construction products that include trench safety equipment, which comprise trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers, and line testing equipment for underground work; and power, as well as heating, ventilating, and air conditioning equipment, including portable diesel generators, electrical distribution equipment, and temperature control equipment. It is also involved in the rental of fluid solutions equipment primarily used for fluid containment, transfer, and treatment. This segment serves construction companies involved in infrastructure projects, and municipalities and industrial companies. The company also sells aerial lifts, reach forklifts, telehandlers, compressors, and generators; construction consumables, tools, small equipment, and safety supplies; and parts for equipment that is owned by its customers, as well as provides repair and maintenance services. It sells its used equipment through its sales force, brokers, and Website, as well as at auctions and directly to manufacturers. As of January 29, 2020, the company operated a network of 1,164 rental locations in North America and 11 in Europe. United Rentals, Inc. was founded in 1997 and is headquartered in Stamford, Connecticut.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Rental & Leasing Services", "Address": "100 First Stamford Place, Stamford, CT, United States, 06902", "FullTimeEmployees": "19100", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13015540736", "EBITDA": "2473999872", "PERatio": "12.1452", "PEGRatio": "0.5515", "BookValue": "54.205", "DividendPerShare": "None", "DividendYield": "0", "EPS": "14.902", "RevenuePerShareTTM": "120.95", "ProfitMargin": "0.1237", "OperatingMarginTTM": "0.231", "ReturnOnAssetsTTM": "0.0704", "ReturnOnEquityTTM": "0.3017", "RevenueTTM": "9008000000", "GrossProfitTTM": "3745000000", "DilutedEPSTTM": "14.902", "QuarterlyEarningsGrowthYOY": "-0.148", "QuarterlyRevenueGrowthYOY": "-0.153", "AnalystTargetPrice": "175.21", "TrailingPE": "12.1452", "ForwardPE": "14.245", "PriceToSalesRatioTTM": "1.485", "PriceToBookRatio": "3.3027", "EVToRevenue": "2.6325", "EVToEBITDA": "5.8495", "Beta": "2.267", "52WeekHigh": "186.78", "52WeekLow": "58.85", "50DayMovingAverage": "169.3361", "200DayMovingAverage": "135.4238", "SharesOutstanding": "72080304", "SharesFloat": "71762403", "SharesShort": "7010363", "SharesShortPriorMonth": "6908643", "ShortRatio": "7.77", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1107", "PercentInsiders": "0.542", "PercentInstitutions": "97.669", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}