{"Symbol": "WBA", "AssetType": "Common Stock", "Name": "Walgreens Boots Alliance, Inc", "Description": "Walgreens Boots Alliance, Inc. operates as a pharmacy-led health and wellbeing company. It operates through three segments: Retail Pharmacy USA, Retail Pharmacy International, and Pharmaceutical Wholesale. The Retail Pharmacy USA segment sells prescription drugs and an assortment of retail products, including health, wellness, beauty, personal care, consumable, and general merchandise products through its retail drugstores and convenient care clinics. It also provides specialty pharmacy services and mail services; and manages in-store clinics. As of August 31, 2019, this segment operated 9,277 retail stores under the Walgreens and Duane Reade brands in the United States; and 6 specialty pharmacies. The Retail Pharmacy International segment sells prescription drugs; and health and wellness, beauty, personal care, and other consumer products through its pharmacy-led health and beauty stores and optical practices, as well as through boots.com and an integrated mobile application. This segment operated 4,605 retail stores under the Boots, Benavides, and Ahumada in the United Kingdom, Thailand, Norway, the Republic of Ireland, the Netherlands, Mexico, and Chile; and 606 optical practices, including 165 on a franchise basis. The Pharmaceutical Wholesale segment engages in the wholesale and distribution of specialty and generic pharmaceuticals, health and beauty products, and home healthcare supplies and equipment, as well as provides related services to pharmacies and other healthcare providers. This segment operates in the United Kingdom, Germany, France, Turkey, Spain, the Netherlands, Egypt, Norway, Romania, the Czech Republic, and Lithuania. Walgreens Boots Alliance, Inc. has a strategic partnership with Microsoft and Adobe to launch second phase of digital transformation at the intersection of health and technology. The company was founded in 1901 and is based in Deerfield, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Pharmaceutical Retailers", "Address": "108 Wilmot Road, Deerfield, IL, United States, 60015", "FullTimeEmployees": "232000", "FiscalYearEnd": "August", "LatestQuarter": "2020-05-31", "MarketCapitalization": "31853789184", "EBITDA": "5016000000", "PERatio": "46.2824", "PEGRatio": "6.891", "BookValue": "23.83", "DividendPerShare": "1.87", "DividendYield": "0.0509", "EPS": "0.849", "RevenuePerShareTTM": "156.302", "ProfitMargin": "0.0055", "OperatingMarginTTM": "0.0239", "ReturnOnAssetsTTM": "0.0267", "ReturnOnEquityTTM": "0.0327", "RevenueTTM": "138745004032", "GrossProfitTTM": "30076000000", "DilutedEPSTTM": "0.849", "QuarterlyEarningsGrowthYOY": "-0.137", "QuarterlyRevenueGrowthYOY": "0.001", "AnalystTargetPrice": "41.83", "TrailingPE": "46.2824", "ForwardPE": "7.6453", "PriceToSalesRatioTTM": "0.252", "PriceToBookRatio": "1.644", "EVToRevenue": "0.5337", "EVToEBITDA": "20.8926", "Beta": "0.5148", "52WeekHigh": "64.5", "52WeekLow": "36.68", "50DayMovingAverage": "40.4394", "200DayMovingAverage": "42.9722", "SharesOutstanding": "866534016", "SharesFloat": "718270106", "SharesShort": "18242347", "SharesShortPriorMonth": "18288805", "ShortRatio": "3.16", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0244", "PercentInsiders": "22.248", "PercentInstitutions": "60.614", "ForwardAnnualDividendRate": "1.87", "ForwardAnnualDividendYield": "0.0509", "PayoutRatio": "2.1529", "DividendDate": "2020-09-11", "ExDividendDate": "2020-08-18", "LastSplitFactor": "2:1", "LastSplitDate": "1999-02-16"}