{"Symbol": "WM", "AssetType": "Common Stock", "Name": "Waste Management, Inc", "Description": "Waste Management, Inc., through its subsidiaries, provides waste management environmental services to residential, commercial, industrial, and municipal customers in North America. It offers collection services, including picking up and transporting waste and recyclable materials from where it was generated to a transfer station, material recovery facility (MRF), or disposal site; and owns, develops, and operates landfill gas-to-energy facilities in the United States, as well as owns and operates transfer stations. As of December 31, 2019, the company owned or operated 244 solid waste landfills; 5 secure hazardous waste landfills; 103 MRFs; and 302 transfer stations. It also provides materials processing and commodities recycling services; recycling brokerage services, such as managing the marketing of recyclable materials for third parties; and other strategic business solutions. In addition, the company offers construction and remediation services; services related with the disposal of fly ash, and residue generated from the combustion of coal and other fuel stocks; in-plant services comprising full-service waste management solutions and consulting services; and specialized disposal services for oil and gas exploration and production operations. Further, it offers fluorescent bulb and universal waste mail-back services through LampTracker program; portable restroom services under the Port-o-Let name; and street and parking lot sweeping services, as well as holds interests in oil and gas producing properties. The company was formerly known as USA Waste Services, Inc. and changed its name to Waste Management, Inc. in 1998. Waste Management, Inc. was incorporated in 1987 and is based in Houston, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Waste Management", "Address": "1001 Fannin Street, Houston, TX, United States, 77002", "FullTimeEmployees": "44900", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "48223924224", "EBITDA": "4206000128", "PERatio": "30.2302", "PEGRatio": "4.1408", "BookValue": "16.323", "DividendPerShare": "2.18", "DividendYield": "0.0192", "EPS": "3.782", "RevenuePerShareTTM": "35.629", "ProfitMargin": "0.1066", "OperatingMarginTTM": "0.1716", "ReturnOnAssetsTTM": "0.0616", "ReturnOnEquityTTM": "0.241", "RevenueTTM": "15102999552", "GrossProfitTTM": "5975000000", "DilutedEPSTTM": "3.782", "QuarterlyEarningsGrowthYOY": "-0.191", "QuarterlyRevenueGrowthYOY": "-0.098", "AnalystTargetPrice": "116.79", "TrailingPE": "30.2302", "ForwardPE": "29.3255", "PriceToSalesRatioTTM": "3.2265", "PriceToBookRatio": "7.0055", "EVToRevenue": "3.8668", "EVToEBITDA": "14.4661", "Beta": "0.7275", "52WeekHigh": "126.79", "52WeekLow": "85.34", "50DayMovingAverage": "110.2106", "200DayMovingAverage": "105.3422", "SharesOutstanding": "422460992", "SharesFloat": "421121985", "SharesShort": "3906191", "SharesShortPriorMonth": "3018590", "ShortRatio": "2.52", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0093", "PercentInsiders": "0.155", "PercentInstitutions": "80.138", "ForwardAnnualDividendRate": "2.18", "ForwardAnnualDividendYield": "0.0192", "PayoutRatio": "0.5595", "DividendDate": "2020-09-18", "ExDividendDate": "2020-09-03", "LastSplitFactor": "None", "LastSplitDate": "None"}