{"Symbol": "WDC", "AssetType": "Common Stock", "Name": "Western Digital Corporation", "Description": "Western Digital Corporation develops, manufactures, and sells data storage devices and solutions. It offers client devices, including hard disk drives (HDDs) and solid state drives (SSDs) for computing devices, such as desktop and notebook personal computers (PCs), smart video systems, gaming consoles, and set top boxes; flash-based embedded storage products for mobile phones, tablets, notebook PCs, and other portable and wearable devices, as well as automotive, Internet of Things, industrial, and connected home applications; flash-based memory wafers; and embedded storage solutions and flash products. The company also provides data center devices and solutions comprising enterprise helium hard drives; enterprise SSDs consisting of flash-based SSDs and software solutions for use in enterprise servers, online transactions, data analysis, and other enterprise applications; data center solutions, including HDDs and drive configurations for use in data storage systems and tiered storage models; and data storage platforms and systems. In addition, it offers client solutions, such as external HDD storage products in mobile and desktop form; client SSDs; removable cards that are used in consumer devices comprising mobile phones, tablets, imaging systems, and still and action video cameras; universal serial bus flash drives for use in the computing and consumer markets; and wireless drive products used in-field back up of created content, as well as wireless streaming of high-definition movies, photos, music, and documents to tablets, smartphones, and PCs. The company sells its products under the G-Technology, SanDisk, and WD brands to original equipment manufacturers, distributors, resellers, and retailers. It operates in the United States, China, Hong Kong, Europe, the Middle East, Africa, rest of Asia, and internationally. Western Digital Corporation was founded in 1970 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Computer Hardware", "Address": "5601 Great Oaks Parkway, San Jose, CA, United States, 95119", "FullTimeEmployees": "63800", "FiscalYearEnd": "June", "LatestQuarter": "2020-07-31", "MarketCapitalization": "11868095488", "EBITDA": "1934000000", "PERatio": "None", "PEGRatio": "0.3698", "BookValue": "31.626", "DividendPerShare": "2", "DividendYield": "0.0434", "EPS": "-2.582", "RevenuePerShareTTM": "56.161", "ProfitMargin": "-0.0149", "OperatingMarginTTM": "0.022", "ReturnOnAssetsTTM": "0.0088", "ReturnOnEquityTTM": "-0.0256", "RevenueTTM": "16736000000", "GrossProfitTTM": "3781000000", "DilutedEPSTTM": "-0.84", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.18", "AnalystTargetPrice": "51.49", "TrailingPE": "0", "ForwardPE": "8.4602", "PriceToSalesRatioTTM": "0.6275", "PriceToBookRatio": "1.1058", "EVToRevenue": "1.0211", "EVToEBITDA": "8.9892", "Beta": "1.5522", "52WeekHigh": "71.3", "52WeekLow": "27.4", "50DayMovingAverage": "39.5411", "200DayMovingAverage": "43.3982", "SharesOutstanding": "299700992", "SharesFloat": "301128118", "SharesShort": "9031307", "SharesShortPriorMonth": "10586133", "ShortRatio": "1.58", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0384", "PercentInsiders": "0.361", "PercentInstitutions": "86.431", "ForwardAnnualDividendRate": "2", "ForwardAnnualDividendYield": "0.0434", "PayoutRatio": "0", "DividendDate": "2020-04-17", "ExDividendDate": "2020-04-02", "LastSplitFactor": "2:1", "LastSplitDate": "1997-06-04"}