{"Symbol": "ABBV", "AssetType": "Common Stock", "Name": "AbbVie Inc", "Description": "AbbVie Inc. discovers, develops, manufactures, and sells pharmaceuticals in the United States, Japan, Germany, Canada, France, Spain, Italy, the Netherlands, the United Kingdom, Brazil, and internationally. The company offers HUMIRA, a therapy administered as an injection for autoimmune and intestinal Behet's diseases; SKYRIZI to treat moderate to severe plaque psoriasis in adults; RINVOQ, a JAK inhibitor for the treatment of moderate to severe active rheumatoid arthritis in adult patients; IMBRUVICA to treat adult patients with chronic lymphocytic leukemia (CLL), small lymphocytic lymphoma (SLL), mantle cell lymphoma, waldenstrm's macroglobulinemia, marginal zone lymphoma, and chronic graft versus host disease; VENCLEXTA, a BCL-2 inhibitor used to treat adults with CLL or SLL; VIEKIRA PAK, an interferon-free therapy to treat adults with genotype 1 chronic hepatitis C virus (HCV); TECHNIVIE to treat adults with genotype 4 HCV infection; and MAVYRET to treat patients with chronic HCV genotype 1-6 infection. It also provides SYNAGIS that protects at-risk infants from severe respiratory disease; KALETRA, a prescription anti-HIV-1 medicine; CREON, a pancreatic enzyme therapy for exocrine pancreatic insufficiency; Synthroid used in the treatment of hypothyroidism; AndroGel for males diagnosed with symptomatic low testosterone; and Lupron, a product for the palliative treatment of advanced prostate cancer, endometriosis and central precocious puberty, and patients with anemia caused by uterine fibroids. In addition, the company offers ORILISSA, a nonpeptide small molecule gonadotropin-releasing hormone antagonist; Duopa and Duodopa, a levodopa-carbidopa intestinal gel to treat Parkinson's disease; and Sevoflurane, an anesthesia product. It has collaborations with Calico Life Sciences LLC; Alector, Inc.; Janssen Biotech, Inc.; Jacobio Pharmaceuticals; and Genmab A/S. The company was incorporated in 2012 and is based in North Chicago, Illinois.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "1 North Waukegan Road, North Chicago, IL, United States, 60064", "FullTimeEmployees": "47000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "166194036736", "EBITDA": "16728999936", "PERatio": "20.6346", "PEGRatio": "1.2788", "BookValue": "8.337", "DividendPerShare": "4.72", "DividendYield": "0.0501", "EPS": "4.523", "RevenuePerShareTTM": "23.787", "ProfitMargin": "0.192", "OperatingMarginTTM": "0.3755", "ReturnOnAssetsTTM": "0.0823", "ReturnOnEquityTTM": "2.2562", "RevenueTTM": "36226998272", "GrossProfitTTM": "25827000000", "DilutedEPSTTM": "4.523", "QuarterlyEarningsGrowthYOY": "0.224", "QuarterlyRevenueGrowthYOY": "0.263", "AnalystTargetPrice": "109.38", "TrailingPE": "20.6346", "ForwardPE": "9.058", "PriceToSalesRatioTTM": "3.9735", "PriceToBookRatio": "11.3152", "EVToRevenue": "4.5754", "EVToEBITDA": "12.9093", "Beta": "0.7852", "52WeekHigh": "101.28", "52WeekLow": "62.55", "50DayMovingAverage": "95.9786", "200DayMovingAverage": "89.4485", "SharesOutstanding": "1764829952", "SharesFloat": "1762362479", "SharesShort": "12410255", "SharesShortPriorMonth": "13683834", "ShortRatio": "1.9", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.007", "PercentInsiders": "0.111", "PercentInstitutions": "76.761", "ForwardAnnualDividendRate": "4.72", "ForwardAnnualDividendYield": "0.0501", "PayoutRatio": "0.9847", "DividendDate": "2020-08-14", "ExDividendDate": "2020-07-14", "LastSplitFactor": "None", "LastSplitDate": "None"}