{"Symbol": "ABMD", "AssetType": "Common Stock", "Name": "Abiomed, Inc", "Description": "Abiomed, Inc. engages in the research, development, and sale of medical devices to assist or replace the pumping function of the failing heart. It also provides a continuum of care to heart failure patients. The company offers Impella 2.5 catheter, a percutaneous micro heart pump with integrated motor and sensors for use in interventional cardiology; and Impella CP, a device used by interventional cardiologists to support patients in the cath lab and cardiac surgeons in the heart surgery suite. It also provides Impella 5.0 and Impella LD, which are percutaneous micro heart pumps with integrated motors and sensors for use primarily in the heart surgery suite; Impella RP, a percutaneous catheter-based axial flow pump; Impella SmartAssist platform that includes optical sensor technology for improved pump positioning and the use of algorithms that enable improved native heart assessment during the weaning process; and Impella Connect, a cloud-based technology that enables secure, cloud-based, and remote viewing of the Automated Impella Controller for physicians and hospital staffs. In addition, the company engages in the development of Impella XR Sheath, a sheath designed to expand and recoil to all for ease of use upon insertion of an Impella heart pump and minimize the size of the arteriotomy; Impella BTR, a percutaneous micro heart pumps with integrated motors and sensors; and Impella ECP pump that is designed for blood flow of greater than three liters per minute. It sells its products through direct sales and clinical support personnel in the United States, Canada, Europe, and Asia. The company was founded in 1981 and is headquartered in Danvers, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "22 Cherry Hill Drive, Danvers, MA, United States, 01923", "FullTimeEmployees": "1536", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13651134464", "EBITDA": "244875008", "PERatio": "89.3966", "PEGRatio": "2.75", "BookValue": "24.461", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.473", "RevenuePerShareTTM": "17.685", "ProfitMargin": "0.1988", "OperatingMarginTTM": "0.2798", "ReturnOnAssetsTTM": "0.1176", "ReturnOnEquityTTM": "0.1508", "RevenueTTM": "798067008", "GrossProfitTTM": "689578000", "DilutedEPSTTM": "3.473", "QuarterlyEarningsGrowthYOY": "-0.492", "QuarterlyRevenueGrowthYOY": "-0.206", "AnalystTargetPrice": "326.4", "TrailingPE": "89.3966", "ForwardPE": "0", "PriceToSalesRatioTTM": "17.8069", "PriceToBookRatio": "12.7188", "EVToRevenue": "17.0247", "EVToEBITDA": "55.6598", "Beta": "0.9907", "52WeekHigh": "319.19", "52WeekLow": "130.01", "50DayMovingAverage": "298.7159", "200DayMovingAverage": "216.803", "SharesOutstanding": "45047300", "SharesFloat": "44039555", "SharesShort": "2458373", "SharesShortPriorMonth": "2362007", "ShortRatio": "6.37", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0555", "PercentInsiders": "2.035", "PercentInstitutions": "101.37", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2000-10-02"}