{"Symbol": "ATVI", "AssetType": "Common Stock", "Name": "Activision Blizzard, Inc", "Description": "Activision Blizzard, Inc., together with its subsidiaries, develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Activision Publishing, Inc.; Blizzard Entertainment, Inc.; and King Digital Entertainment. It develops, publishes, and sells interactive software products and entertainment content for the console and PC platforms through retail and digital channels, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies; and offer downloadable content. The company also maintains a proprietary online gaming service, Battle.net that facilitates the creation of user generated content, digital distribution, and online social connectivity in its games; and develops and publishes interactive entertainment content and services primarily on mobile platforms, such as Android and iOS, as well as distributes its content and services on the PC platform primarily through Facebook. In addition, it operate esports leagues and offer digital advertising content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's key product franchises include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. It serves retailers and distributors, including mass-market retailers, first party digital storefronts, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements. Activision Blizzard, Inc. was incorporated in 1979 and is headquartered in Santa Monica, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Electronic Gaming & Multimedia", "Address": "3100 Ocean Park Boulevard, Santa Monica, CA, United States, 90405", "FullTimeEmployees": "9080", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "64227467264", "EBITDA": "2416999936", "PERatio": "35.8547", "PEGRatio": "2.3839", "BookValue": "17.73", "DividendPerShare": "0.41", "DividendYield": "0.0049", "EPS": "2.341", "RevenuePerShareTTM": "9.081", "ProfitMargin": "0.2594", "OperatingMarginTTM": "0.3075", "ReturnOnAssetsTTM": "0.0712", "ReturnOnEquityTTM": "0.1413", "RevenueTTM": "6988000256", "GrossProfitTTM": "4400000000", "DilutedEPSTTM": "2.341", "QuarterlyEarningsGrowthYOY": "0.752", "QuarterlyRevenueGrowthYOY": "0.384", "AnalystTargetPrice": "94.65", "TrailingPE": "35.8547", "ForwardPE": "30.2115", "PriceToSalesRatioTTM": "9.2869", "PriceToBookRatio": "4.7332", "EVToRevenue": "8.7433", "EVToEBITDA": "23.8571", "Beta": "0.6176", "52WeekHigh": "87.73", "52WeekLow": "50.25", "50DayMovingAverage": "81.9144", "200DayMovingAverage": "70.5812", "SharesOutstanding": "771872000", "SharesFloat": "763219372", "SharesShort": "11552014", "SharesShortPriorMonth": "9355215", "ShortRatio": "1.54", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0138", "PercentInsiders": "1.374", "PercentInstitutions": "92.221", "ForwardAnnualDividendRate": "0.41", "ForwardAnnualDividendYield": "0.0049", "PayoutRatio": "0.1752", "DividendDate": "2020-05-06", "ExDividendDate": "2020-04-14", "LastSplitFactor": "2:1", "LastSplitDate": "2008-09-08"}