{"Symbol": "ADBE", "AssetType": "Common Stock", "Name": "Adobe Inc", "Description": "Adobe Inc. operates as a diversified software company worldwide. Its Digital Media segment provides tools and solutions that enable individuals, small and medium businesses, and enterprises to create, publish, promote, and monetize their digital content. Its flagship product is Creative Cloud, a subscription service that allows customer to download and access the latest versions of its creative products. This segment serves traditional content creators, Web application developers, and digital media professionals, as well as their management in marketing departments and agencies, companies, and publishers. The company's Digital Experience segment offers solutions for how digital advertising and marketing are created, managed, executed, measured, and optimized. This segment provides analytics, social marketing, targeting, media optimization, digital experience management, cross-channel campaign management, marketing automation, audience management, and video delivery and monetization solutions to digital marketers, advertisers, publishers, merchandisers, Web analysts, chief marketing officers, chief information officers, and chief revenue officers. Its Publishing segment offers products and services, such as e-learning solutions, technical document publishing, Web application development, and high-end printing, as well as publishing needs of technical and business, and original equipment manufacturers (OEMs) printing businesses. The company offers its products and services directly to enterprise customers through its sales force, as well as to end-users through app stores and through its Website at adobe.com. It also distributes products and services through a network of distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and OEMs. Adobe Inc. has a strategic partnership with Walgreens Boots Alliance, Inc. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. The company was founded in 1982 and is headquarter", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "345 Park Avenue, San Jose, CA, United States, 95110-2704", "FullTimeEmployees": "22634", "FiscalYearEnd": "November", "LatestQuarter": "2020-05-31", "MarketCapitalization": "247718182912", "EBITDA": "4345889792", "PERatio": "67.3245", "PEGRatio": "2.3949", "BookValue": "22.669", "DividendPerShare": "None", "DividendYield": "0", "EPS": "7.579", "RevenuePerShareTTM": "24.921", "ProfitMargin": "0.3071", "OperatingMarginTTM": "0.3136", "ReturnOnAssetsTTM": "0.1144", "ReturnOnEquityTTM": "0.3555", "RevenueTTM": "12045296640", "GrossProfitTTM": "9498577000", "DilutedEPSTTM": "7.579", "QuarterlyEarningsGrowthYOY": "0.76", "QuarterlyRevenueGrowthYOY": "0.14", "AnalystTargetPrice": "439.77", "TrailingPE": "67.3245", "ForwardPE": "45.8716", "PriceToSalesRatioTTM": "20.6801", "PriceToBookRatio": "22.4963", "EVToRevenue": "20.3506", "EVToEBITDA": "53.4326", "Beta": "0.9082", "52WeekHigh": "533.7", "52WeekLow": "255.1314", "50DayMovingAverage": "454.2789", "200DayMovingAverage": "386.927", "SharesOutstanding": "479664992", "SharesFloat": "477391626", "SharesShort": "4877621", "SharesShortPriorMonth": "4620485", "ShortRatio": "1.65", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0078", "PercentInsiders": "0.294", "PercentInstitutions": "89.1", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "2005-03-24", "LastSplitFactor": "2:1", "LastSplitDate": "2005-05-24"}