{"Symbol": "ALGN", "AssetType": "Common Stock", "Name": "Align Technology, Inc", "Description": "Align Technology, Inc., a medical device company, designs, manufactures, and markets Invisalign clear aligners and iTero intraoral scanners and services for orthodontists and general practitioner dentists, and restorative and aesthetic dentistry. It operates in two segments, Clear Aligner; and Scanners and Services. The Clear Aligner segment consists of comprehensive products, including Invisalign Comprehensive treatment that addresses the orthodontic needs of teenage patients, such as mandibular advancement, compliance indicators, and compensation for tooth eruption; and Invisalign First Phase I and Invisalign First Comprehensive Phase 2 package for younger patients generally between the ages of seven and ten years, which is a mixture of primary/baby and permanent teeth. This segment's non-comprehensive products comprise Invisalign Moderate, Lite and Express packages, and Invisalign Go; and non-case products include retention products, Invisalign training fees, and sales of ancillary products, such as cleaning material, and adjusting tools used by dental professionals during the course of treatment. The Scanners and Services segment offers iTero Scanner, a single hardware platform with software options for restorative or orthodontic procedures; restorative software for general practitioner dentists, prosthodontists, periodontists, and oral surgeons; software for orthodontists for digital records storage, orthodontic diagnosis, and for the fabrication of printed models and retainers; computer-aided design/computer-aided manufacturing services and ancillary products, such as disposable sleeves for the wand; and iTero applications and tools. The company sells its products in the United States, the Netherlands, China, and internationally. Align Technology, Inc. was founded in 1997 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "2820 Orchard Parkway, San Jose, CA, United States, 95134", "FullTimeEmployees": "14530", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "23681705984", "EBITDA": "360112992", "PERatio": "14.2026", "PEGRatio": "4.9729", "BookValue": "36.113", "DividendPerShare": "None", "DividendYield": "0", "EPS": "21.469", "RevenuePerShareTTM": "27.411", "ProfitMargin": "0.7875", "OperatingMarginTTM": "0.1243", "ReturnOnAssetsTTM": "0.0527", "ReturnOnEquityTTM": "0.8065", "RevenueTTM": "2160404992", "GrossProfitTTM": "1743897000", "DilutedEPSTTM": "21.469", "QuarterlyEarningsGrowthYOY": "20.584", "QuarterlyRevenueGrowthYOY": "-0.413", "AnalystTargetPrice": "325.93", "TrailingPE": "14.2026", "ForwardPE": "85.4701", "PriceToSalesRatioTTM": "11.2154", "PriceToBookRatio": "8.464", "EVToRevenue": "10.9921", "EVToEBITDA": "67.0429", "Beta": "1.9841", "52WeekHigh": "326.36", "52WeekLow": "127.88", "50DayMovingAverage": "301.4867", "200DayMovingAverage": "243.9419", "SharesOutstanding": "78786704", "SharesFloat": "71376008", "SharesShort": "3671764", "SharesShortPriorMonth": "3810145", "ShortRatio": "4.05", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0483", "PercentInsiders": "8.32", "PercentInstitutions": "87.225", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}