{"Symbol": "ABC", "AssetType": "Common Stock", "Name": "AmerisourceBergen Corporation", "Description": "AmerisourceBergen Corporation sources and distributes pharmaceutical products in the United States and internationally. Its Pharmaceutical Distribution segment distributes brand-name and generic pharmaceuticals, over-the-counter healthcare products, home healthcare supplies and equipment, outsourced compounded sterile preparations, and related services to various healthcare providers, including acute care hospitals and health systems, independent and chain retail pharmacies, mail order pharmacies, medical clinics, long-term care and other alternate site pharmacies, and other customers. It also provides pharmacy management, staffing, and other consulting services; supply management software to retail and institutional healthcare providers; and packaging solutions to various institutional and retail healthcare providers. In addition, this segment distributes plasma and other blood products, injectable pharmaceuticals, vaccines, and other specialty products; provides other services primarily to physicians who specialize in various disease states, primarily oncology, as well as to other healthcare providers, including hospitals and dialysis clinics; and offers data analytics, outcomes research, and additional services for biotechnology and pharmaceutical manufacturers. The company's Other segment provides integrated manufacturer services, such as clinical trial support, product post-approval, and commercialization support; offers specialty transportation and logistics services for the biopharmaceutical industry; and sells pharmaceuticals, vaccines, parasiticides, diagnostics, micro feed ingredients, and various other products to customers in both the companion animal and production animal markets, as well as provides demand-creating sales force services to manufacturers. AmerisourceBergen Corporation was founded in 1985 and is headquartered in Chesterbrook, Pennsylvania.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Distribution", "Address": "1300 Morris Drive, Chesterbrook, PA, United States, 19087", "FullTimeEmployees": "22000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "19914053632", "EBITDA": "2253736960", "PERatio": "12.963", "PEGRatio": "3.2457", "BookValue": "18.912", "DividendPerShare": "1.68", "DividendYield": "0.0171", "EPS": "7.531", "RevenuePerShareTTM": "900.743", "ProfitMargin": "0.0084", "OperatingMarginTTM": "0.0099", "ReturnOnAssetsTTM": "0.029", "ReturnOnEquityTTM": "0.4459", "RevenueTTM": "186286964736", "GrossProfitTTM": "4992440000", "DilutedEPSTTM": "7.531", "QuarterlyEarningsGrowthYOY": "-0.014", "QuarterlyRevenueGrowthYOY": "0.003", "AnalystTargetPrice": "110.81", "TrailingPE": "12.963", "ForwardPE": "11.8203", "PriceToSalesRatioTTM": "0.1098", "PriceToBookRatio": "5.1934", "EVToRevenue": "0.1114", "EVToEBITDA": "13.0764", "Beta": "0.6016", "52WeekHigh": "105.21", "52WeekLow": "72.0583", "50DayMovingAverage": "101.6014", "200DayMovingAverage": "93.7235", "SharesOutstanding": "204142000", "SharesFloat": "146871856", "SharesShort": "3758606", "SharesShortPriorMonth": "3585771", "ShortRatio": "4.18", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0256", "PercentInsiders": "27.781", "PercentInstitutions": "67.905", "ForwardAnnualDividendRate": "1.68", "ForwardAnnualDividendYield": "0.0171", "PayoutRatio": "0.2166", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-14", "LastSplitFactor": "2:1", "LastSplitDate": "2009-06-16"}