{"Symbol": "AMP", "AssetType": "Common Stock", "Name": "Ameriprise Financial, Inc", "Description": "Ameriprise Financial, Inc., through its subsidiaries, provides various financial products and services to individual and institutional clients in the United States and internationally. It operates through five segments: Advice & Wealth Management, Asset Management, Annuities, Protection, and Corporate & Other. The Advice & Wealth Management segment provides financial planning and advice, as well as full-service brokerage services primarily to retail clients through its advisors. The Asset Management segment offers investment management, advice, and investment products to retail, high net worth, and institutional clients through unaffiliated third party financial institutions and institutional sales force. Its products also include U.S. mutual funds and their non-U.S. equivalents, exchange-traded funds, variable product funds underlying insurance, and annuity separate accounts; and institutional asset management products, such as traditional asset classes, separately managed accounts, individually managed accounts, collateralized loan obligations, hedge funds, collective funds, and property funds. The Annuities segment provides variable and fixed annuity products to individual clients through affiliated and unaffiliated advisors, and financial institutions. The Protection segment offers variable and fixed annuity products to address the protection and risk management needs of retail clients, including life and disability income insurance. The Corporate & Other segment consist of long term care business, net investment income or loss on corporate level assets. The company was formerly known as American Express Financial Corporation and changed its name to Ameriprise Financial, Inc. in September 2005. Ameriprise Financial, Inc. was founded in 1894 and is headquartered in Minneapolis, Minnesota.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Asset Management", "Address": "55 Ameriprise Financial Center, Minneapolis, MN, United States, 55474", "FullTimeEmployees": "12500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "19109541888", "EBITDA": "3900000000", "PERatio": "8.0653", "PEGRatio": "2.7251", "BookValue": "53.894", "DividendPerShare": "4.16", "DividendYield": "0.0261", "EPS": "19.245", "RevenuePerShareTTM": "95.212", "ProfitMargin": "0.205", "OperatingMarginTTM": "0.304", "ReturnOnAssetsTTM": "0.0153", "ReturnOnEquityTTM": "0.3995", "RevenueTTM": "12211000320", "GrossProfitTTM": "6325000000", "DilutedEPSTTM": "19.245", "QuarterlyEarningsGrowthYOY": "4.631", "QuarterlyRevenueGrowthYOY": "-0.168", "AnalystTargetPrice": "180.5", "TrailingPE": "8.0653", "ForwardPE": "10.627", "PriceToSalesRatioTTM": "1.6587", "PriceToBookRatio": "2.8816", "EVToRevenue": "1.2736", "EVToEBITDA": "0", "Beta": "1.8159", "52WeekHigh": "180.854", "52WeekLow": "80.01", "50DayMovingAverage": "155.9667", "200DayMovingAverage": "136.9863", "SharesOutstanding": "120269000", "SharesFloat": "119821467", "SharesShort": "2852362", "SharesShortPriorMonth": "2780728", "ShortRatio": "4.45", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0267", "PercentInsiders": "0.25", "PercentInstitutions": "88.016", "ForwardAnnualDividendRate": "4.16", "ForwardAnnualDividendYield": "0.0261", "PayoutRatio": "0.2046", "DividendDate": "2020-08-21", "ExDividendDate": "2020-08-07", "LastSplitFactor": "None", "LastSplitDate": "None"}