{"Symbol": "AME", "AssetType": "Common Stock", "Name": "AMETEK, Inc", "Description": "AMETEK, Inc. manufactures and sells electronic instruments and electromechanical devices worldwide. It operates through two segments, Electronic Instruments (EIG) and Electromechanical (EMG). The company's EIG segment offers advanced instruments for the process, aerospace, power, and industrial markets; process and analytical instruments for the oil and gas, petrochemical, pharmaceutical, semiconductor, automation, and food and beverage industries; and instruments to the laboratory equipment, ultra-precision manufacturing, medical, and test and measurement markets. This segment also provides power quality monitoring and metering, uninterruptible power supplies, programmable power equipment, electromagnetic compatibility test equipment, sensors for gas turbines, dashboard instruments for heavy trucks and other vehicles, and instrumentation and controls for the food and beverage industries; and aircraft and engine sensors, monitoring systems, power supplies, fuel and fluid measurement systems, and data acquisition units for the aerospace industry. Its EMG segment offers engineered electrical connectors and electronics packaging for protecting sensitive electronic devices; precision motion control products for data storage, medical devices, business equipment, automation and other applications; high-purity powdered metals, strip and foil, specialty clad metals, and metal matrix composites; motor-blower systems and heat exchangers for use in thermal management, military, commercial aircraft, and military ground vehicles; and motors for use in commercial appliances, fitness equipment, food and beverage machines, hydraulic pumps, and industrial blowers. This segment also operates a network of aviation maintenance, repair, and overhaul facilities. In addition, the company offers clinical and education communication solutions for hospitals, health systems, and educational facilities. AMETEK, Inc. was incorporated in 1930 and is headquartered in Berwyn, Pennsylvania.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "1100 Cassatt Road, Berwyn, PA, United States, 19312-1177", "FullTimeEmployees": "18100", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "23406186496", "EBITDA": "1317892992", "PERatio": "26.1425", "PEGRatio": "2.6872", "BookValue": "23.892", "DividendPerShare": "0.72", "DividendYield": "0.0071", "EPS": "3.86", "RevenuePerShareTTM": "20.969", "ProfitMargin": "0.1852", "OperatingMarginTTM": "0.2234", "ReturnOnAssetsTTM": "0.0691", "ReturnOnEquityTTM": "0.175", "RevenueTTM": "4795594240", "GrossProfitTTM": "1787660000", "DilutedEPSTTM": "3.86", "QuarterlyEarningsGrowthYOY": "-0.234", "QuarterlyRevenueGrowthYOY": "-0.215", "AnalystTargetPrice": "106.07", "TrailingPE": "26.1425", "ForwardPE": "26.5957", "PriceToSalesRatioTTM": "4.844", "PriceToBookRatio": "4.2235", "EVToRevenue": "5.2298", "EVToEBITDA": "17.462", "Beta": "1.2363", "52WeekHigh": "102.31", "52WeekLow": "54.82", "50DayMovingAverage": "96.3586", "200DayMovingAverage": "86.9721", "SharesOutstanding": "229630000", "SharesFloat": "228585577", "SharesShort": "2055449", "SharesShortPriorMonth": "2014159", "ShortRatio": "1.7", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0101", "PercentInsiders": "0.452", "PercentInstitutions": "89.039", "ForwardAnnualDividendRate": "0.72", "ForwardAnnualDividendYield": "0.0071", "PayoutRatio": "0.1658", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-11", "LastSplitFactor": "3:2", "LastSplitDate": "2012-07-02"}