{"Symbol": "AMAT", "AssetType": "Common Stock", "Name": "Applied Materials, Inc", "Description": "Applied Materials, Inc. provides manufacturing equipment, services, and software to the semiconductor, display, and related industries. It operates through three segments: Semiconductor Systems, Applied Global Services, and Display and Adjacent Markets. The Semiconductor Systems segment develops, manufactures, and sells various manufacturing equipment that is used to fabricate semiconductor chips or integrated circuits. This segment also offers various technologies, including epitaxy, ion implantation, oxidation and nitridation, rapid thermal processing, physical vapor deposition, chemical vapor deposition, chemical mechanical planarization, electrochemical deposition, atomic layer deposition, etching, and selective removal, as well as metrology and inspection tools. The Applied Global Services segment provides integrated solutions to optimize equipment and fab performance and productivity comprising spares, upgrades, services, remanufactured earlier generation equipment, and factory automation software for semiconductor, display, and other products. The Display and Adjacent Markets segment offers products for manufacturing liquid crystal displays; organic light-emitting diodes; and other display technologies for TVs, monitors, laptops, personal computers, electronic tablets, smart phones, and other consumer-oriented devices, as well as equipment for flexible substrates. The company serves manufacturers of semiconductor wafers and chips, liquid crystal and organic light-emitting diode displays, and other electronic devices. It operates in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. Applied Materials, Inc. was founded in 1967 and is headquartered in Santa Clara, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductor Equipment & Materials", "Address": "3050 Bowers Avenue, Santa Clara, CA, United States, 95052", "FullTimeEmployees": "23600", "FiscalYearEnd": "October", "LatestQuarter": "2020-07-31", "MarketCapitalization": "57600757760", "EBITDA": "4382000128", "PERatio": "18.032", "PEGRatio": "1.0435", "BookValue": "10.478", "DividendPerShare": "0.88", "DividendYield": "0.0142", "EPS": "3.44", "RevenuePerShareTTM": "17.745", "ProfitMargin": "0.1958", "OperatingMarginTTM": "0.2466", "ReturnOnAssetsTTM": "0.1254", "ReturnOnEquityTTM": "0.3603", "RevenueTTM": "16268000256", "GrossProfitTTM": "6386000000", "DilutedEPSTTM": "3.44", "QuarterlyEarningsGrowthYOY": "0.492", "QuarterlyRevenueGrowthYOY": "0.234", "AnalystTargetPrice": "76.8", "TrailingPE": "18.032", "ForwardPE": "13.7174", "PriceToSalesRatioTTM": "3.5289", "PriceToBookRatio": "5.9203", "EVToRevenue": "3.5408", "EVToEBITDA": "13.1689", "Beta": "1.3989", "52WeekHigh": "69.44", "52WeekLow": "36.64", "50DayMovingAverage": "63.8736", "200DayMovingAverage": "56.895", "SharesOutstanding": "913283008", "SharesFloat": "909227789", "SharesShort": "18340579", "SharesShortPriorMonth": "22100521", "ShortRatio": "2.34", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0177", "PercentInsiders": "0.362", "PercentInstitutions": "85.346", "ForwardAnnualDividendRate": "0.88", "ForwardAnnualDividendYield": "0.0142", "PayoutRatio": "0.2471", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-19", "LastSplitFactor": "2:1", "LastSplitDate": "2002-04-17"}