{"Symbol": "AVY", "AssetType": "Common Stock", "Name": "Avery Dennison Corporation", "Description": "Avery Dennison Corporation produces and sells pressure-sensitive materials worldwide. The company's Label and Graphic Materials segment offers pressure-sensitive label and packaging materials; and graphics and reflective products under the Fasson, JAC, Avery Dennison, and Mactac brands, as well as durable cast and reflective films. It provides its products to the home and personal care, beer and beverage, durables, pharmaceutical, wine and spirits, and food market segments; architectural, commercial sign, digital printing, and other related market segments; construction, automotive, and fleet transportation market segments, as well as traffic and safety applications; and sign shops, commercial printers, and designers. The company's Retail Branding and Information Solutions segment designs, manufactures, and sells brand embellishments, graphic tickets, tags and labels, and sustainable packaging solutions, as well as offers creative services; item-level radio-frequency identification solutions; visibility and loss prevention solutions; price ticketing and marking solutions; care, content, and country of origin compliance solutions; and brand protection and security solutions. It serves retailers, brand owners, apparel manufacturers, distributors, and industrial customers. The company's Industrial and Healthcare Materials segment offers tapes; pressure-sensitive adhesive based materials and converted products; medical fasteners; and performance polymers under the Fasson, Avery Dennison, and Yongle brands. It serves automotive, electronics, building and construction, general industrial, personal care, and medical markets. The company was formerly known as Avery International Corporation and changed its name to Avery Dennison Corporation in 1990. Avery Dennison Corporation was founded in 1935 and is headquartered in Glendale, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Business Equipment & Supplies", "Address": "207 Goode Avenue, Glendale, CA, United States, 91203", "FullTimeEmployees": "28250", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "9863563264", "EBITDA": "945600000", "PERatio": "18.8782", "PEGRatio": "5.4056", "BookValue": "14.547", "DividendPerShare": "2.32", "DividendYield": "0.02", "EPS": "6.141", "RevenuePerShareTTM": "81.218", "ProfitMargin": "0.0768", "OperatingMarginTTM": "0.1148", "ReturnOnAssetsTTM": "0.0882", "ReturnOnEquityTTM": "0.4577", "RevenueTTM": "6785800192", "GrossProfitTTM": "1904100000", "DilutedEPSTTM": "6.141", "QuarterlyEarningsGrowthYOY": "-0.438", "QuarterlyRevenueGrowthYOY": "-0.149", "AnalystTargetPrice": "128.55", "TrailingPE": "18.8782", "ForwardPE": "19.9601", "PriceToSalesRatioTTM": "1.4532", "PriceToBookRatio": "7.9956", "EVToRevenue": "1.7256", "EVToEBITDA": "13.1213", "Beta": "1.1599", "52WeekHigh": "141.09", "52WeekLow": "88.01", "50DayMovingAverage": "116.652", "200DayMovingAverage": "113.194", "SharesOutstanding": "83462200", "SharesFloat": "82914643", "SharesShort": "872260", "SharesShortPriorMonth": "761494", "ShortRatio": "1.46", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0119", "PercentInsiders": "0.677", "PercentInstitutions": "92.056", "ForwardAnnualDividendRate": "2.32", "ForwardAnnualDividendYield": "0.02", "PayoutRatio": "0.3766", "DividendDate": "2020-09-16", "ExDividendDate": "2020-09-01", "LastSplitFactor": "2:1", "LastSplitDate": "1996-12-23"}