{"Symbol": "BDX", "AssetType": "Common Stock", "Name": "Becton, Dickinson and Company", "Description": "Becton, Dickinson and Company develops, manufactures, and sells medical supplies, devices, laboratory equipment, and diagnostic products worldwide. The company's BD Medical segment offers peripheral IV and advanced peripheral catheters, central lines, acute dialysis catheters, vascular care and preparation products, needle-free IV connectors and extensions sets, IV fluids, closed-system drug transfer devices, hazardous drug detection, hypodermic syringes and needles, anesthesia needles and trays, enteral syringes, sharps disposal systems; infusion pumps and dedicated disposables, medication compounding workflow systems, automated medication dispensing, automated supply management systems, medication inventory optimization and tracking systems; syringes, pen needles, and other products for diabetes care; and prefillable drug delivery systems. Its BD Life Sciences segment provides specimen and blood collection products and systems; automated blood and tuberculosis culturing, molecular testing, microorganism identification and drug susceptibility, and liquid-based cytology systems, as well as rapid diagnostic assays, microbiology laboratory automation products, and plated media products; and fluorescence-activated cell sorters and analyzers, antibodies and kits, reagent systems, and solutions for high-throughput single-cell gene expression analysis, as well as clinical oncology, immunological, and transplantation diagnostic/monitoring reagents and analyzers. The company's BD Interventional segment offers hernia and soft tissue repair, biological and bioresorbable grafts, biosurgery, and other surgical products; surgical infection prevention, surgical and laparoscopic instrumentation products; peripheral intervention products; and urology and critical care products. It has a strategic partnership with the Biomedical Advanced Research and Development Authority to develop new manufacturing lines for injection devices. Becton, Dickinson and Company was founded in 1897 and is based in Franklin Lakes, New Jersey.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "1 Becton Drive, Franklin Lakes, NJ, United States, 07417", "FullTimeEmployees": "65000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "70380191744", "EBITDA": "4569999872", "PERatio": "87.1272", "PEGRatio": "2.6602", "BookValue": "82.865", "DividendPerShare": "3.16", "DividendYield": "0.0128", "EPS": "2.835", "RevenuePerShareTTM": "61.737", "ProfitMargin": "0.0537", "OperatingMarginTTM": "0.1428", "ReturnOnAssetsTTM": "0.0284", "ReturnOnEquityTTM": "0.0399", "RevenueTTM": "16917000192", "GrossProfitTTM": "8288000000", "DilutedEPSTTM": "2.835", "QuarterlyEarningsGrowthYOY": "-0.358", "QuarterlyRevenueGrowthYOY": "-0.114", "AnalystTargetPrice": "284.31", "TrailingPE": "87.1272", "ForwardPE": "18.9753", "PriceToSalesRatioTTM": "4.0492", "PriceToBookRatio": "2.9756", "EVToRevenue": "5.1598", "EVToEBITDA": "24.6579", "Beta": "0.9819", "52WeekHigh": "286.72", "52WeekLow": "197.75", "50DayMovingAverage": "264.6175", "200DayMovingAverage": "249.0977", "SharesOutstanding": "289868992", "SharesFloat": "289117791", "SharesShort": "2319870", "SharesShortPriorMonth": "2319211", "ShortRatio": "1.82", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0092", "PercentInsiders": "0.167", "PercentInstitutions": "89.531", "ForwardAnnualDividendRate": "3.16", "ForwardAnnualDividendYield": "0.0128", "PayoutRatio": "1.1095", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-08", "LastSplitFactor": "2:1", "LastSplitDate": "1998-08-21"}