{"Symbol": "BIO", "AssetType": "Common Stock", "Name": "Bio-Rad Laboratories, Inc", "Description": "Bio-Rad Laboratories, Inc. develops, manufactures, and markets products and solutions for the life science research and clinical diagnostic markets in Europe, the United States, Canada, and Latin America. The company offers products and systems to separate complex chemical and biological materials, as well as to identify, analyze, and purify components. It operates in two segments, Life Science and Clinical Diagnostics. The Life Science segment develops, manufactures, and markets a range of reagents, apparatus, and laboratory instruments that are used in research techniques, biopharmaceutical production processes, and food testing regimes. It focuses on selected segments of the life sciences market in proteomics, genomics, biopharmaceutical production, cell biology, and food safety. This segment serves universities and medical schools, industrial research organizations, government agencies, pharmaceutical manufacturers, biotechnology researchers, food producers, and food testing laboratories. The Clinical Diagnostics segment designs, manufactures, sells, and supports test systems, informatics systems, test kits, and specialized quality controls for clinical laboratories in the diagnostics market. This segment offers reagents, instruments, and software, which address specific niches within the in vitro diagnostics test market. It sells its products to reference laboratories, hospital laboratories, state newborn screening facilities, physicians' office laboratories, transfusion laboratories, and insurance and forensic testing laboratories. The company offers its products through its direct sales force, as well as through distributors, agents, brokers, and resellers. Bio-Rad Laboratories, Inc. was founded in 1952 and is headquartered in Hercules, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "1000 Alfred Nobel Drive, Hercules, CA, United States, 94547", "FullTimeEmployees": "8000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14919705600", "EBITDA": "408980000", "PERatio": "7.7066", "PEGRatio": "5.42", "BookValue": "247.77", "DividendPerShare": "None", "DividendYield": "0", "EPS": "64.502", "RevenuePerShareTTM": "76.917", "ProfitMargin": "0.8489", "OperatingMarginTTM": "0.1188", "ReturnOnAssetsTTM": "0.0192", "ReturnOnEquityTTM": "0.3033", "RevenueTTM": "2293584896", "GrossProfitTTM": "1261396000", "DilutedEPSTTM": "64.502", "QuarterlyEarningsGrowthYOY": "0.619", "QuarterlyRevenueGrowthYOY": "-0.062", "AnalystTargetPrice": "603.75", "TrailingPE": "7.7066", "ForwardPE": "0", "PriceToSalesRatioTTM": "6.5432", "PriceToBookRatio": "2.0065", "EVToRevenue": "6.3146", "EVToEBITDA": "5.4279", "Beta": "1.1143", "52WeekHigh": "536.44", "52WeekLow": "309.3801", "50DayMovingAverage": "512.9484", "200DayMovingAverage": "441.1739", "SharesOutstanding": "24586400", "SharesFloat": "21205200", "SharesShort": "502821", "SharesShortPriorMonth": "576427", "ShortRatio": "2.95", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0235", "PercentInsiders": "14.286", "PercentInstitutions": "79.148", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2002-03-08"}