{"Symbol": "BA", "AssetType": "Common Stock", "Name": "The Boeing Company", "Description": "The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sales, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through four segments: Commercial Airplanes; Defense, Space & Security; Global Services; and Boeing Capital. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft and provides fleet support services principally to the commercial airline industry. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems for strike, surveillance, and mobility, including fighter and trainer aircraft; vertical lift comprising rotorcraft and tilt-rotor aircraft; commercial derivative aircraft, such as anti-submarine and tanker aircraft; strategic defense and intelligence systems consisting of strategic missile and defense systems, cyber and information solutions, and intelligence systems, as well as command, control, communications, computers, intelligence, surveillance, and reconnaissance products; satellite systems, including government and commercial satellites, and space exploration. The Global Services segment offers various products and services comprising supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Capital segment offers financing services and manages financing exposure for a portfolio of equipment under operating and finance leases, notes and other receivables, assets held for sale or re-lease, and investments. The Boeing Company was founded in 1916 and is based in Chicago, Illinois.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "100 North Riverside Plaza, Chicago, IL, United States, 60606-1596", "FullTimeEmployees": "161100", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "99230138368", "EBITDA": "6560000000", "PERatio": "49.0769", "PEGRatio": "6.5305", "BookValue": "-9.458", "DividendPerShare": "8.22", "DividendYield": "0.0553", "EPS": "6.644", "RevenuePerShareTTM": "117.73", "ProfitMargin": "-0.0427", "OperatingMarginTTM": "-0.0502", "ReturnOnAssetsTTM": "-0.0144", "ReturnOnEquityTTM": "0", "RevenueTTM": "66605998080", "GrossProfitTTM": "4759000000", "DilutedEPSTTM": "-5.032", "QuarterlyEarningsGrowthYOY": "-0.496", "QuarterlyRevenueGrowthYOY": "-0.25", "AnalystTargetPrice": "173.5", "TrailingPE": "0", "ForwardPE": "44.4444", "PriceToSalesRatioTTM": "1.4782", "PriceToBookRatio": "0", "EVToRevenue": "1.9109", "EVToEBITDA": "129.4121", "Beta": "1.3786", "52WeekHigh": "391", "52WeekLow": "89", "50DayMovingAverage": "173.3758", "200DayMovingAverage": "179.6321", "SharesOutstanding": "564324992", "SharesFloat": "532958143", "SharesShort": "8047599", "SharesShortPriorMonth": "11037942", "ShortRatio": "0.23", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0143", "PercentInsiders": "0.132", "PercentInstitutions": "66.604", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0.0553", "PayoutRatio": "0", "DividendDate": "2020-03-06", "ExDividendDate": "2020-02-13", "LastSplitFactor": "2:1", "LastSplitDate": "1997-06-09"}