{"Symbol": "BSX", "AssetType": "Common Stock", "Name": "Boston Scientific Corporation", "Description": "Boston Scientific Corporation develops, manufactures, and markets medical devices for use in various interventional medical specialties worldwide. It operates through three segments: MedSurg, Rhythm and Neuro, and Cardiovascular. The company offers devices to diagnose and treat gastrointestinal and pulmonary conditions; devices to treat various urological and pelvic conditions; implantable cardioverter and implantable cardiac resynchronization therapy defibrillators; pacemakers and implantable cardiac resynchronization therapy pacemakers; and remote patient management systems. It also provides medical technologies to diagnose and treat rate and rhythm disorders of the heart comprising 3-D cardiac mapping and navigation solutions, ablation catheters, diagnostic catheters, mapping catheters, intracardiac ultrasound catheters, delivery sheaths, and other accessories; spinal cord stimulator systems for the management of chronic pain; indirect decompression systems; and deep brain stimulation systems. In addition, the company offers interventional cardiology products, including drug-eluting coronary stent systems used in the treatment of coronary artery disease; percutaneous coronary interventions products to treat atherosclerosis; intravascular catheter-directed ultrasound imaging catheters, fractional flow reserve devices, and systems for use in coronary arteries and heart chambers, as well as various peripheral vessels; and structural heart therapies. Further, it provides stents, balloon catheters, wires, atherectomy systems to treat arterial diseases; thrombectomy and acoustic pulse thrombolysis systems, wires, and stents to treat venous diseases; and peripheral embolization devices, radioactive microspheres, ablation systems, and micro and drainage catheters to treat cancer. The company was founded in 1979 and is headquartered in Marlborough, Massachusetts.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "300 Boston Scientific Way, Marlborough, MA, United States, 01752-1234", "FullTimeEmployees": "36000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "58700386304", "EBITDA": "2232999936", "PERatio": "14.461", "PEGRatio": "2.16", "BookValue": "10.926", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.825", "RevenuePerShareTTM": "7.261", "ProfitMargin": "0.3923", "OperatingMarginTTM": "0.1115", "ReturnOnAssetsTTM": "0.0257", "ReturnOnEquityTTM": "0.3183", "RevenueTTM": "10156999680", "GrossProfitTTM": "7632000000", "DilutedEPSTTM": "2.825", "QuarterlyEarningsGrowthYOY": "-0.974", "QuarterlyRevenueGrowthYOY": "-0.239", "AnalystTargetPrice": "46.23", "TrailingPE": "14.461", "ForwardPE": "39.2157", "PriceToSalesRatioTTM": "5.6547", "PriceToBookRatio": "3.7361", "EVToRevenue": "6.5387", "EVToEBITDA": "57.4515", "Beta": "0.9462", "52WeekHigh": "46.13", "52WeekLow": "24.1", "50DayMovingAverage": "38.3636", "200DayMovingAverage": "36.4303", "SharesOutstanding": "1430669952", "SharesFloat": "1425867601", "SharesShort": "16465834", "SharesShortPriorMonth": "14887215", "ShortRatio": "2.15", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0115", "PercentInsiders": "0.243", "PercentInstitutions": "95.348", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2003-11-06"}