{"Symbol": "BMY", "AssetType": "Common Stock", "Name": "Bristol-Myers Squibb Company", "Description": "Bristol-Myers Squibb Company discovers, develops, licenses, manufactures, markets, distributes, and sells biopharmaceutical products worldwide. It offers products in the following therapeutic classes: hematology, oncology, cardiovascular, and immunology. The company's products include Opdivo, a biological product for anti-cancer indications; Eliquis, an oral inhibitor targeted at stroke prevention in adult patients with non-valvular atrial fibrillation, and the prevention and treatment of venous thromboembolic disorders; and Orencia, a biological product for adult patients with active RA and prostate-specific antigen, as well as reducing signs and symptoms in pediatric patients with active polyarticular juvenile idiopathic arthritis. It also provides Sprycel, a tyrosine kinase inhibitor for the treatment of Philadelphia chromosome-positive chronic myeloid leukemia; Yervoy, a monoclonal antibody for the treatment of patients with unresectable or metastatic melanoma; Empliciti, a humanized monoclonal antibody for the treatment of multiple myeloma; and Baraclude, an oral antiviral agent for the treatment of chronic hepatitis B. In addition, it offers Reyataz, a protease inhibitor for the treatment of human immunodeficiency virus (HIV); Sustiva franchise, a non-nucleoside reverse transcriptase inhibitor for the treatment of HIV; and Daklinza NS5A replication complex inhibitor, Sunvepra NS3 protease inhibitor, and Beclabuvir NS5B inhibitor. It sells products to wholesalers, retail pharmacies, hospitals, government entities, and medical profession. The company has collaboration agreements with Pfizer, Otsuka, Ono, Nektar, GRYT Health, and Ubiquigent Limited; clinical collaboration agreement with NeoImmuneTech, Inc.; and partnership with Astrazeneca Plc. The company was formerly known as Bristol-Myers Company and changed its name to Bristol-Myers Squibb Company in 1989. Bristol-Myers Squibb Company was founded in 1887 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "430 East 29th Street, New York, NY, United States, 10016", "FullTimeEmployees": "30000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "140577603584", "EBITDA": "14003999744", "PERatio": "93.8095", "PEGRatio": "1.0493", "BookValue": "21.781", "DividendPerShare": "1.8", "DividendYield": "0.0288", "EPS": "0.513", "RevenuePerShareTTM": "17.276", "ProfitMargin": "-0.0162", "OperatingMarginTTM": "0.2169", "ReturnOnAssetsTTM": "0.0516", "ReturnOnEquityTTM": "-0.0165", "RevenueTTM": "34861998080", "GrossProfitTTM": "18925000000", "DilutedEPSTTM": "-0.279", "QuarterlyEarningsGrowthYOY": "-0.285", "QuarterlyRevenueGrowthYOY": "0.615", "AnalystTargetPrice": "73.25", "TrailingPE": "93.8095", "ForwardPE": "10.1112", "PriceToSalesRatioTTM": "3.6292", "PriceToBookRatio": "2.8699", "EVToRevenue": "4.7791", "EVToEBITDA": "16.3472", "Beta": "0.6989", "52WeekHigh": "68.34", "52WeekLow": "45.76", "50DayMovingAverage": "60.6964", "200DayMovingAverage": "59.5734", "SharesOutstanding": "2253929984", "SharesFloat": "2250936902", "SharesShort": "14453167", "SharesShortPriorMonth": "22889934", "ShortRatio": "1.45", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0064", "PercentInsiders": "0.111", "PercentInstitutions": "79.093", "ForwardAnnualDividendRate": "1.8", "ForwardAnnualDividendYield": "0.0288", "PayoutRatio": "2.7302", "DividendDate": "2020-08-03", "ExDividendDate": "2020-07-02", "LastSplitFactor": "1000000:95", "LastSplitDate": "2001-08-07"}