{"Symbol": "CAH", "AssetType": "Common Stock", "Name": "Cardinal Health, Inc", "Description": "Cardinal Health, Inc. operates as an integrated healthcare services and products company in the United States and internationally. It provides customized solutions for hospitals, healthcare systems, pharmacies, ambulatory surgery centers, clinical laboratories, and physician offices. The company operates through two segments, Pharmaceutical and Medical. The Pharmaceutical segment distributes branded and generic pharmaceutical, specialty pharmaceutical, and over-the-counter healthcare and consumer products. It also provides services to pharmaceutical manufacturers and healthcare providers for specialty pharmaceutical products; operates nuclear pharmacies and radiopharmaceutical manufacturing facilities; and offers pharmacy management services to hospitals, as well as medication therapy management and patient outcomes services to hospitals, other healthcare providers, and payers. In addition, this segment repackages generic pharmaceuticals and over-the-counter healthcare products. The Medical segment manufactures, sources, and distributes Cardinal Health branded medical, surgical, and laboratory products. It also provides incontinence, nutritional delivery, wound care, cardiovascular, and endovascular products; single-use surgical drapes, gowns and apparel, and fluid suction and collection systems; urology products; operating room supplies; and electrode products. In addition, this segment distributes a range of national brand products, including medical, surgical, and laboratory products; and provides supply chain services and solutions to hospitals, ambulatory surgery centers, clinical laboratories, and other healthcare providers. Cardinal Health, Inc. was founded in 1979 and is headquartered in Dublin, Ohio.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Distribution", "Address": "7000 Cardinal Place, Dublin, OH, United States, 43017", "FullTimeEmployees": "48000", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14768421888", "EBITDA": "2692000000", "PERatio": "11.8653", "PEGRatio": "4.9365", "BookValue": "6.106", "DividendPerShare": "1.94", "DividendYield": "0.0384", "EPS": "4.53", "RevenuePerShareTTM": "521.918", "ProfitMargin": "-0.0242", "OperatingMarginTTM": "0.0116", "ReturnOnAssetsTTM": "0.0272", "ReturnOnEquityTTM": "-0.9094", "RevenueTTM": "152921997312", "GrossProfitTTM": "6868000000", "DilutedEPSTTM": "-12.614", "QuarterlyEarningsGrowthYOY": "2.477", "QuarterlyRevenueGrowthYOY": "-0.018", "AnalystTargetPrice": "58.81", "TrailingPE": "0", "ForwardPE": "9.2336", "PriceToSalesRatioTTM": "0.0971", "PriceToBookRatio": "8.2829", "EVToRevenue": "0.1231", "EVToEBITDA": "7.5872", "Beta": "0.9967", "52WeekHigh": "60.69", "52WeekLow": "40.9693", "50DayMovingAverage": "53.4197", "200DayMovingAverage": "51.8915", "SharesOutstanding": "292444000", "SharesFloat": "291827022", "SharesShort": "4246985", "SharesShortPriorMonth": "5095925", "ShortRatio": "1.88", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0165", "PercentInsiders": "0.155", "PercentInstitutions": "91.508", "ForwardAnnualDividendRate": "1.94", "ForwardAnnualDividendYield": "0.0384", "PayoutRatio": "0", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-30", "LastSplitFactor": "3:2", "LastSplitDate": "2001-04-23"}