{"Symbol": "CNC", "AssetType": "Common Stock", "Name": "Centene Corporation", "Description": "Centene Corporation operates as a multi-national healthcare enterprise that provides programs and services to under-insured and uninsured individuals in the United States. Its Managed Care segment offers health plan coverage to individuals through government subsidized programs, including Medicaid, the State children's health insurance program, long-term services and support, foster care, and medicare-medicaid plans, which cover dually eligible individuals, as well as aged, blind, or disabled programs. Its health plans include primary and specialty physician care, inpatient and outpatient hospital care, emergency and urgent care, prenatal care, laboratory and X-ray, home-based primary care, transportation assistance, vision care, dental care, telehealth, immunization, specialty pharmacy, therapy, social work, nurse advisory, and care coordination services, as well as prescriptions and limited over-the-counter drugs, medical equipment, and behavioral health and abuse services. This segment also offers various individual, small group, and large group commercial healthcare products to employers and directly to members in the Managed Care segment. The company's Specialty Services segment provides pharmacy benefits management services; health, triage, wellness, and disease management services; and vision and dental, and management services, as well as care management software that automate the clinical, administrative, and technical components of care management programs; staffing services; and services to Military Health System eligible beneficiaries. This segment offers its services and products to state programs, correctional facilities, healthcare organizations, employer groups, and other commercial organizations. The company provides its services through primary and specialty care physicians, hospitals, and ancillary providers. Centene Corporation was founded in 1984 and is headquartered in St. Louis, Missouri.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Healthcare Plans", "Address": "Centene Plaza, St. Louis, MO, United States, 63105", "FullTimeEmployees": "56600", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "35046346752", "EBITDA": "4745999872", "PERatio": "20.3356", "PEGRatio": "0.946", "BookValue": "43.249", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.144", "RevenuePerShareTTM": "177.368", "ProfitMargin": "0.018", "OperatingMarginTTM": "0.0439", "ReturnOnAssetsTTM": "0.0462", "ReturnOnEquityTTM": "0.0825", "RevenueTTM": "86507003904", "GrossProfitTTM": "11929000000", "DilutedEPSTTM": "3.144", "QuarterlyEarningsGrowthYOY": "0.737", "QuarterlyRevenueGrowthYOY": "0.484", "AnalystTargetPrice": "85.34", "TrailingPE": "20.3356", "ForwardPE": "12.1212", "PriceToSalesRatioTTM": "0.3212", "PriceToBookRatio": "1.3733", "EVToRevenue": "0.4026", "EVToEBITDA": "9.1323", "Beta": "0.7313", "52WeekHigh": "74.7", "52WeekLow": "41.6246", "50DayMovingAverage": "64.09", "200DayMovingAverage": "63.0911", "SharesOutstanding": "579470016", "SharesFloat": "568824684", "SharesShort": "9809734", "SharesShortPriorMonth": "10124956", "ShortRatio": "3.4", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0192", "PercentInsiders": "1.899", "PercentInstitutions": "81.163", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2019-02-07"}