{"Symbol": "CNP", "AssetType": "Common Stock", "Name": "CenterPoint Energy, Inc", "Description": "CenterPoint Energy, Inc. operates as a public utility holding company in the United States. The company's Houston Electric T&D segment electric transmission and distribution services to electric utility. It owns 236 substation sites with a total installed rated transformer capacity of 68,053 megavolt amperes. Its Indiana Electric Integrated segment provides energy delivery services to electric customers and electric generation assets to electric customers and wholesale markets. The company's Natural Gas Distribution segment sells regulated intrastate natural gas; provides natural gas transportation and storage services for residential, commercial, industrial, and transportation customers; and offers unregulated services comprising home appliance maintenance and repair services. This segment owns approximately 98,000 linear miles of natural gas distribution mains. Its Energy Services segment provides physical natural gas supplies primarily to commercial and industrial customers, and electric and natural gas utilities; natural gas management services; and physical delivery services, as well as procures and optimizes transportation and storage assets. It owns and operates 210 miles of intrastate pipeline in Louisiana and Texas; and leases transportation capacity on various interstate and intrastate pipelines, and storage. The company's Infrastructure Services segment offers underground pipeline construction and repair services. Its Midstream Investment segment offers natural gas and crude oil gathering, and natural gas processing services to its producer customers; and interstate and intrastate natural gas pipeline transportation and storage services to its producer, power plant, local distribution company, and industrial end-user customers. As of March 2, 2020, it served approximately 7 million electric and natural gas metered customers. CenterPoint Energy, Inc. was founded in 1866 and is headquartered in Houston, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Utilities", "Industry": "UtilitiesRegulated Gas", "Address": "1111 Louisiana Street, Houston, TX, United States, 77002", "FullTimeEmployees": "14262", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "10869139456", "EBITDA": "2895000064", "PERatio": "12.8045", "PEGRatio": "13.413", "BookValue": "10.925", "DividendPerShare": "0.6", "DividendYield": "0.0304", "EPS": "1.261", "RevenuePerShareTTM": "23.895", "ProfitMargin": "-0.0549", "OperatingMarginTTM": "0.1327", "ReturnOnAssetsTTM": "0.0304", "ReturnOnEquityTTM": "-0.0506", "RevenueTTM": "12156000256", "GrossProfitTTM": "3321000000", "DilutedEPSTTM": "-1.584", "QuarterlyEarningsGrowthYOY": "-0.658", "QuarterlyRevenueGrowthYOY": "-0.05", "AnalystTargetPrice": "20.87", "TrailingPE": "12.8045", "ForwardPE": "15.5521", "PriceToSalesRatioTTM": "0.8298", "PriceToBookRatio": "1.809", "EVToRevenue": "2.0707", "EVToEBITDA": "21.224", "Beta": "0.9549", "52WeekHigh": "30.71", "52WeekLow": "11.58", "50DayMovingAverage": "19.8014", "200DayMovingAverage": "18.6933", "SharesOutstanding": "544819008", "SharesFloat": "543238999", "SharesShort": "18518408", "SharesShortPriorMonth": "22003146", "ShortRatio": "2.66", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0382", "PercentInsiders": "0.208", "PercentInstitutions": "88.761", "ForwardAnnualDividendRate": "0.6", "ForwardAnnualDividendYield": "0.0304", "PayoutRatio": "0.8647", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-19", "LastSplitFactor": "1000:843", "LastSplitDate": "2002-10-01"}