{"Symbol": "CHTR", "AssetType": "Common Stock", "Name": "Charter Communications, Inc", "Description": "Charter Communications, Inc., through its subsidiaries, provides cable services to residential and commercial customers in the United States. It offers subscription-based video services, including video on demand, high definition television, digital video recorder, pay-per-view, and spectrum mobile and spectrum guide services, as well as ad-supported free online video products. The company also provides Internet services, such as security suite that protects computers from viruses and spyware; in-home WiFi, which provides customers with high performance wireless routers to enhance their in-home wireless Internet experience; out-of-home WiFi; and Spectrum WiFi. In addition, it offers voice communications services using voice over Internet protocol technology; and broadband communications solutions, such as Internet access, data networking, fiber connectivity, video entertainment, and business telephone services to cellular towers and office buildings for business and carrier organizations. Further, the company provides video programming, static IP and business WiFi, email and security, and multi-line telephone services, as well as Web-based service management; sells local advertising across various platforms for networks, such as MTV, CNN, and ESPN; Audience App for optimizes linear inventory; and sells video and online advertising inventory to local, regional, and national advertising customers. Additionally, it offers communications products and managed service solutions; data connectivity services to mobile and wireline carriers on a wholesale basis; and owns and operates regional sports networks and local sports, news, and community channels. As of December 31, 2019, the company served approximately 29.2 million residential and small and medium business customers. Charter Communications, Inc. was founded in 1993 and is based in Stamford, Connecticut.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Entertainment", "Address": "400 Atlantic Street, Stamford, CT, United States, 06901", "FullTimeEmployees": "95100", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "126144028672", "EBITDA": "17105999872", "PERatio": "58.8965", "PEGRatio": "1.2322", "BookValue": "127.138", "DividendPerShare": "None", "DividendYield": "0", "EPS": "10.455", "RevenuePerShareTTM": "220.903", "ProfitMargin": "0.0485", "OperatingMarginTTM": "0.1566", "ReturnOnAssetsTTM": "0.0314", "ReturnOnEquityTTM": "0.0662", "RevenueTTM": "46644998144", "GrossProfitTTM": "28680000000", "DilutedEPSTTM": "10.455", "QuarterlyEarningsGrowthYOY": "1.612", "QuarterlyRevenueGrowthYOY": "0.031", "AnalystTargetPrice": "630.23", "TrailingPE": "58.8965", "ForwardPE": "50.5051", "PriceToSalesRatioTTM": "2.8501", "PriceToBookRatio": "4.2876", "EVToRevenue": "4.3384", "EVToEBITDA": "12.0972", "Beta": "1.0549", "52WeekHigh": "621.04", "52WeekLow": "345.67", "50DayMovingAverage": "584.7589", "200DayMovingAverage": "519.5483", "SharesOutstanding": "234196000", "SharesFloat": "147729293", "SharesShort": "7972678", "SharesShortPriorMonth": "8866623", "ShortRatio": "9.7", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0699", "PercentInsiders": "27.046", "PercentInstitutions": "65.629", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "0:1", "LastSplitDate": "2016-05-18"}