{"Symbol": "CTSH", "AssetType": "Common Stock", "Name": "Cognizant Technology Solutions Corporation", "Description": "Cognizant Technology Solutions Corporation, a professional services company, provides consulting and technology, and outsourcing services in North America, Europe, and internationally. The company operates through four segments: Financial Services; Healthcare; Products and Resources; and Communications, Media and Technology. It offers analytics and artificial intelligence, digital engineering, Internet of Things, interactive, and cloud services and solutions; and application development, systems integration, application testing and maintenance, infrastructure, and business process services. The company also develops, licenses, implements, and supports proprietary and third-party software products and platforms for the healthcare industry. In addition, it offers revenue cycle management solutions to the healthcare industry; business advisory and data analytics services; and salesforce services. Further, the company develops custom cloud-based software and platforms; and provides consulting services that enable companies to plan, implement, and optimize automated cloud-based business processes and technologies. It serves banking and insurance, healthcare and life sciences, retail and consumer goods, manufacturing, logistics, travel and hospitality, energy and utilities, communications and media, and technology industries. The company markets and sells its services through professional staff, senior management, and direct sales personnel. Cognizant Technology Solutions Corporation has collaboration with Verily Life Sciences to facilitate COVID-19 testing across the United States. Cognizant Technology Solutions Corporation was founded in 1994 and is headquartered in Teaneck, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "Glenpointe Centre West, Teaneck, NJ, United States, 07666", "FullTimeEmployees": "281200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "36704296960", "EBITDA": "3294000128", "PERatio": "22.6149", "PEGRatio": "2.6081", "BookValue": "20.244", "DividendPerShare": "0.88", "DividendYield": "0.013", "EPS": "2.961", "RevenuePerShareTTM": "30.69", "ProfitMargin": "0.0967", "OperatingMarginTTM": "0.1663", "ReturnOnAssetsTTM": "0.1033", "ReturnOnEquityTTM": "0.1505", "RevenueTTM": "16757000192", "GrossProfitTTM": "6149000000", "DilutedEPSTTM": "2.961", "QuarterlyEarningsGrowthYOY": "-0.259", "QuarterlyRevenueGrowthYOY": "-0.034", "AnalystTargetPrice": "69.02", "TrailingPE": "22.6149", "ForwardPE": "18.8679", "PriceToSalesRatioTTM": "2.1851", "PriceToBookRatio": "3.3082", "EVToRevenue": "2.0996", "EVToEBITDA": "12.3448", "Beta": "1.211", "52WeekHigh": "71.48", "52WeekLow": "40.01", "50DayMovingAverage": "64.7881", "200DayMovingAverage": "57.4909", "SharesOutstanding": "542241024", "SharesFloat": "540348322", "SharesShort": "12123783", "SharesShortPriorMonth": "12023678", "ShortRatio": "2.84", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0159", "PercentInsiders": "0.242", "PercentInstitutions": "95.095", "ForwardAnnualDividendRate": "0.88", "ForwardAnnualDividendYield": "0.013", "PayoutRatio": "0.2838", "DividendDate": "2020-08-31", "ExDividendDate": "2020-08-20", "LastSplitFactor": "2:1", "LastSplitDate": "2014-03-10"}