{"Symbol": "COTY", "AssetType": "Common Stock", "Name": "Coty Inc", "Description": "Coty Inc., together with its subsidiaries, manufactures, markets, distributes, and sells beauty products worldwide. The company operates in three segments: Luxury, Consumer Beauty, and Professional Beauty. The Luxury segment offers prestige fragrances, and skincare and cosmetics products through various retailers, including perfumeries, department stores, and e-retailers and duty-free shops under the Alexander McQueen, Balenciaga, Burberry, Bottega Veneta, Calvin Klein, Cavalli, Chloe, Davidoff, Escada, Gucci, Hugo Boss, Jil Sander, Joop!, Lacoste, Lancaster, Marc Jacobs, Miu Miu, philosophy, Stella McCartney, and Tiffany & Co. brands. The Consumer Beauty segment offers color cosmetics, retail hair coloring and styling products, mass fragrance, and body care and mass skin care products primarily through hypermarkets, supermarkets, drug stores, pharmacies, mid-tier department stores, traditional food and drug retailers, and e-commerce retailers. It provides its products under the Adidas, Beckham, Beyonce, Biocolor, Bozzano, Bourjois, Bruno Banani, Clairol, CoverGirl, Enrique, Jovan, Nautica, Max Factor, Mexx, Monange, Paixao, Rimmel, Risque, Sally Hansen, Stetson, Wella, Younique, and 007 James Bond brands. The Professional Beauty segment offers hair and nail care products to nail and hair salons, nail and hair professionals, and professional stores through direct sales forces and e-commerce platforms under the Clairol Professional, ghd, Kadus Professional, Londa Professional, Nioxin, O P I, Sassoon Professional, Sebastian, System Professional, and Wella Professionals brands. The company also sells its products to third-party distributors. It sells its products to approximately 150 countries. The company was founded in 1904 and is based in New York, New York. Coty Inc. operates as a subsidiary of Cottage Holdco B.V.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Household & Personal Products", "Address": "350 Fifth Avenue, New York, NY, United States, 10118", "FullTimeEmployees": "19000", "FiscalYearEnd": "June", "LatestQuarter": "2020-03-31", "MarketCapitalization": "2831082496", "EBITDA": "1135800064", "PERatio": "None", "PEGRatio": "1.6802", "BookValue": "4.891", "DividendPerShare": "0.5", "DividendYield": "0.1155", "EPS": "-5.04", "RevenuePerShareTTM": "10.489", "ProfitMargin": "-0.3833", "OperatingMarginTTM": "0.0507", "ReturnOnAssetsTTM": "0.0129", "ReturnOnEquityTTM": "-0.5034", "RevenueTTM": "7931200000", "GrossProfitTTM": "5351400000", "DilutedEPSTTM": "-4.026", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.232", "AnalystTargetPrice": "5.47", "TrailingPE": "0", "ForwardPE": "10.8932", "PriceToSalesRatioTTM": "0.3375", "PriceToBookRatio": "0.7238", "EVToRevenue": "1.4266", "EVToEBITDA": "0", "Beta": "0.9687", "52WeekHigh": "13.42", "52WeekLow": "3.02", "50DayMovingAverage": "4.0058", "200DayMovingAverage": "5.4499", "SharesOutstanding": "763094976", "SharesFloat": "284160418", "SharesShort": "18099485", "SharesShortPriorMonth": "19216660", "ShortRatio": "2.05", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0635", "PercentInsiders": "63.202", "PercentInstitutions": "40.021", "ForwardAnnualDividendRate": "0.5", "ForwardAnnualDividendYield": "0.1155", "PayoutRatio": "0", "DividendDate": "2020-03-27", "ExDividendDate": "2020-02-14", "LastSplitFactor": "None", "LastSplitDate": "None"}