{"Symbol": "CMI", "AssetType": "Common Stock", "Name": "Cummins Inc", "Description": "Cummins Inc. designs, manufactures, distributes, and services diesel and natural gas engines, products worldwide. It operates through five segments: Engine, Distribution, Components, Power Systems, and New Power. The company manufactures and markets diesel and natural gas powered engines under the Cummins and other customer brands for the heavy and medium-duty truck, bus, recreational vehicle, light-duty automotive, construction, mining, marine, rail, oil and gas, defense, and agricultural markets; and offers new parts and services, as well as remanufactured parts and engines. It distributes parts, engines, and power generation products; and provides service solutions, such as engineering services, custom-designed assemblies, and repair services. The company offers emission solutions; and turbochargers for light-duty, mid-range, heavy-duty, and high-horsepower diesel markets, as well as provides air and fuel filters, fuel water separators, lube and hydraulic filters, coolants, fuel additives, and other filtration systems; and fuel systems for heavy-duty on-highway diesel engine applications and remanufactures fuel systems. It also provides standby and prime power generators, controls, paralleling systems, and transfer switches, as well as A/C generator/alternator products under the Stamford and AVK brands; and provides electrified power systems with components and subsystems, including battery, fuel cell, and hydrogen production technologies. The company offers electric and hybrid powertrains related components including filtration, after treatment, controls systems, air handling systems, automated transmissions, electric power generation systems, and hydrogen generation products. It sells its products to original equipment manufacturers, distributors, dealers, and other customers. The company was formerly known as Cummins Engine Company and changed its name to Cummins Inc. in 2001. Cummins Inc. was founded in 1919 and is headquartered in Columbus, Indiana.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "500 Jackson Street, Columbus, IN, United States, 47202-3005", "FullTimeEmployees": "61600", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "30822934528", "EBITDA": "2558000128", "PERatio": "18.3779", "PEGRatio": "6.527", "BookValue": "48.734", "DividendPerShare": "5.24", "DividendYield": "0.0253", "EPS": "11.284", "RevenuePerShareTTM": "133.879", "ProfitMargin": "0.0846", "OperatingMarginTTM": "0.0926", "ReturnOnAssetsTTM": "0.0577", "ReturnOnEquityTTM": "0.1975", "RevenueTTM": "20209000448", "GrossProfitTTM": "5980000000", "DilutedEPSTTM": "11.284", "QuarterlyEarningsGrowthYOY": "-0.564", "QuarterlyRevenueGrowthYOY": "-0.381", "AnalystTargetPrice": "208.24", "TrailingPE": "18.3779", "ForwardPE": "24.8756", "PriceToSalesRatioTTM": "1.5573", "PriceToBookRatio": "4.2642", "EVToRevenue": "1.627", "EVToEBITDA": "11.2641", "Beta": "1.1769", "52WeekHigh": "215.43", "52WeekLow": "101.025", "50DayMovingAverage": "197.7822", "200DayMovingAverage": "166.6086", "SharesOutstanding": "147676000", "SharesFloat": "146895198", "SharesShort": "3695064", "SharesShortPriorMonth": "4404247", "ShortRatio": "3.44", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0251", "PercentInsiders": "0.334", "PercentInstitutions": "85.492", "ForwardAnnualDividendRate": "5.24", "ForwardAnnualDividendYield": "0.0253", "PayoutRatio": "0.4641", "DividendDate": "2020-09-03", "ExDividendDate": "2020-08-20", "LastSplitFactor": "2:1", "LastSplitDate": "2008-01-03"}