{"Symbol": "CVS", "AssetType": "Common Stock", "Name": "CVS Health Corporation", "Description": "CVS Health Corporation provides health services and plans in the United States. The company's Pharmacy Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, mail order pharmacy, specialty pharmacy and infusion, clinical, and disease and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans (PDPs), Medicaid managed care plans, plans offered on public health insurance and private health insurance exchanges, other sponsors of health benefit plans, and individuals. This segment operates retail specialty pharmacy stores; and specialty mail order, mail order dispensing, and compounding pharmacies, as well as branches for infusion and enteral nutrition services. Its Retail/LTC segment sells prescription and over-the-counter drugs, beauty and personal care products, and cosmetics; and provides health care services through its MinuteClinic walk-in medical clinics. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to chronic care facilities and other care settings. As of December 31, 2019, it operated approximately 9,900 retail locations and 1,100 MinuteClinic locations, as well as online retail pharmacy websites, LTC pharmacies, and onsite pharmacies. The company's Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. The company was founded in 1963 and is headquartered in Woonsocket, Rhode Island.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Healthcare Plans", "Address": "One CVS Drive, Woonsocket, RI, United States, 02895", "FullTimeEmployees": "290000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "82722930688", "EBITDA": "18255998976", "PERatio": "10.0779", "PEGRatio": "1.1297", "BookValue": "52.044", "DividendPerShare": "2", "DividendYield": "0.0316", "EPS": "6.293", "RevenuePerShareTTM": "201.517", "ProfitMargin": "0.0314", "OperatingMarginTTM": "0.0528", "ReturnOnAssetsTTM": "0.0382", "ReturnOnEquityTTM": "0.1273", "RevenueTTM": "262979993600", "GrossProfitTTM": "44517000000", "DilutedEPSTTM": "6.293", "QuarterlyEarningsGrowthYOY": "0.52", "QuarterlyRevenueGrowthYOY": "0.032", "AnalystTargetPrice": "80.04", "TrailingPE": "10.0779", "ForwardPE": "8.9445", "PriceToSalesRatioTTM": "0.3147", "PriceToBookRatio": "1.2196", "EVToRevenue": "0.5968", "EVToEBITDA": "8.4879", "Beta": "0.7033", "52WeekHigh": "76.44", "52WeekLow": "52.04", "50DayMovingAverage": "64.1264", "200DayMovingAverage": "63.1786", "SharesOutstanding": "1308700032", "SharesFloat": "1306059869", "SharesShort": "18389479", "SharesShortPriorMonth": "18395746", "ShortRatio": "2.78", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0141", "PercentInsiders": "0.192", "PercentInstitutions": "79.637", "ForwardAnnualDividendRate": "2", "ForwardAnnualDividendYield": "0.0316", "PayoutRatio": "0.318", "DividendDate": "2020-08-03", "ExDividendDate": "2020-07-22", "LastSplitFactor": "2:1", "LastSplitDate": "2005-06-07"}