{"Symbol": "DTE", "AssetType": "Common Stock", "Name": "DTE Energy Company", "Description": "DTE Energy Company engages in the utility operations. The company's Electric segment generates, purchases, distributes, and sells electricity to approximately 2.2 million residential, commercial, and industrial customers in southeastern Michigan. It generates electricity through fossil-fuel, hydroelectric pumped storage, and nuclear plants, as well as wind and other renewable assets. This segment owns and operates approximately 700 distribution substations and 445,200 line transformers. The company's Gas segment purchases, stores, transports, distributes, and sells natural gas to approximately 1.3 million residential, commercial, and industrial customers throughout Michigan; and sells storage and transportation capacity. This segment has approximately 20,000 miles of distribution mains; 1,305,000 service pipelines; and 1,285,000 active meters, as well as owns approximately 2,000 miles of transmission pipelines. Its Gas Storage and Pipelines segment owns natural gas storage fields, lateral and gathering pipeline systems, and compression and surface facilities, as well as has ownership interests in interstate pipelines serving the Gulf Coast, Midwest, Ontario, and northeast markets. The company's Power and Industrial Projects segment offers metallurgical coke; pulverized coal and petroleum coke to the steel, pulp and paper, and other industries; and power, steam and chilled water production, and wastewater treatment services, as well as supplies compressed air to industrial customers. It also owns and operates 5 renewable generating plants with a capacity of 217 MWs; 23 gas recovery sites; and 10 reduced emissions fuel facilities. Its Energy Trading segment engages in power, natural gas, and environmental marketing and trading; structured transactions; and the optimization of contracted natural gas pipeline transportation and storage positions. The company was founded in 1903 and is headquartered in Detroit, Michigan.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Utilities", "Industry": "UtilitiesRegulated Electric", "Address": "One Energy Plaza, Detroit, MI, United States, 48226-1279", "FullTimeEmployees": "10700", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "22705848320", "EBITDA": "2840000000", "PERatio": "18.4866", "PEGRatio": "3.5589", "BookValue": "60.856", "DividendPerShare": "4.05", "DividendYield": "0.0346", "EPS": "6.331", "RevenuePerShareTTM": "62.649", "ProfitMargin": "0.1013", "OperatingMarginTTM": "0.1523", "ReturnOnAssetsTTM": "0.028", "ReturnOnEquityTTM": "0.1072", "RevenueTTM": "11872000000", "GrossProfitTTM": "3417000000", "DilutedEPSTTM": "6.331", "QuarterlyEarningsGrowthYOY": "0.455", "QuarterlyRevenueGrowthYOY": "-0.106", "AnalystTargetPrice": "128.78", "TrailingPE": "18.4866", "ForwardPE": "17.8571", "PriceToSalesRatioTTM": "1.8679", "PriceToBookRatio": "1.9229", "EVToRevenue": "3.4571", "EVToEBITDA": "12.1071", "Beta": "0.6187", "52WeekHigh": "135.67", "52WeekLow": "71.21", "50DayMovingAverage": "114.8408", "200DayMovingAverage": "108.3505", "SharesOutstanding": "192651008", "SharesFloat": "191306039", "SharesShort": "3441010", "SharesShortPriorMonth": "3586351", "ShortRatio": "3.24", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0232", "PercentInsiders": "0.601", "PercentInstitutions": "75.597", "ForwardAnnualDividendRate": "4.05", "ForwardAnnualDividendYield": "0.0346", "PayoutRatio": "0.6291", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-18", "LastSplitFactor": "2:1", "LastSplitDate": "1963-01-15"}