{"Symbol": "EXPE", "AssetType": "Common Stock", "Name": "Expedia Group, Inc", "Description": "Expedia Group, Inc. operates as an online travel company worldwide. It operates through four segments: Core Online Travel Agencies, Trivago, Vrbo, and Egencia. Its brand portfolio include Brand Expedia, a full-service online travel brand with localized websites; Hotels.com for marketing and distributing lodging accommodations; Vrbo, an online marketplace for the alternative accommodations; Expedia Partner Solutions, a business-to-business brand that provides travel offerings for various airlines and hotels, online and offline travel agencies, loyalty and corporate travel companies, and various consumer brands; and Egencia, which provides corporate travel management services. The company's brand portfolio also comprise Orbitz, Travelocity, and CheapTickets travel Websites; ebookers, a full-service travel brand; Hotwire, an online travel Website; Expedia Group Media Solutions that provides media partnerships and digital marketing solutions; trivago, an online hotel metasearch platform; and Expedia Local Expert, a provider of online and in-market concierge services, activities, experiences, and ground transportation. In addition, its brand portfolio consists of CarRentals.com, an online car rental booking service; Classic Vacations, a luxury travel specialist; Expedia CruiseShipCenters, a provider of advice for travelers booking cruises and vacations; and SilverRail, a provider of a rail retail and distribution platform connecting rail carriers and suppliers to online and offline travel distributors. Further, the company provides online travel services through its Wotif.com, lastminute.com.au, travel.com.au, Wotif.co.nz, and lastminute.co.nz brands; loyalty programs; and advertising and media services. It serves leisure and corporate travelers. The company was formerly known as Expedia, Inc. and changed its name to Expedia Group, Inc. in March 2018. Expedia Group, Inc. was founded in 1996 and is headquartered in Seattle, Washington.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Travel Services", "Address": "1111 Expedia Group Way West, Seattle, WA, United States, 98119", "FullTimeEmployees": "25400", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14248392704", "EBITDA": "58000000", "PERatio": "14.9894", "PEGRatio": "1.4123", "BookValue": "12.279", "DividendPerShare": "1.36", "DividendYield": "0.0171", "EPS": "3.34", "RevenuePerShareTTM": "63.305", "ProfitMargin": "-0.1709", "OperatingMarginTTM": "-0.0332", "ReturnOnAssetsTTM": "-0.0085", "ReturnOnEquityTTM": "-0.3252", "RevenueTTM": "9080000512", "GrossProfitTTM": "9904000000", "DilutedEPSTTM": "-10.939", "QuarterlyEarningsGrowthYOY": "-0.21", "QuarterlyRevenueGrowthYOY": "-0.82", "AnalystTargetPrice": "97.24", "TrailingPE": "14.9894", "ForwardPE": "20.202", "PriceToSalesRatioTTM": "1.5589", "PriceToBookRatio": "7.9601", "EVToRevenue": "2.1416", "EVToEBITDA": "28.4442", "Beta": "1.5352", "52WeekHigh": "139.88", "52WeekLow": "40.76", "50DayMovingAverage": "87.0614", "200DayMovingAverage": "80.0161", "SharesOutstanding": "135703008", "SharesFloat": "127197246", "SharesShort": "13963755", "SharesShortPriorMonth": "13141287", "ShortRatio": "5.1", "ShortPercentOutstanding": "0.11", "ShortPercentFloat": "0.1278", "PercentInsiders": "0.704", "PercentInstitutions": "107.951", "ForwardAnnualDividendRate": "1.36", "ForwardAnnualDividendYield": "0.0171", "PayoutRatio": "0.3501", "DividendDate": "2020-03-26", "ExDividendDate": "2020-03-09", "LastSplitFactor": "1:2", "LastSplitDate": "2011-12-21"}