{"Symbol": "FBHS", "AssetType": "Common Stock", "Name": "Fortune Brands Home & Security, Inc", "Description": "Fortune Brands Home & Security, Inc., together with its subsidiaries, provides home and security products for residential home repair, remodeling, new construction, and security applications. It operates in three segments: Cabinets, Plumbing, and Doors & Security. The Cabinets segment manufactures custom, semi-custom, and stock cabinetry, as well as vanities for the kitchen, bath, and other parts of the home directly to kitchen and bath dealers, home centers, wholesalers, and builders in North America under the Diamond, Aristokraft, Mid-Continent, Kitchen Craft, Homecrest, Omega, StarMark, Ultracraft, Kemper, Schrock, Decora, and Mantra brand names. The Plumbing segment manufactures, assembles, and sells faucets, accessories, kitchen sinks, and waste disposals in the United States, China, Canada, Mexico, Southeast Asia, Europe, and South America directly through its own sales force, as well as through independent manufacturers' representatives primarily to wholesalers, home centers, mass merchandisers, and industrial distributors. The Doors & Security segment offers fiberglass and steel entry door systems under the Therma-Tru brand name; composite decking and railing under the Fiberon brand name; and urethane millwork under the Fypon brand name. This segment also manufactures, sources, and distributes locks, safety and security devices, and electronic security products under the Master Lock and American Lock brand names; and fire resistant safes, security containers, and commercial cabinets under the SentrySafe brand name. It serves home centers, hardware and other retailers, millwork building products and wholesale distributors, specialty dealers, and remodeling and renovation markets, as well as locksmiths, industrial and institutional users, and original equipment manufacturers. This segment sells its products in the United States, Canada, Europe, Central America, Japan, and Australia. The company was founded in 1988 and is headquartered in Deerfield, Illinois.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Furnishings, Fixtures & Appliances", "Address": "520 Lake Cook Road, Deerfield, IL, United States, 60015", "FullTimeEmployees": "24700", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "11799221248", "EBITDA": "916600000", "PERatio": "27.3742", "PEGRatio": "2.1592", "BookValue": "17.82", "DividendPerShare": "0.96", "DividendYield": "0.0113", "EPS": "3.099", "RevenuePerShareTTM": "41.05", "ProfitMargin": "0.0761", "OperatingMarginTTM": "0.1335", "ReturnOnAssetsTTM": "0.0752", "ReturnOnEquityTTM": "0.1808", "RevenueTTM": "5708000256", "GrossProfitTTM": "2066800000", "DilutedEPSTTM": "3.099", "QuarterlyEarningsGrowthYOY": "-0.144", "QuarterlyRevenueGrowthYOY": "-0.087", "AnalystTargetPrice": "82.5", "TrailingPE": "27.3742", "ForwardPE": "23.0415", "PriceToSalesRatioTTM": "2.0873", "PriceToBookRatio": "4.7621", "EVToRevenue": "2.4016", "EVToEBITDA": "16.6524", "Beta": "1.7176", "52WeekHigh": "86.47", "52WeekLow": "33.9", "50DayMovingAverage": "77.2731", "200DayMovingAverage": "61.2175", "SharesOutstanding": "138148000", "SharesFloat": "137418898", "SharesShort": "3072329", "SharesShortPriorMonth": "2461885", "ShortRatio": "2.85", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0251", "PercentInsiders": "0.6", "PercentInstitutions": "90.244", "ForwardAnnualDividendRate": "0.96", "ForwardAnnualDividendYield": "0.0113", "PayoutRatio": "0.2968", "DividendDate": "2020-09-16", "ExDividendDate": "2020-08-27", "LastSplitFactor": "None", "LastSplitDate": "None"}