{"Symbol": "GPC", "AssetType": "Common Stock", "Name": "Genuine Parts Company", "Description": "Genuine Parts Company distributes automotive replacement parts, industrial parts and materials, and business products in the United States, Canada, Mexico, Australasia, France, the United Kingdom, Germany, Poland, the Netherlands, and Belgium. The company distributes automotive replacement parts for imported vehicles, hybrid and electric vehicles, trucks, SUVs, buses, motorcycles, recreational vehicles, farm vehicles, small engines, farm equipment, marine equipment, and heavy duty equipment; and accessory items for automotive aftermarket, such as repair shops, service stations, fleet operators, automobile and truck dealers, leasing companies, bus and truck lines, mass merchandisers, farms, industrial concerns, and individuals. It also distributes industrial replacement parts and related supplies, such as bearings, mechanical and electrical power transmission products, industrial automation and robotics, hoses, hydraulic and pneumatic components, industrial and safety supplies, and material handling products for original equipment manufacturer, as well as maintenance, repair, and operation customers in equipment and machinery, food and beverage, forest product, primary metal, pulp and paper, mining, automotive, oil and gas, petrochemical, pharmaceutical, power generation, alternative energy, governments, transportation, ports, and other industries. In addition, the company provides various services and repairs comprising gearbox and fluid power assembly repair, process pump assembly and repair, hydraulic drive shaft repair, electrical panel assembly and repair, hose and gasket manufacture and assembly, and other value-added services. Further, it distributes office furniture, technology products, general office and school supplies, cleaning, janitorial and breakroom supplies, safety and security items, healthcare products, and disposable food service products to resellers. The company was founded in 1928 and is headquartered in Atlanta, Georgia.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Specialty Retail", "Address": "2999 Wildwood Parkway, Atlanta, GA, United States, 30339", "FullTimeEmployees": "55000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13687768064", "EBITDA": "1311667968", "PERatio": "624.3333", "PEGRatio": "3.8413", "BookValue": "19.75", "DividendPerShare": "3.16", "DividendYield": "0.0337", "EPS": "4.09", "RevenuePerShareTTM": "128.17", "ProfitMargin": "-0.0103", "OperatingMarginTTM": "0.0553", "ReturnOnAssetsTTM": "0.0461", "ReturnOnEquityTTM": "0.0075", "RevenueTTM": "18590998528", "GrossProfitTTM": "6316269000", "DilutedEPSTTM": "-1.323", "QuarterlyEarningsGrowthYOY": "-0.138", "QuarterlyRevenueGrowthYOY": "-0.142", "AnalystTargetPrice": "92.71", "TrailingPE": "624.3333", "ForwardPE": "20.3666", "PriceToSalesRatioTTM": "0.7324", "PriceToBookRatio": "4.7417", "EVToRevenue": "0.8875", "EVToEBITDA": "27.9544", "Beta": "1.1093", "52WeekHigh": "108.58", "52WeekLow": "49.681", "50DayMovingAverage": "91.2975", "200DayMovingAverage": "83.0411", "SharesOutstanding": "144264000", "SharesFloat": "141296675", "SharesShort": "2700307", "SharesShortPriorMonth": "2921879", "ShortRatio": "4.02", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0249", "PercentInsiders": "2.759", "PercentInstitutions": "80.93", "ForwardAnnualDividendRate": "3.16", "ForwardAnnualDividendYield": "0.0337", "PayoutRatio": "20.7", "DividendDate": "2020-10-01", "ExDividendDate": "2020-09-03", "LastSplitFactor": "3:2", "LastSplitDate": "1997-04-15"}