{"Symbol": "HON", "AssetType": "Common Stock", "Name": "Honeywell International Inc", "Description": "Honeywell International Inc. operates as a diversified technology and manufacturing company worldwide. The Aerospace segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; spare parts; repair, overhaul, and maintenance services; thermal systems; and connected solutions and data services for the aftermarket, as well as wireless connectivity, and management and technical services. The company's Honeywell Building Technologies segment offers advanced software applications for building control and optimization; sensors, switches, control systems and instruments for energy management; access control; video surveillance; fire products; remote patient monitoring systems; e-cooling heat transfer agents; and installation, maintenance, and upgrades of systems. Its Performance Materials and Technologies segment offers automation control, instrumentation, and advanced software and related services; catalysts and adsorbents, equipment, and consulting; and materials used to manufacture end products, such as bullet-resistant armor, nylon, computer chips, and pharmaceutical packaging, as well as Honeywell forge connected solutions. The company's Safety and Productivity Solutions segment provides personal protection equipment, apparel, gear, and footwear; gas detection technology; and cloud-based notification and emergency messaging; and mobile devices and software; supply chain and warehouse automation equipment, and software and solutions; custom-engineered sensors, switches, and controls; and software-based data and asset management productivity solutions. Honeywell International Inc. was incorporated in 1985 and is headquartered in Charlotte, North Carolina.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "300 South Tryon Street, Charlotte, NC, United States, 28202", "FullTimeEmployees": "113000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "118166224896", "EBITDA": "7942000128", "PERatio": "20.417", "PEGRatio": "2.7411", "BookValue": "25.858", "DividendPerShare": "3.6", "DividendYield": "0.0217", "EPS": "8.138", "RevenuePerShareTTM": "48.571", "ProfitMargin": "0.1694", "OperatingMarginTTM": "0.2004", "ReturnOnAssetsTTM": "0.0713", "ReturnOnEquityTTM": "0.3262", "RevenueTTM": "34522001408", "GrossProfitTTM": "12370000000", "DilutedEPSTTM": "8.138", "QuarterlyEarningsGrowthYOY": "-0.271", "QuarterlyRevenueGrowthYOY": "-0.191", "AnalystTargetPrice": "166.6", "TrailingPE": "20.417", "ForwardPE": "24.4499", "PriceToSalesRatioTTM": "3.4554", "PriceToBookRatio": "6.4192", "EVToRevenue": "3.576", "EVToEBITDA": "14.9384", "Beta": "1.0505", "52WeekHigh": "184.06", "52WeekLow": "101.08", "50DayMovingAverage": "154.9861", "200DayMovingAverage": "147.5073", "SharesOutstanding": "701782976", "SharesFloat": "670785403", "SharesShort": "4864272", "SharesShortPriorMonth": "4424821", "ShortRatio": "1.52", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0069", "PercentInsiders": "0.162", "PercentInstitutions": "78.178", "ForwardAnnualDividendRate": "3.6", "ForwardAnnualDividendYield": "0.0217", "PayoutRatio": "0.433", "DividendDate": "2020-09-04", "ExDividendDate": "2020-08-13", "LastSplitFactor": "1032:1000", "LastSplitDate": "2018-10-29"}