{"Symbol": "LH", "AssetType": "Common Stock", "Name": "Laboratory Corporation of America Holdings", "Description": "Laboratory Corporation of America Holdings operates as an independent clinical laboratory company worldwide. It operates in two segments, LabCorp Diagnostics (LCD) and Covance Drug Development. It offers various clinical laboratory tests, such as blood chemistry analyses, urinalyses, blood cell counts, thyroid tests, Pap tests, hemoglobin A1C and vitamin D products, prostate-specific antigens, tests for sexually-transmitted diseases, hepatitis C tests, microbiology cultures and procedures, and alcohol and other substance-abuse tests. The company also provides testing services in the areas of women's health, allergy, diagnostic genetics, cardiovascular and infectious disease, endocrinology, oncology, coagulation, pharmacogenetics, toxicology, and medical drug monitoring; and esoteric testing, cancer diagnostics, and other procedures. In addition, it provides a suite of applications to enable patients, healthcare providers, health systems, accountable care organizations, and insurers with access to LCD's data and services, as well as billing for laboratory services. Further, it offers end-to-end drug development, medical device, and diagnostic development solutions from research to clinical development and commercial market access. The company primarily serves managed care organizations, biopharmaceutical companies, physicians and other healthcare providers, hospitals and health systems, governmental agencies, employers, patients and consumers, contract research organizations, academic institutions, and independent clinical laboratories. Laboratory Corporation of America Holdings has collaborations with the Boston University, Columbia University, Duke University, Johns Hopkins University, The Mount Sinai Hospital, the University of Tennessee, Yale University, and QIAGEN N.V; and Ciox Health for the creation of COVID-19 patient data registry in the United States. The company was founded in 1971 and is headquartered in Burlington, North Carolina.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "358 South Main Street, Burlington, NC, United States, 27215", "FullTimeEmployees": "65000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17279733760", "EBITDA": "1813400064", "PERatio": "47.3533", "PEGRatio": "2.5176", "BookValue": "75.567", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.709", "RevenuePerShareTTM": "117.929", "ProfitMargin": "0.0316", "OperatingMarginTTM": "0.1154", "ReturnOnAssetsTTM": "0.0465", "ReturnOnEquityTTM": "0.0499", "RevenueTTM": "11474499584", "GrossProfitTTM": "3252500000", "DilutedEPSTTM": "3.709", "QuarterlyEarningsGrowthYOY": "0.228", "QuarterlyRevenueGrowthYOY": "-0.039", "AnalystTargetPrice": "228.57", "TrailingPE": "47.3533", "ForwardPE": "15.949", "PriceToSalesRatioTTM": "1.483", "PriceToBookRatio": "2.3084", "EVToRevenue": "2.0506", "EVToEBITDA": "16.4464", "Beta": "1.4137", "52WeekHigh": "201.88", "52WeekLow": "98.02", "50DayMovingAverage": "188.8839", "200DayMovingAverage": "168.4159", "SharesOutstanding": "97400000", "SharesFloat": "96832158", "SharesShort": "1210232", "SharesShortPriorMonth": "1698375", "ShortRatio": "1.62", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0141", "PercentInsiders": "0.637", "PercentInstitutions": "95.729", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "1994-03-29", "LastSplitFactor": "2:1", "LastSplitDate": "2002-05-13"}