{"Symbol": "LEG", "AssetType": "Common Stock", "Name": "Leggett & Platt, Incorporated", "Description": "Leggett & Platt, Incorporated designs and produces various engineered components and products worldwide. It operates through three segments: Bedding Products; Furniture, Flooring & Textile Products; and Specialized Products. The company offers innersprings, wire forms, specialty foams, and machines to shape wire into various types of innersprings; industrial sewing/finishing machines, conveyor lines, mattress packaging, and glue-drying equipment, as well as quilting machines; and structural fabrics, carpet cushions and hard surface flooring underlayment, and geo components to manufacturers of finished bedding, upholstered furniture, packaging, filtration, and draperies; flooring retailers and distributors of carpet cushions; and contractors, landscapers, road construction companies, and government agencies using geo components. It also provides drawn wires and steel rods to packaging and baling companies, mechanical spring manufacturers, and wire distributors, as well as bedding and furniture components, and automotive seat support and lumbar systems. In addition, the company offers bases, columns, back rests, control devices, and casters and frames; private-label finished furniture; beds and bed frames; adjustable beds; and steel mechanisms and hardware, and springs and seat suspensions to upholstered and office furniture manufacturers; department stores and big box retailers; e-commerce retailers; and mattress and furniture retailers. Further, it provides mechanical and pneumatic lumbar support and massage systems, seat suspension systems, motors and actuators, and cables; titanium, nickel, and stainless steel tubing, formed tube, and tube assemblies; and engineered hydraulic cylinders to automobile and aerospace OEMs, mobile equipment OEMs, and aerospace suppliers. The company sells its products through sales representatives and distributors. Leggett & Platt, Incorporated was founded in 1883 and is based in Carthage, Missouri.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Furnishings, Fixtures & Appliances", "Address": "No. 1 Leggett Road, Carthage, MO, United States, 64836", "FullTimeEmployees": "22000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "5492985856", "EBITDA": "585600000", "PERatio": "24.6287", "PEGRatio": "-4.11", "BookValue": "9.171", "DividendPerShare": "1.6", "DividendYield": "0.0389", "EPS": "1.669", "RevenuePerShareTTM": "31.595", "ProfitMargin": "0.0529", "OperatingMarginTTM": "0.0941", "ReturnOnAssetsTTM": "0.0525", "ReturnOnEquityTTM": "0.1843", "RevenueTTM": "4274800128", "GrossProfitTTM": "1050100000", "DilutedEPSTTM": "1.669", "QuarterlyEarningsGrowthYOY": "-0.25", "QuarterlyRevenueGrowthYOY": "-0.303", "AnalystTargetPrice": "41", "TrailingPE": "24.6287", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.3056", "PriceToBookRatio": "4.4847", "EVToRevenue": "1.7641", "EVToEBITDA": "13.0561", "Beta": "1.617", "52WeekHigh": "55.4185", "52WeekLow": "22.03", "50DayMovingAverage": "38.6872", "200DayMovingAverage": "34.3107", "SharesOutstanding": "132393000", "SharesFloat": "130753894", "SharesShort": "4328470", "SharesShortPriorMonth": "5576075", "ShortRatio": "3.1", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0421", "PercentInsiders": "1.181", "PercentInstitutions": "75.319", "ForwardAnnualDividendRate": "1.6", "ForwardAnnualDividendYield": "0.0389", "PayoutRatio": "0.9581", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-14", "LastSplitFactor": "2:1", "LastSplitDate": "1998-06-16"}