{"Symbol": "MPC", "AssetType": "Common Stock", "Name": "Marathon Petroleum Corporation", "Description": "Marathon Petroleum Corporation, together with its subsidiaries, engages in refining, marketing, retailing, and transporting petroleum products primarily in the United States. It operates through three segments: Refining & Marketing, Retail, and Midstream. The Refining & Marketing segment refines crude oil and other feed stocks at its 16 refineries in the West Coast, Gulf Coast, and Mid-Continent regions of the United States; and purchases refined products and ethanol for resale. Its refined products include transportation fuels, such as reformulated gasolines and blend-grade gasolines; heavy fuel oil; and asphalt. This segment also manufactures aromatics, propane, propylene, and sulfur. It sells refined products wholesale marketing customers domestically and internationally, buyers on the spot market, and independent entrepreneurs who operate primarily Marathon branded outlets. The Retail segment sells transportation fuels and convenience products in the retail market through company-owned and operated convenience stores, primarily under the Speedway brand; and long-term fuel supply contracts with direct dealers who operate locations mainly under the ARCO brand. The Midstream segment transports, stores, distributes, and markets crude oil and refined products through refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes, and transports natural gas; and gathers, transports, fractionates, stores, and markets natural gas liquids. The company also exports its refined products. As of December 31, 2019, it owned, leased, and had ownership interests in approximately 17,200 miles of crude oil and refined product pipelines, as well as owned and operated 3,900 convenience stores; and had 6,900 retail outlets operated by independent entrepreneurs in 35 states of the United States, the District of Columbia, and Mexico. The company was founded in 1887 and is headquartered in Findlay, Ohio.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Refining & Marketing", "Address": "539 South Main Street, Findlay, OH, United States, 45840", "FullTimeEmployees": "60910", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "24134277120", "EBITDA": "5602999808", "PERatio": "8.0806", "PEGRatio": "15.6503", "BookValue": "36.525", "DividendPerShare": "2.32", "DividendYield": "0.0657", "EPS": "4.637", "RevenuePerShareTTM": "157.911", "ProfitMargin": "-0.0749", "OperatingMarginTTM": "0.0183", "ReturnOnAssetsTTM": "0.0129", "ReturnOnEquityTTM": "-0.2191", "RevenueTTM": "102641999872", "GrossProfitTTM": "13869000000", "DilutedEPSTTM": "-11.826", "QuarterlyEarningsGrowthYOY": "-0.994", "QuarterlyRevenueGrowthYOY": "-0.55", "AnalystTargetPrice": "48.57", "TrailingPE": "8.0806", "ForwardPE": "196.0784", "PriceToSalesRatioTTM": "0.2229", "PriceToBookRatio": "0.9587", "EVToRevenue": "0.5499", "EVToEBITDA": "5.5016", "Beta": "2.1896", "52WeekHigh": "69.65", "52WeekLow": "15.26", "50DayMovingAverage": "37.2969", "200DayMovingAverage": "35.0717", "SharesOutstanding": "650694976", "SharesFloat": "646862871", "SharesShort": "22955437", "SharesShortPriorMonth": "24942375", "ShortRatio": "2.94", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0355", "PercentInsiders": "0.597", "PercentInstitutions": "78.824", "ForwardAnnualDividendRate": "2.32", "ForwardAnnualDividendYield": "0.0657", "PayoutRatio": "0.534", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-18", "LastSplitFactor": "2:1", "LastSplitDate": "2015-06-11"}