{"Symbol": "MET", "AssetType": "Common Stock", "Name": "MetLife, Inc", "Description": "MetLife, Inc. engages in the insurance, annuities, employee benefits, and asset management businesses worldwide. It operates through five segments: U.S.; Asia; Latin America; Europe, the Middle East and Africa; and MetLife Holdings. The company offers life, dental, group short-and long-term disability, individual disability, accidental death and dismemberment, vision, and accident and health coverages, as well as prepaid legal plans; administrative services-only arrangements to employers; and stable value products, including general and separate account guaranteed interest contracts, and private floating rate funding agreements. It also provides pension risk transfers, institutional income annuities, tort settlements, and capital markets investment products; and other products and services, such as life insurance products and funding agreements for funding postretirement benefits, as well as company, bank, or trust-owned life insurance used to finance nonqualified benefit programs for executives. In addition, the company offers automobile, homeowners', and personal excess liability insurance products. Further, it provides fixed annuities and pension products; medical and credit insurance products; variable, universal, term, endowment, and whole life insurance products; variable, and fixed and indexed-linked annuities; and protection against long-term health care services. The company serves individuals, corporations and their employees, and other institutions and their members through independent agents, property and casualty specialists, sales forces, sales teams and relationship managers, and sponsoring organizations and affinity groups, as well as through career and independent agencies, bancassurance, direct marketing and e-commerce, brokers, and other third-party distribution channels. MetLife, Inc. was founded in 1863 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceLife", "Address": "200 Park Avenue, New York, NY, United States, 10166-0188", "FullTimeEmployees": "0", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "35780034560", "EBITDA": "9959000064", "PERatio": "5.0543", "PEGRatio": "4.3265", "BookValue": "83.397", "DividendPerShare": "1.84", "DividendYield": "0.0471", "EPS": "7.711", "RevenuePerShareTTM": "74.349", "ProfitMargin": "0.1073", "OperatingMarginTTM": "0.1404", "ReturnOnAssetsTTM": "0.008", "ReturnOnEquityTTM": "0.1047", "RevenueTTM": "68230000640", "GrossProfitTTM": "20484000000", "DilutedEPSTTM": "7.711", "QuarterlyEarningsGrowthYOY": "-0.96", "QuarterlyRevenueGrowthYOY": "-0.194", "AnalystTargetPrice": "45.27", "TrailingPE": "5.0543", "ForwardPE": "7.3529", "PriceToSalesRatioTTM": "0.5289", "PriceToBookRatio": "0.4685", "EVToRevenue": "0.9274", "EVToEBITDA": "0", "Beta": "1.3429", "52WeekHigh": "53.28", "52WeekLow": "22.85", "50DayMovingAverage": "38.3569", "200DayMovingAverage": "36.7922", "SharesOutstanding": "907662016", "SharesFloat": "768653958", "SharesShort": "11239764", "SharesShortPriorMonth": "15971900", "ShortRatio": "2.04", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0146", "PercentInsiders": "15.544", "PercentInstitutions": "77.428", "ForwardAnnualDividendRate": "1.84", "ForwardAnnualDividendYield": "0.0471", "PayoutRatio": "0.2303", "DividendDate": "2020-09-14", "ExDividendDate": "2020-08-03", "LastSplitFactor": "1122:1000", "LastSplitDate": "2017-08-07"}