{"Symbol": "MTD", "AssetType": "Common Stock", "Name": "Mettler-Toledo International Inc", "Description": "Mettler-Toledo International Inc. manufactures and supplies precision instruments and services worldwide. It operates in five segments: U.S. Operations, Swiss Operations, Western European Operations, Chinese Operations, and Other. The company offers weighing instruments for laboratory, industrial, packaging, logistics, and food retailing applications; various related analytical instruments and automated chemistry solutions used in drug and chemical compound discovery and development; metal detection and other end-of-line product inspection systems used in production and packaging for food processing and packaging, pharmaceutical, packaged consumer goods, and other industries; and solutions that are used in various process analytics applications. Its laboratory instruments include laboratory balances, liquid pipetting solutions, automated laboratory reactors, titrators, pH meters, process analytics sensors and analyzer technologies, physical value analyzers, thermal analysis systems, and other analytical instruments; and LabX, a PC-based laboratory software platform. The company's industrial instruments comprise industrial weighing instruments and related terminals, automatic dimensional measurement and data capture solutions, vehicle scale systems, industrial software, and product inspection systems. Its retail weighing solutions consist of networked scales and software, and stand-alone scales for handling fresh goods, such as meats, vegetables, fruits, and cheeses. The company serves the life science industry, and independent research organizations; food and beverage producers; food retailers; chemical, specialty chemical, and cosmetics companies; food retailers; transportation and logistics, metals, and electronics industries; and the academic community. The company markets its products through its direct sales force and indirect distribution channels. Mettler-Toledo International Inc. was incorporated in 1991 and is based in Columbus, Ohio.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "1900 Polaris Parkway, Columbus, OH, United States, 43240", "FullTimeEmployees": "14850", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "23170897920", "EBITDA": "781457024", "PERatio": "43.5558", "PEGRatio": "5.8527", "BookValue": "18.776", "DividendPerShare": "None", "DividendYield": "0", "EPS": "22.308", "RevenuePerShareTTM": "121.529", "ProfitMargin": "0.1861", "OperatingMarginTTM": "0.2471", "ReturnOnAssetsTTM": "0.1699", "ReturnOnEquityTTM": "1.1462", "RevenueTTM": "2937669120", "GrossProfitTTM": "1741211000", "DilutedEPSTTM": "22.308", "QuarterlyEarningsGrowthYOY": "0.032", "QuarterlyRevenueGrowthYOY": "-0.056", "AnalystTargetPrice": "865", "TrailingPE": "43.5558", "ForwardPE": "44.0529", "PriceToSalesRatioTTM": "8.0825", "PriceToBookRatio": "51.5904", "EVToRevenue": "8.2696", "EVToEBITDA": "30.1239", "Beta": "1.122", "52WeekHigh": "980.88", "52WeekLow": "579.4", "50DayMovingAverage": "918.9953", "200DayMovingAverage": "781.9123", "SharesOutstanding": "23971300", "SharesFloat": "23540741", "SharesShort": "483198", "SharesShortPriorMonth": "614750", "ShortRatio": "4.32", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0232", "PercentInsiders": "1.831", "PercentInstitutions": "99.77", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:2", "LastSplitDate": "1996-06-25"}