{"Symbol": "MSCI", "AssetType": "Common Stock", "Name": "MSCI Inc", "Description": "MSCI Inc., together with its subsidiaries, provides investment decision support tools for the clients to manage their investment processes worldwide. The company operates through four segments: Index, Analytics, ESG, and Real Estate. The Index segment primarily provides equity indexes for use in various areas of the investment process, including index-linked product creation and performance benchmarking, as well as portfolio construction and rebalancing, broker-dealer structured products, and asset allocation. The Analytics segment offers risk management, performance attribution and portfolio management content, applications, and services that provide clients with an integrated view of risk and return, and an analysis of market, credit, liquidity, and counterparty risk across various asset classes, spanning short, medium, and long-term time horizons; and various managed services for clients such as consolidation of client portfolio data from various sources, review and reconciliation of input data and results, and customized reporting consultants and investors in hedge funds. The ESG segment provides products and services that help institutional investors understand how environmental, social, and governance (ESG) factors impact the long-term risk of their investments; and data and ratings products for use in the construction of equity and fixed income indexes to help institutional investors benchmark ESG investment performance and issue index-based investment products, as well as manage, measure, and report on ESG mandates. The Real Estate segment offers real estate performance analysis for funds, investors, and managers. This segment provides products and services that include research, reporting, market data, and benchmarking; and business intelligence to real estate owners, managers, developers, and brokers. The company serves asset owners and managers, banks, and wealth managers. MSCI Inc. was founded in 1998 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Financial Data & Stock Exchanges", "Address": "7 World Trade Center, New York, NY, United States, 10007", "FullTimeEmployees": "3513", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "31253549056", "EBITDA": "888323008", "PERatio": "60.2427", "PEGRatio": "3.9118", "BookValue": "-2.737", "DividendPerShare": "3.12", "DividendYield": "0.0084", "EPS": "6.14", "RevenuePerShareTTM": "19.251", "ProfitMargin": "0.3214", "OperatingMarginTTM": "0.5062", "ReturnOnAssetsTTM": "0.1353", "ReturnOnEquityTTM": "5.1434", "RevenueTTM": "1627252992", "GrossProfitTTM": "1269835000", "DilutedEPSTTM": "6.14", "QuarterlyEarningsGrowthYOY": "-0.075", "QuarterlyRevenueGrowthYOY": "0.062", "AnalystTargetPrice": "413.38", "TrailingPE": "60.2427", "ForwardPE": "52.9101", "PriceToSalesRatioTTM": "19.3779", "PriceToBookRatio": "0", "EVToRevenue": "20.3245", "EVToEBITDA": "38.502", "Beta": "0.9538", "52WeekHigh": "398.49", "52WeekLow": "210.34", "50DayMovingAverage": "371.1317", "200DayMovingAverage": "327.8551", "SharesOutstanding": "83637200", "SharesFloat": "81020173", "SharesShort": "946497", "SharesShortPriorMonth": "1098308", "ShortRatio": "2.04", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0132", "PercentInsiders": "3.184", "PercentInstitutions": "95.443", "ForwardAnnualDividendRate": "3.12", "ForwardAnnualDividendYield": "0.0084", "PayoutRatio": "0.443", "DividendDate": "2020-08-31", "ExDividendDate": "2020-08-13", "LastSplitFactor": "None", "LastSplitDate": "None"}