{"Symbol": "NOV", "AssetType": "Common Stock", "Name": "National Oilwell Varco, Inc", "Description": "National Oilwell Varco, Inc. designs, constructs, manufactures, and sells systems, components, and products for oil and gas drilling and production worldwide. It operates through three segments: Wellbore Technologies, Completion & Production Solutions, and Rig Technologies. The company offers various equipment and technologies used to perform drilling operations. It also provides solids control and waste management equipment and services; drilling fluids; portable power generation products; drill and wired pipes; drilling optimization and automation services; tubular inspection, repair, and coating services; instrumentation, and measuring and monitoring services; downhole and fishing tools; steerable technologies; and drill bits. The company offers equipment and technologies for hydraulic fracture stimulation, including pressure pumping trucks, blenders, sanders, hydration units, injection units, flowline, and manifolds; well intervention, such as coiled tubing units, coiled tubing, and wireline units, as well as blowout preventers and tools; onshore production comprising fluid processing systems, composite pipes, surface transfer and progressive cavity pumps, and artificial lift systems; offshore production that include fluid processing systems, floating production systems, and subsea production technologies; and connectors for conductor pipes. It also provides substructures, derricks, and masts; cranes; jacking systems; pipe lifting, racking, rotating, and assembly systems; mud pumps; blowout preventers; drives and generators; rig instrumentation and control systems; equipment components for offshore wind construction vessels; mooring, anchor, and deck handling machinery; and pipelay and construction systems. The company offers spare parts, repair, and rentals, as well as remote equipment monitoring, technical support, field service, and customer training services. National Oilwell Varco, Inc. was founded in 1862 and is based in Houston, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Equipment & Services", "Address": "7909 Parkwood Circle Drive, Houston, TX, United States, 77036-6565", "FullTimeEmployees": "33810", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4783659008", "EBITDA": "175000000", "PERatio": "None", "PEGRatio": "-0.31", "BookValue": "14.063", "DividendPerShare": "0.2", "DividendYield": "0.0154", "EPS": "-14.35", "RevenuePerShareTTM": "20.302", "ProfitMargin": "-0.3556", "OperatingMarginTTM": "-0.0275", "ReturnOnAssetsTTM": "-0.0108", "ReturnOnEquityTTM": "-0.3952", "RevenueTTM": "7785999872", "GrossProfitTTM": "845000000", "DilutedEPSTTM": "-7.22", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.298", "AnalystTargetPrice": "13.38", "TrailingPE": "0", "ForwardPE": "24.5098", "PriceToSalesRatioTTM": "0.5945", "PriceToBookRatio": "0.8583", "EVToRevenue": "0.7733", "EVToEBITDA": "0", "Beta": "1.7687", "52WeekHigh": "25.81", "52WeekLow": "8", "50DayMovingAverage": "12.0831", "200DayMovingAverage": "13.0634", "SharesOutstanding": "388284000", "SharesFloat": "386427699", "SharesShort": "13746713", "SharesShortPriorMonth": "14786809", "ShortRatio": "2.29", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0356", "PercentInsiders": "0.418", "PercentInstitutions": "98.472", "ForwardAnnualDividendRate": "0.2", "ForwardAnnualDividendYield": "0.0154", "PayoutRatio": "0", "DividendDate": "2020-03-27", "ExDividendDate": "2020-03-12", "LastSplitFactor": "1109:1000", "LastSplitDate": "2014-06-02"}