{"Symbol": "NUE", "AssetType": "Common Stock", "Name": "Nucor Corporation", "Description": "Nucor Corporation manufactures and sells steel and steel products. It operates in three segments: Steel Mills, Steel Products, and Raw Materials. The Steel Mills segment produces hot-rolled, cold-rolled, and galvanized sheet steel products; plate steel products; wide-flange beams, beam blanks, and H-piling and sheet piling products; bar steel products, such as blooms, billets, concrete reinforcing and merchant bars, and special bar quality products. It also engages in the steel trading and rebar distribution businesses. This segment sells its products to steel service centers, fabricators, and manufacturers in the United States, Canada, and Mexico. The Steel Products segment offers hollow structural section steel tubing products, electrical conduits, steel joists and joist girders, steel decks, fabricated concrete reinforcing steel products, cold finished steel products, steel fasteners, metal building systems, steel grating and expanded metal products, and wire and wire mesh products primarily for use in nonresidential construction applications. This segment also engages in the piling distribution business. The Raw Materials segment produces direct reduced iron (DRI); brokers ferrous and nonferrous metals, pig iron, DRI, and hot briquetted iron; supplies ferro-alloys; and processes ferrous and nonferrous scrap metal, as well as engages in the natural gas drilling operations. This segment sells its ferrous scrap to electric arc furnace steel mills and foundries for manufacturing process; and nonferrous scrap metal to aluminum can producers, secondary aluminum smelters, steel mills and other processors, and consumers of various nonferrous metals. The company offers its products through its in-house sales forces; and internal distribution and trading companies. The company was incorporated in 1958 and is based in Charlotte, North Carolina.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Basic Materials", "Industry": "Steel", "Address": "1915 Rexford Road, Charlotte, NC, United States, 28211", "FullTimeEmployees": "26800", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13884151808", "EBITDA": "2159770112", "PERatio": "27.2754", "PEGRatio": "0.75", "BookValue": "33.769", "DividendPerShare": "1.61", "DividendYield": "0.0353", "EPS": "1.671", "RevenuePerShareTTM": "67.706", "ProfitMargin": "0.0249", "OperatingMarginTTM": "0.0663", "ReturnOnAssetsTTM": "0.0462", "ReturnOnEquityTTM": "0.0577", "RevenueTTM": "20547891200", "GrossProfitTTM": "2700360000", "DilutedEPSTTM": "1.671", "QuarterlyEarningsGrowthYOY": "-0.716", "QuarterlyRevenueGrowthYOY": "-0.266", "AnalystTargetPrice": "45.33", "TrailingPE": "27.2754", "ForwardPE": "25.9067", "PriceToSalesRatioTTM": "0.6732", "PriceToBookRatio": "1.3489", "EVToRevenue": "0.7829", "EVToEBITDA": "8.8761", "Beta": "1.4214", "52WeekHigh": "58.7", "52WeekLow": "27.525", "50DayMovingAverage": "43.7344", "200DayMovingAverage": "40.9361", "SharesOutstanding": "301895008", "SharesFloat": "300008233", "SharesShort": "4397118", "SharesShortPriorMonth": "4112561", "ShortRatio": "2.12", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0167", "PercentInsiders": "0.654", "PercentInstitutions": "81.568", "ForwardAnnualDividendRate": "1.61", "ForwardAnnualDividendYield": "0.0353", "PayoutRatio": "0.9626", "DividendDate": "2020-08-11", "ExDividendDate": "2020-06-29", "LastSplitFactor": "2:1", "LastSplitDate": "2006-06-01"}