{"Symbol": "PAYC", "AssetType": "Common Stock", "Name": "Paycom Software, Inc", "Description": "Paycom Software, Inc. provides cloud-based human capital management (HCM) software service for small to mid-sized companies in the United States. It provides functionality and data analytics that businesses need to manage the employment life cycle from recruitment to retirement. The company's HCM solution offers a suite of applications in the areas of talent acquisition, including applicant tracking, candidate tracker, background checks, on-boarding, e-verify, and tax credit services; and time and labor management, such as time and attendance, scheduling/schedule exchange, time-off requests, labor allocation, labor management reports/push reporting, and geofencing/geotracking. Its HCM solution also provides payroll applications comprising payroll and tax management, Paycom pay, expense management, mileage tracker/fixed and variable rates, garnishment management, and GL concierge applications; and talent management applications that include employee self-service, compensation budgeting, performance management, and Paycom learning and course content, as well as my analytics, which offer employment predictor reporting. In addition, the company's HCM solution offers HR management applications comprising manager on-the-go that gives supervisors and managers the ability to perform a variety of tasks, such as approving time-off requests and expense reimbursements; direct data exchange; ask here, a tool for direct line of communication to ask work-related questions; document and checklist; government and compliance; benefits administration/benefits to carrier; COBRA administration; personnel action forms; surveys; and affordable care act applications. Paycom Software, Inc. was founded in 1998 and is headquartered in Oklahoma City, Oklahoma.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "7501 West Memorial Road, Oklahoma City, OK, United States, 73142", "FullTimeEmployees": "3765", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17550503936", "EBITDA": "255516000", "PERatio": "97.0199", "PEGRatio": "3.7854", "BookValue": "10.173", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.018", "RevenuePerShareTTM": "13.748", "ProfitMargin": "0.2223", "OperatingMarginTTM": "0.2861", "ReturnOnAssetsTTM": "0.0756", "ReturnOnEquityTTM": "0.3452", "RevenueTTM": "792369984", "GrossProfitTTM": "648335000", "DilutedEPSTTM": "3.018", "QuarterlyEarningsGrowthYOY": "-0.41", "QuarterlyRevenueGrowthYOY": "0.072", "AnalystTargetPrice": "292.36", "TrailingPE": "97.0199", "ForwardPE": "87.7193", "PriceToSalesRatioTTM": "21.587", "PriceToBookRatio": "29.2738", "EVToRevenue": "21.5409", "EVToEBITDA": "62.0863", "Beta": "1.4676", "52WeekHigh": "342", "52WeekLow": "163.42", "50DayMovingAverage": "292.9025", "200DayMovingAverage": "272.1692", "SharesOutstanding": "58532900", "SharesFloat": "48682781", "SharesShort": "2174730", "SharesShortPriorMonth": "2463984", "ShortRatio": "4.31", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0505", "PercentInsiders": "16.173", "PercentInstitutions": "77.196", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}