{"Symbol": "PNC", "AssetType": "Common Stock", "Name": "The PNC Financial Services Group, Inc", "Description": "The PNC Financial Services Group, Inc. operates as a diversified financial services company in the United States. The Retail Banking segment offers deposit, lending, brokerage, insurance, and investment and cash management services to consumer and small business customers through a network of branches, ATMs, call centers, and online banking and mobile channels. The Corporate & Institutional Banking segment provides secured and unsecured loans, letters of credit, and equipment leases; payables, receivables, deposit and account, liquidity and investments, and online and mobile banking products and services; foreign exchange, derivatives, securities underwriting, loan syndications, and mergers and acquisitions and equity capital markets advisory related services; and commercial loan servicing and technology solutions for the commercial real estate finance industry. The Asset Management Group segment offers investment and retirement planning, customized investment management, private banking, and trust management and administration solutions; and multi-generational family planning products, such as estate, financial, tax planning, fiduciary, investment management and consulting, private banking, personal administrative, asset custody, and customized performance reporting services. This segment also provides chief investment officer, custody, private real estate, cash and fixed income client solutions, and retirement advisory services. The BlackRock segment offers single- and multi-asset class portfolios; and investment and risk management services technology platform. It operates 2,400 locations and 15,000 ATMs. The PNC Financial Services Group, Inc. was founded in 1852 and is headquartered in Pittsburgh, Pennsylvania.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "The Tower at PNC Plaza, Pittsburgh, PA, United States, 15222-2401", "FullTimeEmployees": "50803", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "47692910592", "EBITDA": "None", "PERatio": "17.4961", "PEGRatio": "7.8351", "BookValue": "115.125", "DividendPerShare": "4.6", "DividendYield": "0.0409", "EPS": "16.113", "RevenuePerShareTTM": "32.64", "ProfitMargin": "0.5149", "OperatingMarginTTM": "0.2636", "ReturnOnAssetsTTM": "0.0073", "ReturnOnEquityTTM": "0.0619", "RevenueTTM": "14181999616", "GrossProfitTTM": "17054000000", "DilutedEPSTTM": "16.113", "QuarterlyEarningsGrowthYOY": "1.905", "QuarterlyRevenueGrowthYOY": "-0.6", "AnalystTargetPrice": "114.58", "TrailingPE": "17.4961", "ForwardPE": "23.5294", "PriceToSalesRatioTTM": "2.7244", "PriceToBookRatio": "0.9024", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.2429", "52WeekHigh": "161.79", "52WeekLow": "79.41", "50DayMovingAverage": "107.3381", "200DayMovingAverage": "109.1311", "SharesOutstanding": "424503008", "SharesFloat": "421684152", "SharesShort": "4904180", "SharesShortPriorMonth": "4295060", "ShortRatio": "2.07", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0116", "PercentInsiders": "0.23", "PercentInstitutions": "84.488", "ForwardAnnualDividendRate": "4.6", "ForwardAnnualDividendYield": "0.0409", "PayoutRatio": "0.7154", "DividendDate": "2020-08-05", "ExDividendDate": "2020-07-16", "LastSplitFactor": "2:1", "LastSplitDate": "1992-11-16"}