{"Symbol": "PFG", "AssetType": "Common Stock", "Name": "Principal Financial Group, Inc", "Description": "Principal Financial Group, Inc. provides retirement, asset management, and insurance products and services to businesses, individuals, and institutional clients worldwide. The company operates through Retirement and Income Solutions, Principal Global Investors, Principal International, and U.S. Insurance Solutions segments. The Retirement and Income Solutions segment provides a portfolio of asset accumulation products and services for retirement savings and income. It offers products and services for defined contribution plans, including 401(k) and 403(b) plans, defined benefit pension plans, nonqualified executive benefit plans, employee stock ownership plans, and pension risk transfer services; individual retirement accounts and payroll deduction plans; investment only products; and mutual funds, individual annuities, and bank products. The Principal Global Investors segment provides equity, fixed income, real estate, and other alternative investments, as well as asset allocation, stable value management, and other structured investment strategies. The Principal International segment offers pension accumulation and income annuity products, mutual funds, asset management, and life insurance accumulation products, as well as voluntary savings plans in Brazil, Chile, Mexico, China, Hong Kong Special Administrative Region, India, and Southeast Asia. The U.S. Insurance Solutions segment provides specialty benefits, such as group dental and vision insurance, group life insurance, and group and individual disability insurance, as well as administers group dental, disability, and vision benefits; and individual life insurance products comprising universal, variable universal, indexed universal, and term life insurance products in the United States. It also offers insurance solutions for small and medium-sized businesses and their owners, as well as executives. Principal Financial Group, Inc. was founded in 1879 and is based in Des Moines, Iowa.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceDiversified", "Address": "711 High Street, Des Moines, IA, United States, 50392", "FullTimeEmployees": "17601", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "12169427968", "EBITDA": "1779800064", "PERatio": "9.7451", "PEGRatio": "1.5", "BookValue": "55.632", "DividendPerShare": "2.24", "DividendYield": "0.0505", "EPS": "4.546", "RevenuePerShareTTM": "58.486", "ProfitMargin": "0.0782", "OperatingMarginTTM": "0.0955", "ReturnOnAssetsTTM": "0.0036", "ReturnOnEquityTTM": "0.0868", "RevenueTTM": "16171499520", "GrossProfitTTM": "6197200000", "DilutedEPSTTM": "4.546", "QuarterlyEarningsGrowthYOY": "0.058", "QuarterlyRevenueGrowthYOY": "-0.216", "AnalystTargetPrice": "47.8", "TrailingPE": "9.7451", "ForwardPE": "8.7032", "PriceToSalesRatioTTM": "0.7639", "PriceToBookRatio": "0.7985", "EVToRevenue": "0.8201", "EVToEBITDA": "0", "Beta": "1.6071", "52WeekHigh": "58.28", "52WeekLow": "23.31", "50DayMovingAverage": "44.0211", "200DayMovingAverage": "39.7997", "SharesOutstanding": "274519008", "SharesFloat": "273305325", "SharesShort": "3735639", "SharesShortPriorMonth": "4407652", "ShortRatio": "2.13", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0138", "PercentInsiders": "0.326", "PercentInstitutions": "74.512", "ForwardAnnualDividendRate": "2.24", "ForwardAnnualDividendYield": "0.0505", "PayoutRatio": "0.4879", "DividendDate": "2020-09-25", "ExDividendDate": "2020-08-31", "LastSplitFactor": "None", "LastSplitDate": "None"}