{"Symbol": "PRU", "AssetType": "Common Stock", "Name": "Prudential Financial, Inc", "Description": "Prudential Financial, Inc., through its subsidiaries, provides insurance, investment management, and other financial products and services. It operates through eight segments: PGIM, Retirement, Group Insurance, Individual Annuities, Individual Life, Assurance IQ, International Businesses, and Closed Block. The company offers asset management public and private fixed income, public equity and real estate, commercial mortgage origination and servicing, and mutual funds and other retail services to institutional, private, and sub-advisory clients, as well as to insurance company separate accounts, government sponsored entities, and the general account. It provides a range of retirement investment, and income products and services to retirement plan sponsors in the public, private, and not-for-profit sectors; and group life, long-term and short-term group disability, and group corporate-, bank-, and trust-owned life insurance in the United States, primarily to institutional clients for use in connection with employee plans and affinity groups. The company develops and distributes individual variable and fixed annuity products, principally to the mass affluent and affluent markets; and individual variable, term, and universal life insurance products to the mass middle, mass affluent, and affluent markets in the United States. It also offers individual life insurance, retirement, and related products to the mass affluent and affluent markets in Japan, Korea, and other foreign countries, as well as middle income and mass affluent markets. In addition, the company provides third-party life, health, Medicare, and property and casualty products to retail shoppers through its digital and independent agent channels. It offers its products and services to individual and institutional customers through its proprietary and third-party distribution networks. The company was founded in 1875 and is headquartered in Newark, New Jersey.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceLife", "Address": "751 Broad Street, Newark, NJ, United States, 07102", "FullTimeEmployees": "51511", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "27507800064", "EBITDA": "1132999936", "PERatio": "8.854", "PEGRatio": "2.4674", "BookValue": "166.992", "DividendPerShare": "4.4", "DividendYield": "0.0634", "EPS": "7.266", "RevenuePerShareTTM": "149.881", "ProfitMargin": "-0.0022", "OperatingMarginTTM": "0.0055", "ReturnOnAssetsTTM": "0.0002", "ReturnOnEquityTTM": "-0.0017", "RevenueTTM": "59810000896", "GrossProfitTTM": "18404000000", "DilutedEPSTTM": "-0.434", "QuarterlyEarningsGrowthYOY": "-0.12", "QuarterlyRevenueGrowthYOY": "-0.213", "AnalystTargetPrice": "71.36", "TrailingPE": "8.854", "ForwardPE": "7.4019", "PriceToSalesRatioTTM": "0.464", "PriceToBookRatio": "0.4158", "EVToRevenue": "0.7123", "EVToEBITDA": "0", "Beta": "1.6929", "52WeekHigh": "97.2425", "52WeekLow": "38.62", "50DayMovingAverage": "66.2922", "200DayMovingAverage": "63.0804", "SharesOutstanding": "395000000", "SharesFloat": "394004600", "SharesShort": "7780937", "SharesShortPriorMonth": "10335451", "ShortRatio": "3.14", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0197", "PercentInsiders": "0.196", "PercentInstitutions": "67.476", "ForwardAnnualDividendRate": "4.4", "ForwardAnnualDividendYield": "0.0634", "PayoutRatio": "0.5702", "DividendDate": "2020-09-17", "ExDividendDate": "2020-08-24", "LastSplitFactor": "None", "LastSplitDate": "None"}