{"Symbol": "REGN", "AssetType": "Common Stock", "Name": "Regeneron Pharmaceuticals, Inc", "Description": "Regeneron Pharmaceuticals, Inc., a biopharmaceutical company, discovers, invents, develops, manufactures, and commercializes medicines for treating various medical conditions worldwide. The company's products include EYLEA injection to treat wet age-related macular degeneration and diabetic macular edema (DME); myopic choroidal neovascularization; and diabetic retinopathy in patients with DME, as well as macular edema following retinal vein occlusion, including macular edema following central retinal vein occlusion and macular edema following branch retinal vein occlusion. It also provides Dupixent injection to treat atopic dermatitis in adults, and asthma in adults and adolescents; Praluent injection for heterozygous familial hypercholesterolemia or clinical atherosclerotic cardiovascular disease in adults; and Kevzara solution for subcutaneous injection for treating rheumatoid arthritis in adults. In addition, the company offers Libtayo injection to treat metastatic or locally advanced cutaneous squamous cell carcinoma; ARCALYST injection for cryopyrin-associated periodic syndromes, including familial cold auto-inflammatory syndrome and muckle-wells syndrome; and ZALTRAP injection for intravenous infusion to treat metastatic colorectal cancer. Further, it is developing various product candidates for treating patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, neuromuscular diseases, infectious diseases, and other diseases. The company has collaboration and license agreements with Sanofi; Bayer; Teva; Mitsubishi Tanabe Pharma; Alnylam Pharmaceuticals, Inc.; Roche Pharmaceuticals; and Vyriad, Inc., as well as has an agreement with the U.S. Department of Health and Human Services. It has collaborations with Zai Lab Limited; Intellia Therapeutics, Inc.; and BioNTech. Regeneron Pharmaceuticals, Inc. was founded in 1988 and is headquartered in Tarrytown, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "777 Old Saw Mill River Road, Tarrytown, NY, United States, 10591", "FullTimeEmployees": "8142", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "64112881664", "EBITDA": "3028000000", "PERatio": "23.836", "PEGRatio": "1.6061", "BookValue": "86.37", "DividendPerShare": "None", "DividendYield": "0", "EPS": "25.827", "RevenuePerShareTTM": "79.39", "ProfitMargin": "0.3432", "OperatingMarginTTM": "0.3228", "ReturnOnAssetsTTM": "0.1271", "ReturnOnEquityTTM": "0.3172", "RevenueTTM": "8693199872", "GrossProfitTTM": "4044600000", "DilutedEPSTTM": "25.827", "QuarterlyEarningsGrowthYOY": "3.53", "QuarterlyRevenueGrowthYOY": "0.237", "AnalystTargetPrice": "674.63", "TrailingPE": "23.836", "ForwardPE": "21.097", "PriceToSalesRatioTTM": "8.1706", "PriceToBookRatio": "7.2237", "EVToRevenue": "7.4196", "EVToEBITDA": "18.438", "Beta": "0.5544", "52WeekHigh": "660", "52WeekLow": "271.37", "50DayMovingAverage": "623.7103", "200DayMovingAverage": "554.6853", "SharesOutstanding": "104543000", "SharesFloat": "100614141", "SharesShort": "2122545", "SharesShortPriorMonth": "2471004", "ShortRatio": "2.54", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0209", "PercentInsiders": "23.819", "PercentInstitutions": "68.354", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}