{"Symbol": "RMD", "AssetType": "Common Stock", "Name": "ResMed Inc", "Description": "ResMed Inc. develops, manufactures, distributes, and markets medical devices and cloud-based software applications that diagnose, treat, and manage respiratory disorders comprising sleep apnea, chronic obstructive pulmonary disease, neuromuscular disease, and other chronic diseases. The company operates in two segments, Sleep and Respiratory Care, and Software as a Service. It offers various products and solutions for a range of respiratory disorders, including technologies to be applied in medical and consumer products, ventilation devices, diagnostic products, mask systems for use in the hospital and home, headgear and other accessories, dental devices, portable oxygen concentrators, and cloud-based software informatics solutions to manage patient outcomes, as well as provides customer and business processes. The company also provides U-Sleep, which enables automated patient coaching through a text, email, or interactive voice phone call; AirView that enables remote monitoring, over-the-air trouble shooting, and changing of device settings; and myAir, a patient engagement application that offers sleep data and a daily score based on their previous night's data, as well as connectivity module and propeller solutions. In addition, it provides business management software and services to out-of-hospital providers, home medical equipment, pharmacy, home infusion, orthotics, and prosthetics; and HEALTHCAREfirst and MatrixCare solutions. The company markets its products to sleep clinics, home healthcare dealers, patients, hospitals, physicians, and third-party payers through a network of distributors and direct sales force in approximately 140 countries. ResMed Inc. was founded in 1989 and is headquartered in San Diego, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "9001 Spectrum Center Boulevard, San Diego, CA, United States, 92123", "FullTimeEmployees": "7770", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "26115506176", "EBITDA": "922889984", "PERatio": "42.3138", "PEGRatio": "5.3728", "BookValue": "17.234", "DividendPerShare": "1.56", "DividendYield": "0.0086", "EPS": "4.27", "RevenuePerShareTTM": "20.487", "ProfitMargin": "0.2102", "OperatingMarginTTM": "0.2736", "ReturnOnAssetsTTM": "0.1163", "ReturnOnEquityTTM": "0.2721", "RevenueTTM": "2957012992", "GrossProfitTTM": "1767389000", "DilutedEPSTTM": "4.27", "QuarterlyEarningsGrowthYOY": "1.59", "QuarterlyRevenueGrowthYOY": "0.093", "AnalystTargetPrice": "184", "TrailingPE": "42.3138", "ForwardPE": "40", "PriceToSalesRatioTTM": "8.8997", "PriceToBookRatio": "10.4847", "EVToRevenue": "9.1365", "EVToEBITDA": "28.2946", "Beta": "0.5093", "52WeekHigh": "208.995", "52WeekLow": "126.26", "50DayMovingAverage": "190.1947", "200DayMovingAverage": "170.1243", "SharesOutstanding": "144668000", "SharesFloat": "143584956", "SharesShort": "1605884", "SharesShortPriorMonth": "1761006", "ShortRatio": "2.38", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0124", "PercentInsiders": "0.792", "PercentInstitutions": "69.616", "ForwardAnnualDividendRate": "1.56", "ForwardAnnualDividendYield": "0.0086", "PayoutRatio": "0.3653", "DividendDate": "2020-09-24", "ExDividendDate": "2020-08-19", "LastSplitFactor": "2:1", "LastSplitDate": "2010-08-31"}