{"Symbol": "RHI", "AssetType": "Common Stock", "Name": "Robert Half International Inc", "Description": "Robert Half International Inc. provides staffing and risk consulting services in North America, South America, Europe, Asia, and Australia. The company operates through three segments: Temporary and Consultant Staffing, Permanent Placement Staffing, and Risk Consulting and Internal Audit Services. It places temporary services for accounting, finance, and bookkeeping; temporary and full-time office and administrative personnel consisting of executive and administrative assistants, receptionists, and customer service representatives; full-time accounting, financial, tax, and accounting operations personnel; and information technology contract consultants and full-time employees in the areas of platform systems integration to end-user technical and desktop support, including specialists in application development, networking, systems integration and deployment, database design and administration, and security and business continuity. The company also offers temporary and full-time employees in attorney, paralegal, legal administrative, and legal secretarial positions; and senior level project professionals in the accounting and finance fields for financial systems conversions, expansion into new markets, business process reengineering, business systems performance improvement, and post-merger financial consolidation. In addition, it is involved in serving professionals in the areas of interactive media, design, marketing, advertising, and public relations; and placing freelance and project consultants in various positions, such as creative directors, graphics designers, Web content developers, Web designers, media buyers, brand managers, and public relations specialists. Further, the company provides business and technology risk consulting, and internal audit services. It serves clients and employment candidates. Robert Half International Inc. was founded in 1948 and is headquartered in Menlo Park, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Staffing & Employment Services", "Address": "2884 Sand Hill Road, Menlo Park, CA, United States, 94025", "FullTimeEmployees": "16000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6189144064", "EBITDA": "569545984", "PERatio": "16.9248", "PEGRatio": "2.6339", "BookValue": "10.25", "DividendPerShare": "1.36", "DividendYield": "0.0252", "EPS": "3.197", "RevenuePerShareTTM": "50.124", "ProfitMargin": "0.0642", "OperatingMarginTTM": "0.0884", "ReturnOnAssetsTTM": "0.1358", "ReturnOnEquityTTM": "0.3232", "RevenueTTM": "5704534016", "GrossProfitTTM": "2530519000", "DilutedEPSTTM": "3.197", "QuarterlyEarningsGrowthYOY": "-0.582", "QuarterlyRevenueGrowthYOY": "-0.269", "AnalystTargetPrice": "50.17", "TrailingPE": "16.9248", "ForwardPE": "23.0947", "PriceToSalesRatioTTM": "1.0829", "PriceToBookRatio": "5.3507", "EVToRevenue": "1.0463", "EVToEBITDA": "10.4792", "Beta": "1.5429", "52WeekHigh": "63.84", "52WeekLow": "32.38", "50DayMovingAverage": "53.8608", "200DayMovingAverage": "49.4713", "SharesOutstanding": "114602000", "SharesFloat": "109424956", "SharesShort": "9427324", "SharesShortPriorMonth": "9116100", "ShortRatio": "10.49", "ShortPercentOutstanding": "0.08", "ShortPercentFloat": "0.097", "PercentInsiders": "2.959", "PercentInstitutions": "99.36", "ForwardAnnualDividendRate": "1.36", "ForwardAnnualDividendYield": "0.0252", "PayoutRatio": "0.4075", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-24", "LastSplitFactor": "2:1", "LastSplitDate": "2000-06-13"}