{"Symbol": "SPGI", "AssetType": "Common Stock", "Name": "S&P Global Inc", "Description": "S&P Global Inc., together with its subsidiaries, provides ratings, benchmarks, analytics, and data to the capital and commodity markets worldwide. The company operates through four segments: S&P Global Ratings (Ratings), S&P Global Market Intelligence (Market Intelligence), S&P Global Platts (Platts), and S&P Dow Jones Indices (Indices). The Ratings segment offers credit ratings, research, and analytics to investors, corporations, governments, municipalities, commercial and investment banks, insurance companies, asset managers, and other debt issuers. The Market Intelligence segment provides multi-asset-class data, research, and analytical capabilities, which integrate cross-asset analytics and desktop services to investment managers, investment banks, private equity firms, insurance companies, commercial banks, corporations, professional services firms, government agencies, and regulators. The Platts segment offers essential price data, analytics, and industry insights for the commodity and energy markets. It serves producers, traders, and intermediaries within the energy, petrochemicals, metals, and agriculture markets. The Indices segment provides index that maintains various valuation and index benchmarks for investment advisors, wealth managers, and institutional investors. The company also offers analytics, artificial intelligence, machine learning, and data visualization systems to Wall Street's premier global banks and investment institutions, as well as the National Security community; subscription and custom reports on bank deposits, loans, fees and other product data to the financial services industry; and insights on global supply chains. The company was formerly known as McGraw Hill Financial, Inc. and changed its name to S&P Global Inc. in April 2016. S&P Global Inc. was founded in 1860 and is headquartered in New York, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Financial Data & Stock Exchanges", "Address": "55 Water Street, New York, NY, United States, 10041", "FullTimeEmployees": "22500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "88406024192", "EBITDA": "3944000000", "PERatio": "34.3054", "PEGRatio": "4.3202", "BookValue": "0.871", "DividendPerShare": "2.68", "DividendYield": "0.0074", "EPS": "10.605", "RevenuePerShareTTM": "29.442", "ProfitMargin": "0.362", "OperatingMarginTTM": "0.5234", "ReturnOnAssetsTTM": "0.2198", "ReturnOnEquityTTM": "1.0832", "RevenueTTM": "7152999936", "GrossProfitTTM": "4898000000", "DilutedEPSTTM": "10.605", "QuarterlyEarningsGrowthYOY": "0.464", "QuarterlyRevenueGrowthYOY": "0.14", "AnalystTargetPrice": "378.77", "TrailingPE": "34.3054", "ForwardPE": "33.7838", "PriceToSalesRatioTTM": "12.4286", "PriceToBookRatio": "417.7104", "EVToRevenue": "12.5234", "EVToEBITDA": "22.7766", "Beta": "1.0473", "52WeekHigh": "367.54", "52WeekLow": "186.06", "50DayMovingAverage": "353.8586", "200DayMovingAverage": "306.0833", "SharesOutstanding": "241000000", "SharesFloat": "240597530", "SharesShort": "2145411", "SharesShortPriorMonth": "2624881", "ShortRatio": "2.68", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0089", "PercentInsiders": "0.125", "PercentInstitutions": "86.82", "ForwardAnnualDividendRate": "2.68", "ForwardAnnualDividendYield": "0.0074", "PayoutRatio": "0.2337", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-25", "LastSplitFactor": "2:1", "LastSplitDate": "2005-05-18"}