{"Symbol": "SLB", "AssetType": "Common Stock", "Name": "Schlumberger Limited", "Description": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. The company's Reservoir Characterization segment offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. Its Drilling segment designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products. This segment also provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. The company's Production segment offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Its Cameron segment offers integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as Societe de Prospection Electrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Equipment & Services", "Address": "5599 San Felipe, Houston, TX, United States, 77056", "FullTimeEmployees": "85000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "26956902400", "EBITDA": "5488999936", "PERatio": "23.5503", "PEGRatio": "2.2242", "BookValue": "8.674", "DividendPerShare": "0.5", "DividendYield": "0.0267", "EPS": "1.49", "RevenuePerShareTTM": "21.334", "ProfitMargin": "-0.739", "OperatingMarginTTM": "0.0793", "ReturnOnAssetsTTM": "0.0254", "ReturnOnEquityTTM": "-0.8958", "RevenueTTM": "29578999808", "GrossProfitTTM": "4197000000", "DilutedEPSTTM": "-15.766", "QuarterlyEarningsGrowthYOY": "-0.374", "QuarterlyRevenueGrowthYOY": "-0.352", "AnalystTargetPrice": "23.58", "TrailingPE": "0", "ForwardPE": "48.7805", "PriceToSalesRatioTTM": "0.8766", "PriceToBookRatio": "2.1559", "EVToRevenue": "1.3433", "EVToEBITDA": "0", "Beta": "2.0879", "52WeekHigh": "41.14", "52WeekLow": "11.87", "50DayMovingAverage": "19.1767", "200DayMovingAverage": "19.2834", "SharesOutstanding": "1388099968", "SharesFloat": "1384520441", "SharesShort": "18829102", "SharesShortPriorMonth": "19504482", "ShortRatio": "1.58", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0136", "PercentInsiders": "0.166", "PercentInstitutions": "79.7", "ForwardAnnualDividendRate": "0.5", "ForwardAnnualDividendYield": "0.0267", "PayoutRatio": "0", "DividendDate": "2020-10-08", "ExDividendDate": "2020-09-01", "LastSplitFactor": "2:1", "LastSplitDate": "2006-04-10"}