{"Symbol": "SPG", "AssetType": "Common Stock", "Name": "Simon Property Group, Inc", "Description": "Spark Power Group Inc. provides electrical power services and solutions in North America. The company operates through Technical Services, Power Equipment, and Power Advisory & Sustainability segments. The Technical Services segment offers low-voltage technical services, including electrical contracting, custom control panel design and assembly, industrial automation, and electronic repair under the New Electric and 3-Phase brands; medium and high voltage technical services, such as medium and high voltage management, power ?on', commissioning, sub-station construction, power line construction and maintenance, equipment installation, power systems engineering, insulating fluid lab, and thermography under the Pelikan, Rondar, Tal Trees, Tiltran, and Orbis Engineering brands; and renewables operations and maintenance services comprising solar photovoltaics, monitoring and performance analytics, wind power, and battery energy storage solutions under the Northwind and One Wind brands. The Power Equipment segment engages in buying, selling, and renting new and used electrical equipment primarily in the medium and high voltage product categories under the Lizco brand; and sells control panels under the New Electric and Orbis brands. The Power Advisory & Sustainability segment offers renewable energy solutions services under the Bullfrog brand; integrated power solutions, including power planning, generation infrastructure, systems management, and innovation and future grid strategies; community power; and asset management services. The company serves approximately 6,500 industrial, commercial, institutional, renewable, and agricultural customers, as well as utility markets, including municipalities, universities, schools, and hospitals. Spark Power Group Inc. is headquartered in Oakville, Canada.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Real Estate", "Industry": "REITRetail", "Address": "225 West Washington Street, Indianapolis, IN, United States, 46204", "FullTimeEmployees": "0", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "21363705856", "EBITDA": "3909026048", "PERatio": "11.8752", "PEGRatio": "4.0799", "BookValue": "6.496", "DividendPerShare": "5.2", "DividendYield": "0.077", "EPS": "5.692", "RevenuePerShareTTM": "17.385", "ProfitMargin": "0.0162", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0.0491", "ReturnOnEquityTTM": "0.1053", "RevenueTTM": "5330570752", "GrossProfitTTM": "64159633", "DilutedEPSTTM": "5.692", "QuarterlyEarningsGrowthYOY": "-0.481", "QuarterlyRevenueGrowthYOY": "0.047", "AnalystTargetPrice": "85.71", "TrailingPE": "11.8752", "ForwardPE": "18.9753", "PriceToSalesRatioTTM": "3.8941", "PriceToBookRatio": "10.4018", "EVToRevenue": "8.4942", "EVToEBITDA": "10.8661", "Beta": "1.2907", "52WeekHigh": "163.605", "52WeekLow": "42.25", "50DayMovingAverage": "64.3592", "200DayMovingAverage": "72.9819", "SharesOutstanding": "305887008", "SharesFloat": "26946609", "SharesShort": "27464005", "SharesShortPriorMonth": "27973728", "ShortRatio": "4.77", "ShortPercentOutstanding": "0.09", "ShortPercentFloat": "0.1181", "PercentInsiders": "56.262", "PercentInstitutions": "0.557", "ForwardAnnualDividendRate": "5.2", "ForwardAnnualDividendYield": "0.077", "PayoutRatio": "1.1072", "DividendDate": "2020-07-24", "ExDividendDate": "2020-07-09", "LastSplitFactor": "1063:1000", "LastSplitDate": "2014-05-29"}