{"Symbol": "TFX", "AssetType": "Common Stock", "Name": "Teleflex Incorporated", "Description": "Teleflex Incorporated designs, develops, manufactures, and supplies single-use medical devices for common diagnostic and therapeutic procedures in critical care and surgical applications worldwide. It provides vascular access products that comprise Arrow branded catheters and related devices, including catheter positioning systems for use in the administration of intravenous therapies, the measurement of blood pressure, and the withdrawal of blood samples through a single puncture site. The company also offers interventional products consist of various coronary catheters, structural heart therapies, and peripheral intervention and cardiac assist products that are used by interventional cardiologists and radiologists, and vascular surgeons; and Arrow branded catheters, Guideline and Trapliner catheters, the Manta Vascular Closure, and Arrow Oncontrol devices. It provides anesthesia products, such as airway and pain management products to support hospital, emergency medicine, and military channels; and surgical products, including metal and polymer ligation clips, and fascial closure surgical systems that are used in laparoscopic surgical procedures, percutaneous surgical systems, and other surgical instruments. The company also offers interventional urology product comprises the UroLift System, an invasive technology for treating lower urinary tract symptoms due to benign prostatic hyperplasia; and respiratory products, including oxygen and aerosol therapies, spirometry, and ventilation management products for use in various care settings. It provides urology products, such as catheters, urine collectors, and catheterization accessories and products for operative endourology; and bladder management for patients in the hospital and individuals in the home care markets. The company serves hospitals and healthcare providers, medical device manufacturers, and home care markets. The company was founded in 1943 and is headquartered in Wayne, Pennsylvania.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "550 East Swedesford Road, Wayne, PA, United States, 19087-1603", "FullTimeEmployees": "14400", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17909590016", "EBITDA": "680712000", "PERatio": "37.4291", "PEGRatio": "2.03", "BookValue": "66.67", "DividendPerShare": "1.36", "DividendYield": "0.0036", "EPS": "10.158", "RevenuePerShareTTM": "54.518", "ProfitMargin": "0.1899", "OperatingMarginTTM": "0.1824", "ReturnOnAssetsTTM": "0.044", "ReturnOnEquityTTM": "0.1664", "RevenueTTM": "2526947072", "GrossProfitTTM": "1491612000", "DilutedEPSTTM": "10.158", "QuarterlyEarningsGrowthYOY": "-0.864", "QuarterlyRevenueGrowthYOY": "-0.131", "AnalystTargetPrice": "426.1", "TrailingPE": "37.4291", "ForwardPE": "37.037", "PriceToSalesRatioTTM": "7.1052", "PriceToBookRatio": "5.711", "EVToRevenue": "7.7719", "EVToEBITDA": "30.0659", "Beta": "0.9896", "52WeekHigh": "405.07", "52WeekLow": "221.27", "50DayMovingAverage": "376.6264", "200DayMovingAverage": "349.1456", "SharesOutstanding": "46516000", "SharesFloat": "46374156", "SharesShort": "681171", "SharesShortPriorMonth": "669850", "ShortRatio": "3.88", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.019", "PercentInsiders": "0.3", "PercentInstitutions": "94.924", "ForwardAnnualDividendRate": "1.36", "ForwardAnnualDividendYield": "0.0036", "PayoutRatio": "0.1339", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-13", "LastSplitFactor": "2:1", "LastSplitDate": "1997-06-17"}