{"Symbol": "TDG", "AssetType": "Common Stock", "Name": "TransDigm Group Incorporated", "Description": "TransDigm Group Incorporated designs, produces, and supplies aircraft components in the United States and internationally. The company operates through three segments: Power & Control, Airframe, and Non-aviation. The Power & Control segment offers mechanical/electro-mechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, databus and power controls, sensor products, switches and relay panels, hoists, winches and lifting devices, and cargo loading and handling systems. This segment serves engine and power system and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies, and repair depots. The Airframe segment provides engineered latching and locking devices, rods and locking devices, engineered connectors and elastomers, cockpit security components and systems, aircraft audio systems, specialized lavatory components, seat belts and safety restraints, engineered interior surfaces and related components, thermal protection products, lighting and control technology, military personnel parachutes, and cargo delivery systems. This segment serves airframe manufacturers, cabin system and subsystem suppliers, airlines, third party maintenance suppliers, military buying agencies, and repair depots. The Non-aviation segment offers seat belts and safety restraints for ground transportation applications, mechanical/electro-mechanical actuators and controls for space applications, and refueling systems for heavy equipment, as well as hydraulic/electromechanical actuators and fuel valves for land based gas turbines. This segment serves off-road vehicle and subsystem suppliers, child restraint system suppliers, and satellite and space system suppliers; and manufacturers of heavy equipment. TransDigm Group Incorporated was founded in 1993 and is headquartered in Cleveland, Ohio.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "The Tower at Erieview, Cleveland, OH, United States, 44114", "FullTimeEmployees": "18300", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "27470125056", "EBITDA": "2387438080", "PERatio": "47.6861", "PEGRatio": "2.4096", "BookValue": "-24.794", "DividendPerShare": "None", "DividendYield": "0.2163", "EPS": "12.117", "RevenuePerShareTTM": "95.835", "ProfitMargin": "0.1762", "OperatingMarginTTM": "0.3818", "ReturnOnAssetsTTM": "0.0728", "ReturnOnEquityTTM": "0", "RevenueTTM": "5471202816", "GrossProfitTTM": "2899298000", "DilutedEPSTTM": "12.117", "QuarterlyEarningsGrowthYOY": "0.549", "QuarterlyRevenueGrowthYOY": "-0.328", "AnalystTargetPrice": "470.71", "TrailingPE": "47.6861", "ForwardPE": "42.735", "PriceToSalesRatioTTM": "5.1998", "PriceToBookRatio": "0", "EVToRevenue": "7.7683", "EVToEBITDA": "18.1763", "Beta": "1.4516", "52WeekHigh": "673.51", "52WeekLow": "200.06", "50DayMovingAverage": "459.38", "200DayMovingAverage": "427.411", "SharesOutstanding": "54206300", "SharesFloat": "53635486", "SharesShort": "2671249", "SharesShortPriorMonth": "2691658", "ShortRatio": "6.61", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.066", "PercentInsiders": "1.072", "PercentInstitutions": "100.885", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0.2163", "PayoutRatio": "0", "DividendDate": "2020-01-07", "ExDividendDate": "2019-12-27", "LastSplitFactor": "None", "LastSplitDate": "None"}