{"Symbol": "UNH", "AssetType": "Common Stock", "Name": "UnitedHealth Group Incorporated", "Description": "UnitedHealth Group Incorporated operates as a diversified health care company in the United States. It operates through four segments: UnitedHealthcare, OptumHealth, OptumInsight, and OptumRx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health and well-being services to individuals age 50 and older, addressing their needs for preventive and acute health care services, as well as services dealing with chronic disease and other specialized issues for older individuals; Medicaid plans, Children's Health Insurance Program, and health care programs; medical and dental benefits; and health care delivery. The OptumHealth segment provides access to networks of care provider specialists, health management services, care delivery, consumer engagement, and financial services. This segment serves individuals through programs offered by employers, payers, government entities, and directly with the care delivery systems. The OptumInsight segment offers software and information products, advisory consulting arrangements, and services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The OptumRx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and compounding pharmacy, and purchasing and clinical, as well as develops programs in areas, such as step therapy, formulary management, drug adherence, and disease/drug therapy management. UnitedHealth Group Incorporated was incorporated in 1977 and is based in Minnetonka, Minnesota.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Healthcare Plans", "Address": "UnitedHealth Group Center, Minnetonka, MN, United States, 55343", "FullTimeEmployees": "325000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "298757128192", "EBITDA": "26492000256", "PERatio": "17.5194", "PEGRatio": "1.5721", "BookValue": "66.973", "DividendPerShare": "5", "DividendYield": "0.016", "EPS": "17.79", "RevenuePerShareTTM": "261.266", "ProfitMargin": "0.069", "OperatingMarginTTM": "0.0982", "ReturnOnAssetsTTM": "0.0846", "ReturnOnEquityTTM": "0.2762", "RevenueTTM": "247810998272", "GrossProfitTTM": "57598000000", "DilutedEPSTTM": "17.79", "QuarterlyEarningsGrowthYOY": "1.02", "QuarterlyRevenueGrowthYOY": "0.025", "AnalystTargetPrice": "344.8", "TrailingPE": "17.5194", "ForwardPE": "19.084", "PriceToSalesRatioTTM": "1.2172", "PriceToBookRatio": "4.6553", "EVToRevenue": "1.2861", "EVToEBITDA": "11.6362", "Beta": "0.7121", "52WeekHigh": "324.57", "52WeekLow": "187.72", "50DayMovingAverage": "309.4275", "200DayMovingAverage": "287.1458", "SharesOutstanding": "950336000", "SharesFloat": "944548217", "SharesShort": "5467396", "SharesShortPriorMonth": "5044002", "ShortRatio": "1.92", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0058", "PercentInsiders": "0.715", "PercentInstitutions": "89.916", "ForwardAnnualDividendRate": "5", "ForwardAnnualDividendYield": "0.016", "PayoutRatio": "0.2524", "DividendDate": "2020-09-22", "ExDividendDate": "2020-09-11", "LastSplitFactor": "2:1", "LastSplitDate": "2005-05-31"}