{"Symbol": "VLO", "AssetType": "Common Stock", "Name": "Valero Energy Corporation", "Description": "Valero Energy Corporation manufactures and sells transportation fuels and petrochemical products in the United States, Canada, the United Kingdom, Ireland, and internationally. It operates through three segments: Refining, Ethanol, and Renewable Diesel. The company is involved in oil and gas refining, marketing, and bulk selling activities. It produces conventional and premium gasolines, gasoline meeting the specifications of the California Air Resources Board (CARB), diesel fuels, low-sulfur and ultra-low-sulfur diesel fuels, CARB diesel, other distillates, jet fuels, asphalts, petrochemicals, lubricants, and other refined petroleum products. As of December 31, 2019, the company owned 15 petroleum refineries with a combined throughput capacity of approximately 3.15 million barrels per day. It markets its refined products through wholesale rack and bulk markets; and through approximately 7,000 outlets under the Valero, Beacon, Diamond Shamrock, Shamrock, Ultramar, and Texaco brand names. The company also produces and sells ethanol, distiller grains, and corn oil primarily to refiners and gasoline blenders, as well as to animal feed customers. It owns and operates 14 ethanol plants with a combined ethanol production capacity of approximately 1.73 billion gallons per year. In addition, the company owns, operates, develops, and acquires crude oil and refined petroleum products pipelines, terminals, and other transportation and logistics assets. Further, it owns and operates a plant that processes animal fats, used cooking oils, and other vegetable oils into renewable diesel. The company was formerly known as Valero Refining and Marketing Company and changed its name to Valero Energy Corporation in August 1997. Valero Energy Corporation was founded in 1980 and is headquartered in San Antonio, Texas.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Refining & Marketing", "Address": "One Valero Way, San Antonio, TX, United States, 78249", "FullTimeEmployees": "10222", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "22381780992", "EBITDA": "4470000128", "PERatio": "20.875", "PEGRatio": "0.82", "BookValue": "48.674", "DividendPerShare": "3.92", "DividendYield": "0.0734", "EPS": "2.602", "RevenuePerShareTTM": "202.252", "ProfitMargin": "0.013", "OperatingMarginTTM": "0.0263", "ReturnOnAssetsTTM": "0.0269", "ReturnOnEquityTTM": "0.073", "RevenueTTM": "82619998208", "GrossProfitTTM": "6531000000", "DilutedEPSTTM": "2.602", "QuarterlyEarningsGrowthYOY": "1.089", "QuarterlyRevenueGrowthYOY": "-0.651", "AnalystTargetPrice": "71.83", "TrailingPE": "20.875", "ForwardPE": "666.6667", "PriceToSalesRatioTTM": "0.2494", "PriceToBookRatio": "1.0979", "EVToRevenue": "0.3669", "EVToEBITDA": "7.0517", "Beta": "1.906", "52WeekHigh": "101.99", "52WeekLow": "31", "50DayMovingAverage": "54.8947", "200DayMovingAverage": "58.2879", "SharesOutstanding": "407756992", "SharesFloat": "406105857", "SharesShort": "8162105", "SharesShortPriorMonth": "7454003", "ShortRatio": "2.03", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0201", "PercentInsiders": "0.347", "PercentInstitutions": "80.828", "ForwardAnnualDividendRate": "3.92", "ForwardAnnualDividendYield": "0.0734", "PayoutRatio": "1.4688", "DividendDate": "2020-09-02", "ExDividendDate": "2020-08-03", "LastSplitFactor": "1094:1000", "LastSplitDate": "2013-05-02"}