{"Symbol": "VAR", "AssetType": "Common Stock", "Name": "Varian Medical Systems, Inc", "Description": "Varian Medical Systems, Inc. designs, manufactures, sells, and services medical devices and software products for treating cancer and other medical conditions worldwide. It operates in Oncology Systems and Proton Solutions segments. The Oncology Systems segment offers hardware and software products for treating cancer with radiotherapy, fixed field intensity-modulated radiation therapy, image-guided radiation therapy, volumetric modulated arc therapy, stereotactic radiosurgery, stereotactic body radiotherapy, and brachytherapy, as well as quality assurance equipment. Its products include linear accelerators, brachytherapy after loaders, treatment accessories, and quality assurance software; and information management, treatment planning, image processing, clinical knowledge exchange, patient care management, decision-making support, and practice management software. This segment serves university research and community hospitals, private and governmental institutions, healthcare agencies, physicians' offices, medical oncology practices, radiotherapy centers, and cancer care clinics. The Proton Solutions segment designs, develops, manufactures, sells, and services products and systems for delivering proton therapy for the treatment of cancer. The company has a strategic agreement with Siemens AG; and partnership agreement with Siemens AG, as well as with The National University Cancer Institute. Varian Medical Systems was formerly known as Varian Associates, Inc. and changed its name to Varian Medical Systems, Inc. in April 1999. The company was founded in 1948 and is headquartered in Palo Alto, California.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "3100 Hansen Way, Palo Alto, CA, United States, 94304", "FullTimeEmployees": "10000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "15710075904", "EBITDA": "537299968", "PERatio": "59.7743", "PEGRatio": "3.7143", "BookValue": "21.271", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.88", "RevenuePerShareTTM": "35.185", "ProfitMargin": "0.0824", "OperatingMarginTTM": "0.1373", "ReturnOnAssetsTTM": "0.0651", "ReturnOnEquityTTM": "0.1423", "RevenueTTM": "3196600064", "GrossProfitTTM": "1370300000", "DilutedEPSTTM": "2.88", "QuarterlyEarningsGrowthYOY": "1.094", "QuarterlyRevenueGrowthYOY": "-0.159", "AnalystTargetPrice": "177.64", "TrailingPE": "59.7743", "ForwardPE": "31.25", "PriceToSalesRatioTTM": "4.929", "PriceToBookRatio": "8.097", "EVToRevenue": "4.8705", "EVToEBITDA": "31.9953", "Beta": "1.106", "52WeekHigh": "176.19", "52WeekLow": "92.24", "50DayMovingAverage": "153.6306", "200DayMovingAverage": "127.2229", "SharesOutstanding": "90941104", "SharesFloat": "90649217", "SharesShort": "2925845", "SharesShortPriorMonth": "4089994", "ShortRatio": "1.64", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0362", "PercentInsiders": "0.383", "PercentInstitutions": "94.627", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "1998-12-02", "LastSplitFactor": "10000:8769", "LastSplitDate": "2017-01-30"}