{"Symbol": "VIAC", "AssetType": "Common Stock", "Name": "ViacomCBS Inc", "Description": "ViacomCBS Inc. operates as a media and entertainment company worldwide. The company operates in four segments: TV Entertainment, Cable Networks, Filmed Entertainment, and Publishing. The TV Entertainment segment distributes a schedule of news and public affairs broadcasts, and sports and entertainment programming; produces, acquires, and/or distributes programming, including series, specials, news, and public affairs; operates online content networks for information and entertainment; and streaming subscription services. This segment also operates CBS Sports Network, a 24/7 cable program service that provides college sports and related content, as well as broadcast television stations. The Cable Networks segment creates and acquires programming for distribution and viewing on various media platforms, including subscription cable networks, subscription streaming, basic cable networks, international broadcast networks, and free streaming TV platform, as well as for licensing to third parties. The Filmed Entertainment segment develops, produces, finances, acquires, and distributes films, television programming, and other entertainment content. The Publishing segment publishes and distributes adult and children's consumer books in printed, digital, and audio formats; develops special imprints and publishes titles based on the products of the company, as well as of third parties; and distributes products for other publishers. This segment also delivers content; and promotes its products on its Websites, social media, and general Internet sites, as well as those related to individual titles. The company was formerly known as CBS Corporation and changed its name to ViacomCBS Inc. in December 2019. ViacomCBS Inc. was founded in 1986 and is headquartered in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Entertainment", "Address": "1515 Broadway, New York, NY, United States, 10036", "FullTimeEmployees": "23990", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17400207360", "EBITDA": "4584000000", "PERatio": "13.0277", "PEGRatio": "1.0074", "BookValue": "None", "DividendPerShare": "0.96", "DividendYield": "0.034", "EPS": "6.9496", "RevenuePerShareTTM": "43.111", "ProfitMargin": "0.0516", "OperatingMarginTTM": "0.1575", "ReturnOnAssetsTTM": "0.0696", "ReturnOnEquityTTM": "0.1642", "RevenueTTM": "26513000448", "GrossProfitTTM": "10589000000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "-0.509", "QuarterlyRevenueGrowthYOY": "-0.122", "AnalystTargetPrice": "26.46", "TrailingPE": "13.0277", "ForwardPE": "7.6628", "PriceToSalesRatioTTM": "0.6579", "PriceToBookRatio": "1.2553", "EVToRevenue": "1.402", "EVToEBITDA": "10.4382", "Beta": "1.8978", "52WeekHigh": "44.935", "52WeekLow": "10.1", "50DayMovingAverage": "25.9842", "200DayMovingAverage": "21.5037", "SharesOutstanding": "563771008", "SharesFloat": "549653638", "SharesShort": "76418885", "SharesShortPriorMonth": "61429011", "ShortRatio": "9.09", "ShortPercentOutstanding": "0.15", "ShortPercentFloat": "0.1659", "PercentInsiders": "4.359", "PercentInstitutions": "82.695", "ForwardAnnualDividendRate": "0.96", "ForwardAnnualDividendYield": "0.034", "PayoutRatio": "0.4147", "DividendDate": "2020-10-01", "ExDividendDate": "2020-09-14", "LastSplitFactor": "None", "LastSplitDate": "None"}