{"Symbol": "WLTW", "AssetType": "Common Stock", "Name": "Willis Towers Watson Public Limited Company", "Description": "Willis Towers Watson Public Limited Company operates as an advisory, broking, and solutions company worldwide. The company's Human Capital and Benefits segment offers actuarial support, plan design, and administrative services for traditional pension and retirement savings plans; plan management consulting, broking, and administration services for health and group benefit programs; and benefits outsourcing services. It also provides advice, data, software, and products to address clients' total rewards and talent issues. Its Corporate Risk and Broking segment offers risk advice, insurance brokerage, and consulting services in the areas of property and casualty, financial lines, and transport. The company's Investment, Risk and Reinsurance segment offers capital markets-based products to insurance and reinsurance companies; software and technology, risk and capital management, products and pricing, financial and regulatory reporting, financial and capital modeling, merger and acquisition, outsourcing, and business management services; investment advice and solutions to pension funds and institutional investors; wholesale insurance broking services to retail and wholesale brokers; and underwriting and capital management, capital market, and advisory and brokerage services. Its Benefits Delivery and Administration segment provides primary medical and ancillary benefit exchange, and outsourcing services to active employees and retirees in the group and individual markets. This segment delivers healthcare and reimbursement accounts, including health savings accounts, health reimbursement arrangements, flexible spending accounts, and other consumer-directed accounts. The company was formerly known as Willis Group Holdings Public Limited Company and changed its name to Willis Towers Watson Public Limited Company in January 2016. Willis Towers Watson Public Limited Company was founded in 1828 and is based in London, the United Kingdom.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Insurance Brokers", "Address": "51 Lime Street, London, United Kingdom, EC3M 7DQ", "FullTimeEmployees": "45000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "26500937728", "EBITDA": "2201999872", "PERatio": "25.7433", "PEGRatio": "0.8935", "BookValue": "80.264", "DividendPerShare": "2.72", "DividendYield": "0.0132", "EPS": "7.83", "RevenuePerShareTTM": "71.215", "ProfitMargin": "0.11", "OperatingMarginTTM": "0.1778", "ReturnOnAssetsTTM": "0.0281", "ReturnOnEquityTTM": "0.1011", "RevenueTTM": "9258000384", "GrossProfitTTM": "4024000000", "DilutedEPSTTM": "7.83", "QuarterlyEarningsGrowthYOY": "-0.321", "QuarterlyRevenueGrowthYOY": "0.032", "AnalystTargetPrice": "228.23", "TrailingPE": "25.7433", "ForwardPE": "17.2414", "PriceToSalesRatioTTM": "2.8304", "PriceToBookRatio": "2.5132", "EVToRevenue": "1.6729", "EVToEBITDA": "6.5599", "Beta": "0.811", "52WeekHigh": "219.13", "52WeekLow": "143.34", "50DayMovingAverage": "204.14", "200DayMovingAverage": "193.997", "SharesOutstanding": "128858000", "SharesFloat": "128189639", "SharesShort": "2821197", "SharesShortPriorMonth": "3427975", "ShortRatio": "4.21", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0277", "PercentInsiders": "0.339", "PercentInstitutions": "92.541", "ForwardAnnualDividendRate": "2.72", "ForwardAnnualDividendYield": "0.0132", "PayoutRatio": "0.3397", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-29", "LastSplitFactor": "3775:10000", "LastSplitDate": "2016-01-05"}