{"Symbol": "WYNN", "AssetType": "Common Stock", "Name": "Wynn Resorts, Limited", "Description": "Wynn Resorts, Limited designs, develops, and operates integrated resorts. The company's Wynn Palace segment operates 424,000 square feet of casino space with 323 table games, 1,011 slot machines, private gaming salons, and sky casinos; a luxury hotel towers with 1,706 guest rooms, suites, and villas, including a health club, spa, salon, and pool; 14 food and beverage outlets; 106,000 square feet of retail space; 37,000 square feet of meeting and convention space; and performance lake and floral art displays. Its Wynn Macau segment operates 252,000 square feet of casino space with 322 table games, 838 slot machines, private gaming salons, sky casinos, and a poker room; two luxury hotel with 1,010 guest rooms and suites that include two health clubs, two spas, a salon, and a pool; 12 food and beverage outlets; 59,000 square feet of retail space; 31,000 square feet of meeting and convention space; and Chinese zodiac-inspired ceiling attractions. The company's Las Vegas Operations segment operates 192,000 square feet of casino space with 232 table games, 1,756 slot machines, private gaming salons, a sky casino, a poker room, and a race and sports book; two luxury hotel towers with a total of 4,748 guest rooms, suites, and villas, including swimming pools, private cabanas, two full service spas and salons, and a wedding chapel; 33 food and beverage outlets; 507,000 square feet of meeting and convention space; 160,000 square feet of retail space; and two theaters, three nightclubs and a beach club. Its Encore Boston Harbor segment operates 210,000 square feet of casino space with 161 table games, 2,833 slot machines, gaming areas, and a poker room; a hotel tower, including 671 guest rooms and suites; 16 food and beverage outlets and a nightclub; 8,000 square feet of retail space; 71,000 square feet of meeting and convention space; and a waterfront park, floral displays, and water shuttle service. The company was founded in 2002 and is based in Las Vegas, Nevada.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Resorts & Casinos", "Address": "3131 Las Vegas Boulevard South, Las Vegas, NV, United States, 89109", "FullTimeEmployees": "30200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "9873484800", "EBITDA": "339163008", "PERatio": "52.913", "PEGRatio": "0.5285", "BookValue": "5.783", "DividendPerShare": "4", "DividendYield": "0.0505", "EPS": "6.16", "RevenuePerShareTTM": "40.691", "ProfitMargin": "-0.2571", "OperatingMarginTTM": "-0.0815", "ReturnOnAssetsTTM": "-0.0158", "ReturnOnEquityTTM": "-1.1065", "RevenueTTM": "4340635136", "GrossProfitTTM": "4784046000", "DilutedEPSTTM": "-10.462", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.948", "AnalystTargetPrice": "97.47", "TrailingPE": "52.913", "ForwardPE": "11.3895", "PriceToSalesRatioTTM": "2.1285", "PriceToBookRatio": "15.0617", "EVToRevenue": "4.2535", "EVToEBITDA": "52.1573", "Beta": "2.4187", "52WeekHigh": "153.41", "52WeekLow": "35.84", "50DayMovingAverage": "79.9964", "200DayMovingAverage": "82.9354", "SharesOutstanding": "107848000", "SharesFloat": "96290347", "SharesShort": "9707454", "SharesShortPriorMonth": "9677277", "ShortRatio": "2.06", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1129", "PercentInsiders": "9.706", "PercentInstitutions": "79.204", "ForwardAnnualDividendRate": "4", "ForwardAnnualDividendYield": "0.0505", "PayoutRatio": "3.2609", "DividendDate": "2020-03-06", "ExDividendDate": "2020-02-25", "LastSplitFactor": "None", "LastSplitDate": "None"}