{"Symbol": "XYL", "AssetType": "Common Stock", "Name": "Xylem Inc", "Description": "Xylem Inc. engages in the design, manufacture, and servicing of engineered products and solutions for the water and wastewater applications in the United States, Europe, the Asia Pacific, and internationally. It operates in three segments: Water Infrastructure, Applied Water, and Measurement & Control Solutions. The Water Infrastructure segment offers various products, including water and wastewater pumps; controls and systems; filtration, disinfection, and biological treatment equipment; and mobile dewatering equipment under the Flygt, Godwin, Wedeco, Sanitaire, and Leopold names for the transportation and treatment of water. The Applied Water segment provides pumps, valves, heat exchangers, controls, and dispensing equipment systems under the Goulds Water Technology, Bell & Gossett, A-C Fire Pump, Standard Xchange, Lowara, Jabsco, and Flojet brand names for residential and commercial building services, and industrial water applications. The Measurement & Control Solutions segment provides smart metering, networked communications, and measurement and control technologies, as well as critical infrastructure technologies that allow customers to use their distribution networks for the delivery, monitoring, and control of critical resources, such as water, electricity, and natural gas. It also offers software and services, including cloud-based analytics, remote monitoring, data management, leak detection, and pressure monitoring solutions and testing equipment, as well as sells smart lighting solutions. This segment sells its products under the EmNet, Pure, Sensus, Smith Blair, Visenti, WTW, and YSI brand names. The company markets and sells its products through a network of direct sales force, resellers, distributors, and value-added solution providers. Xylem Inc. is headquartered in Rye Brook, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "1 International Drive, Rye Brook, NY, United States, 10573", "FullTimeEmployees": "16000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14753040384", "EBITDA": "800000000", "PERatio": "58.4245", "PEGRatio": "4.3845", "BookValue": "15.867", "DividendPerShare": "1.04", "DividendYield": "0.0128", "EPS": "1.391", "RevenuePerShareTTM": "27.487", "ProfitMargin": "0.0509", "OperatingMarginTTM": "0.1099", "ReturnOnAssetsTTM": "0.0422", "ReturnOnEquityTTM": "0.0873", "RevenueTTM": "4950000128", "GrossProfitTTM": "2051000000", "DilutedEPSTTM": "1.391", "QuarterlyEarningsGrowthYOY": "-0.779", "QuarterlyRevenueGrowthYOY": "-0.138", "AnalystTargetPrice": "74.5", "TrailingPE": "58.4245", "ForwardPE": "42.9185", "PriceToSalesRatioTTM": "2.972", "PriceToBookRatio": "5.1171", "EVToRevenue": "3.3005", "EVToEBITDA": "28.9672", "Beta": "1.0659", "52WeekHigh": "89.34", "52WeekLow": "56.63", "50DayMovingAverage": "76.5356", "200DayMovingAverage": "71.2401", "SharesOutstanding": "179959008", "SharesFloat": "179140478", "SharesShort": "4640177", "SharesShortPriorMonth": "5007700", "ShortRatio": "4.49", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0292", "PercentInsiders": "0.993", "PercentInstitutions": "94.069", "ForwardAnnualDividendRate": "1.04", "ForwardAnnualDividendYield": "0.0128", "PayoutRatio": "0.7194", "DividendDate": "2020-09-24", "ExDividendDate": "2020-08-26", "LastSplitFactor": "None", "LastSplitDate": "None"}