{"Symbol": "ABAX", "AssetType": "Common Stock", "Name": "Abaxis, Inc", "Description": "Abaxis, Inc. develops, manufactures, markets, and sells portable blood analysis systems for use in human or veterinary patient care to provide rapid blood constituent measurements for clinicians worldwide. It operates in two segments, Medical Market and Veterinary Market. The company offers Piccolo chemistry analyzers with rapid blood constituent measurements for use in human patient care; and Piccolo profiles that are single-use medical reagents. It also provides VetScan VS2, a chemistry, electrolyte, immunoassay, and blood gas analyzer delivering results from a sample of whole blood, serum, or plasma; VetScan profiles, which are packaged as single-use plastic veterinary reagent discs; and VetScan HM5, VetScan HM2, VetScan HMII, and VetScan HMT hematology instruments, as well as reagent kits for veterinary applications. In addition, the company offers VetScan VSpro that assists the diagnosis and evaluation of suspected bleeding disorders, toxicity/poisoning, disseminated intravascular coagulation evaluation, hepatic disease, monitoring therapy, and disease progression states; VetScan VSpro coagulation test to evaluate prothrombin and the activated partial thromboplastin times; VetScan VSpro fibrinogen test for in-vitro determination of fibrinogen levels in equine platelet poor plasma from a citrated stabilized whole blood sample; i-STAT that delivers blood gas, electrolyte, chemistry, and hematology results; VetScan UA, a urinalysis solution; and VetScan SA, which is designed to perform urine microscopy. Further, it provides VetScan rapid tests for the detection of various diseases, as well as sells products developed through its patented Orbos discrete lyophilization process to companies for other applications. The company sells its products through direct sales force and independent distributors. Abaxis, Inc. was founded in 1989 and is headquartered in Union City, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "3240 Whipple Road\n94587,Union City,USA\n", "FullTimeEmployees": "656", "FiscalYearEnd": "March", "LatestQuarter": "None", "MarketCapitalization": "1898292992", "EBITDA": "46661000", "PERatio": "70.9402", "PEGRatio": "7.68", "BookValue": "12.807", "DividendPerShare": "0.72", "DividendYield": "0.0086", "EPS": "1.42", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "47.79", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}