{"Symbol": "ABCO", "AssetType": "Common Stock", "Name": "The Advisory Board Company", "Description": "The Advisory Board Company provides best practices research and insight, technology, consulting and management, and data-enabled services in the United States and internationally. Its best practices research and insight programs include published studies, executive education, proprietary databases and online services, access to experts, executive briefings, and other services. The company?s best practices research and insight programs are focused on understanding industry dynamics, identifying best-demonstrated management practices, critically evaluating widely-followed but ineffective practices, and analyzing emerging trends within the health care and education industries. It also offers cloud-based software applications that allow members to combine insights derived from best practices research with their operational and financial data and third-party and proprietary data to benchmark performance; identify and assess revenue, cost, quality, and performance improvement opportunities; and implement identified best practices. In addition, the company provides consulting services that provide on-the-ground support for performance improvement initiatives, as well as best practice professional management of the hospital or medical group areas. Further, it offers data-driven solutions by supporting colleges and universities in targeting qualified prospective students; building relationships with prospective students; and optimizing financial aid resources, as well as strategic, data-driven student engagement, and enrollment management solutions. The provides its services through discrete programs to hospitals, health systems, independent medical groups, pharmaceutical and biotechnology companies, health care insurers, medical device companies, colleges, universities, and other health care-focused organizations and educational institutions. The Advisory Board Company was founded in 1979 and is headquartered in Washington, District of Columbia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "2445 M Street, NW\n20037,Washington,USA\n", "FullTimeEmployees": "3800", "FiscalYearEnd": "March", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "1.81", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "54.36", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}