{"Symbol": "ABTL", "AssetType": "Common Stock", "Name": "Autobytel Inc", "Description": "Autobytel Inc. operates as an automotive marketing services company in the United States. It assists automotive retail dealers and manufacturers to market and sell new and used vehicles to consumers through its programs. The company?s products include new vehicle lead program, which allows consumers to submit requests for pricing and availability of specific makes and models; and used vehicle lead program that allows consumers to search for used vehicles, as well as finance leads program, which provides vehicle financing and other services from dealers or financial institutions. It owns and operates an automotive Website, Autobytel.com that offers consumers the information and tools to aid them with their automotive purchase decisions; and an automotive search engine that enables manufactures and dealers to optimize advertising campaigns. The company?s products and services also comprise iControl by Autobytel, which allows dealers various options to filter and control vehicle leads; WebLeads+ that offers various coupon options, which display marketing messages to consumers visiting the dealer's Website; Email Manager that provides follow up emails on behalf of the dealers to consumers who have submitted leads; and Lead Call, which provides a live phone call to the consumer on behalf of the dealers and schedules an appointment for the consumer to visit the dealership regarding the vehicle. In addition, it offers Payment Pro, a dealer Website conversion tool that offers consumers online monthly payment information; mobile products and services that facilitate communication between dealers and car buyers on smart phones and tablets; and SaleMove, which allows auto dealers and manufacturers to interact with consumer through live video, audio and text based chat, or phone, as well as sells fixed placement advertising across its Website. The company was formerly known as Autobytel.com Inc. Autobytel Inc. was founded in 1995 and is headquartered in Irvine, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "254", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "0.36", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "0.33", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "13.33", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}