{"Symbol": "ACGL", "AssetType": "Common Stock", "Name": "Arch Capital Group Ltd", "Description": "Arch Capital Group Ltd., together with its subsidiaries, provides insurance, reinsurance, and mortgage insurance products worldwide. The company's Insurance segment offers primary and excess casualty coverages; loss sensitive primary casualty insurance programs; collateral protection, debt cancellation, and service contract reimbursement products; directors' and officers' liability, errors and omissions liability, employment practices and fiduciary liability, crime, professional indemnity, and other financial related coverages; medical professional and general liability insurance coverages; and workers' compensation and umbrella liability, as well as commercial automobile and inland marine products. It also provides property, energy, marine, and aviation insurance; travel insurance; accident, disability, and medical plan insurance coverages; captive insurance programs; and contract and commercial surety coverages. This segment markets its products through a group of licensed independent retail and wholesale brokers. Its Reinsurance segment provides reinsurance for third party liability and workers' compensation exposures; marine and aviation reinsurance; surety, accident and health, workers' compensation catastrophe, agriculture, trade credit, and political risk products; reinsurance protection for catastrophic losses, and personal lines and commercial property exposures; life reinsurance; casualty clash; and risk management solutions. This segment markets its reinsurance products through brokers. The company's Mortgage segment offers private mortgage insurance covering one-to-four family residential mortgages; mortgage insurance to cover previously originated residential loans; quota share reinsurance; and credit risk-sharing products. This segment sells its products through direct basis and through brokers to mortgage originators. The company was founded in 1995 and is based in Pembroke, Bermuda.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceDiversified", "Address": "Waterloo House, Pembroke, Bermuda, HM 08", "FullTimeEmployees": "4300", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13100717056", "EBITDA": "1410800000", "PERatio": "11.9225", "PEGRatio": "2.24", "BookValue": "27.689", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.714", "RevenuePerShareTTM": "17.995", "ProfitMargin": "0.1602", "OperatingMarginTTM": "0.1842", "ReturnOnAssetsTTM": "0.022", "ReturnOnEquityTTM": "0.0888", "RevenueTTM": "7251876864", "GrossProfitTTM": "2953803000", "DilutedEPSTTM": "2.714", "QuarterlyEarningsGrowthYOY": "-0.366", "QuarterlyRevenueGrowthYOY": "0.288", "AnalystTargetPrice": "37.4", "TrailingPE": "11.9225", "ForwardPE": "31.6456", "PriceToSalesRatioTTM": "1.823", "PriceToBookRatio": "1.1699", "EVToRevenue": "2.2226", "EVToEBITDA": "0", "Beta": "0.7549", "52WeekHigh": "48.32", "52WeekLow": "22.06", "50DayMovingAverage": "31.0733", "200DayMovingAverage": "30.9881", "SharesOutstanding": "405972000", "SharesFloat": "359930964", "SharesShort": "3239810", "SharesShortPriorMonth": "3039105", "ShortRatio": "2.14", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0086", "PercentInsiders": "2.873", "PercentInstitutions": "88.744", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:1", "LastSplitDate": "2018-06-21"}