{"Symbol": "ACHC", "AssetType": "Common Stock", "Name": "Acadia Healthcare Company, Inc", "Description": "Acadia Healthcare Company, Inc. develops and operates inpatient psychiatric facilities, residential treatment centers, group homes, substance abuse facilities, and outpatient behavioral healthcare facilities to serve the behavioral health and recovery needs of communities in the United States, the United Kingdom, and Puerto Rico. The company operates acute inpatient psychiatric facilities, which cares to stabilize patients that are either threat to themselves or others by hourly observation, daily intervention, and monitoring by psychiatrists; and specialty treatment facilities, including residential recovery and eating disorder facilities, and comprehensive treatment centers that provide continuum care for adults with addictive disorders and co-occurring mental disorders. It also provides residential treatment centers, which treat patients with behavioral disorders in a non-hospital setting, including outdoor programs; and outpatient community-based services, such as community-based programs that are designed to offer therapeutic treatment to children and adolescents who have a clinically-defined emotional, psychiatric, or chemical dependency disorders. In addition, the company provides mental health rehabilitation services comprising relapse prevention and social integration services, as well as vocational opportunities; acute services for patients at risk to themselves or others, as well as crisis intervention and treatment of behavioral emergencies; and long-term and non-acute care services for adults suffering from mental illness, addiction, learning disability, or brain injury. Further, it provides education and children's services for children and young people with special educational needs; adult care services; and care first services for employees. As of December 31, 2019, the company operated a network of 585 behavioral healthcare facilities with 18,200 beds. The company was founded in 2005 and is headquartered in Franklin, Tennessee.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Care Facilities", "Address": "6100 Tower Circle, Franklin, TN, United States, 37067", "FullTimeEmployees": "28400", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2778317824", "EBITDA": "532383008", "PERatio": "24.95", "PEGRatio": "1.32", "BookValue": "28.48", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.201", "RevenuePerShareTTM": "35.225", "ProfitMargin": "0.0343", "OperatingMarginTTM": "0.1187", "ReturnOnAssetsTTM": "0.0337", "ReturnOnEquityTTM": "0.0434", "RevenueTTM": "3090604032", "GrossProfitTTM": "1267221000", "DilutedEPSTTM": "1.201", "QuarterlyEarningsGrowthYOY": "-0.163", "QuarterlyRevenueGrowthYOY": "-0.049", "AnalystTargetPrice": "34.46", "TrailingPE": "24.95", "ForwardPE": "14.2248", "PriceToSalesRatioTTM": "0.8529", "PriceToBookRatio": "1.064", "EVToRevenue": "1.9796", "EVToEBITDA": "13.1154", "Beta": "1.428", "52WeekHigh": "35.3", "52WeekLow": "11.09", "50DayMovingAverage": "29.4506", "200DayMovingAverage": "26.1885", "SharesOutstanding": "88963104", "SharesFloat": "81687730", "SharesShort": "8544493", "SharesShortPriorMonth": "8898442", "ShortRatio": "16.01", "ShortPercentOutstanding": "0.09", "ShortPercentFloat": "0.1312", "PercentInsiders": "1.548", "PercentInstitutions": "119.206", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:4", "LastSplitDate": "2011-11-01"}