{"Symbol": "ACIW", "AssetType": "Common Stock", "Name": "ACI Worldwide, Inc", "Description": "ACI Worldwide, Inc. develops, markets, installs, and supports a range of software products and solutions for facilitating electronic payments to banks, financial intermediaries, merchants, and billers worldwide. The company offers UP Retail Payments solution that enables banks and financial intermediaries to accept, authorize, route, and secure payment transactions; and ACI Card and Merchant Management solutions, such as credit, debit, smart card, and prepaid card issuance and management, as well as merchant account management and settlement. It also provides UP Immediate Payments solution that enables banks and payment service providers to meet real-time payment schemes and create various products; and UP Real-Time Payments solution that allows banks to address real-time gross settlement, SWIFT messaging, automated clearing house, and real-time payments. The company offers ACI ReD Shield, a real-time fraud prevention solution; Postilion; ACI PAY.ON Payments Gateway; UP eCommerce Payments solution; UP Payments Risk Management solution; and ACI Universal Online Banker platform. It also provides ACI Speedpay solutions that enable customers to electronically present bills and collect payments from consumers through a single and integrated platform that controls bill payments operation. The company offers electronic bill presentment and payment services to consumer finance, insurance, healthcare, higher education, utility, government, and mortgage sectors; implementation services, including product installations and configurations, and custom software modifications; and business and technical consultancy, and on-site support services, as well as distributes or acts as a sales agent for software developed by third parties. It markets its products under the ACI brand. The company was formerly known as Transaction Systems Architects, Inc. and changed its name to ACI Worldwide, Inc. in July 2007. The company was founded in 1975 and is headquartered in Naples, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "3520 Kraft Road, Naples, FL, United States, 34105", "FullTimeEmployees": "4018", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3471883776", "EBITDA": "251139008", "PERatio": "45.7231", "PEGRatio": "-3.24", "BookValue": "9.373", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.649", "RevenuePerShareTTM": "11.601", "ProfitMargin": "0.0572", "OperatingMarginTTM": "0.141", "ReturnOnAssetsTTM": "0.036", "ReturnOnEquityTTM": "0.0718", "RevenueTTM": "1346215936", "GrossProfitTTM": "640841000", "DilutedEPSTTM": "0.649", "QuarterlyEarningsGrowthYOY": "1.444", "QuarterlyRevenueGrowthYOY": "0.008", "AnalystTargetPrice": "37.33", "TrailingPE": "45.7231", "ForwardPE": "56.1798", "PriceToSalesRatioTTM": "2.6147", "PriceToBookRatio": "3.1713", "EVToRevenue": "3.486", "EVToEBITDA": "13.9734", "Beta": "1.3104", "52WeekHigh": "39.37", "52WeekLow": "20.03", "50DayMovingAverage": "28.6678", "200DayMovingAverage": "27.3017", "SharesOutstanding": "116389000", "SharesFloat": "113255767", "SharesShort": "5670340", "SharesShortPriorMonth": "5261928", "ShortRatio": "7.06", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0529", "PercentInsiders": "2.783", "PercentInstitutions": "100.244", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:1", "LastSplitDate": "2014-07-11"}