{"Symbol": "ACNB", "AssetType": "Common Stock", "Name": "ACNB Corporation", "Description": "ACNB Corporation, a financial holding company, provides banking, insurance, and financial services to individual, business, and government customers in the United States. The company offers checking, savings, and money market deposit accounts, as well as time deposits and debit cards. It also provides commercial lending products, such as commercial mortgages, real estate development and construction loans, accounts receivable and inventory financing, and agricultural and governmental loans; consumer lending products comprising home equity loans and lines of credit, automobile and recreational vehicle loans, manufactured housing loans, and personal lines of credit; and mortgage lending programs consisting of personal residential mortgages, and residential construction and investment mortgage loans. In addition, the company provides estate settlement services; other services that are related to testamentary trusts, life insurance trusts, charitable remainder trusts, guardianships, powers of attorney, custodial accounts, and investment management and advisory accounts; and retail brokerage services. Further, it acts as a trustee to invest in, protect, manage, and distribute financial assets. Additionally, the company offers property and casualty, group life, and health insurance products to commercial and individual clients; and online, telephone, and mobile banking, as well as automated teller machine services. ACNB Corporation operates through a network of 22 community banking offices located in Adams, Cumberland, Franklin, and York counties, southcentral Pennsylvania; 7 community banking offices located in Carroll county, Maryland; and loan offices located in Lancaster and York, Pennsylvania, and Hunt Valley, Maryland. The company was founded in 1857 and is headquartered in Gettysburg, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "16 Lincoln Square, Gettysburg, PA, United States, 17325", "FullTimeEmployees": "374", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "193917232", "EBITDA": "None", "PERatio": "10.5187", "PEGRatio": "0", "BookValue": "29.001", "DividendPerShare": "1", "DividendYield": "0.0444", "EPS": "2.04", "RevenuePerShareTTM": "9.863", "ProfitMargin": "0.2069", "OperatingMarginTTM": "0.3644", "ReturnOnAssetsTTM": "0.0078", "ReturnOnEquityTTM": "0.0737", "RevenueTTM": "77176000", "GrossProfitTTM": "76987000", "DilutedEPSTTM": "2.04", "QuarterlyEarningsGrowthYOY": "-0.271", "QuarterlyRevenueGrowthYOY": "0.052", "AnalystTargetPrice": "None", "TrailingPE": "10.5187", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.3289", "PriceToBookRatio": "0.7762", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "-0.0379", "52WeekHigh": "37.87", "52WeekLow": "20.05", "50DayMovingAverage": "22.5144", "200DayMovingAverage": "25.4526", "SharesOutstanding": "8695840", "SharesFloat": "8358353", "SharesShort": "81453", "SharesShortPriorMonth": "37728", "ShortRatio": "4.48", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0081", "PercentInsiders": "3.364", "PercentInstitutions": "22.207", "ForwardAnnualDividendRate": "1", "ForwardAnnualDividendYield": "0.0444", "PayoutRatio": "0.4673", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-28", "LastSplitFactor": "105:100", "LastSplitDate": "2007-11-28"}