{"Symbol": "ACXM", "AssetType": "Common Stock", "Name": "Acxiom Holdings, Inc", "Description": "Acxiom Corporation operates a technology and enablement services company in the United States, Europe, the Asia-Pacific, and internationally. The company operates through three segments: Connectivity, Audience Solutions, and Marketing Services. The Connectivity segment provides a foundational identity resolution layer, which enables its clients to identify and reach consumers across channels and measure the impact of marketing on sales. This segment offers LiveRamp IdentityLink, an identity resolution service that ties data back to real people and makes it possible to onboard that data for people-based marketing initiatives across digital channels. Its IdentityLink serves brands and agencies, marketing technology providers, data owners, and publishers. The Audience Solutions segment offers consumer demographics products, including InfoBase products to marketers with the ability to identify and reach the right audience with the right message across traditional and digital channels; and AbiliTec, which enables brands recognize individuals and households using various types of input variables and connect identities online and offline. The Marketing Services segment offers marketing database services, and strategy and analytics. The company serves companies and organizations in the financial services, insurance, information services, direct marketing, retail, consumer packaged goods, technology, automotive, healthcare, travel, and communications industries, as well as in the non-profit and government sectors. Acxiom Corporation was founded in 1969 and is headquartered in Conway, Arkansas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "3380", "FiscalYearEnd": "March", "LatestQuarter": "None", "MarketCapitalization": "3765077760", "EBITDA": "96579000", "PERatio": "177.5824", "PEGRatio": "1.45", "BookValue": "9.356", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-0.02", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "32.4", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}