{"Symbol": "ADI", "AssetType": "Common Stock", "Name": "Analog Devices, Inc", "Description": "Analog Devices, Inc. designs, manufactures, and markets integrated circuits (ICs), algorithms, software, and subsystems that leverage analog, mixed-signal, and digital signal processing technologies. The company offers data converter products, which translate real-world analog signals into digital data, as well as translates digital data into analog signals; high-performance amplifiers to condition analog signals; and radio frequency and microwave ICs to support cellular infrastructure. It also provides power management and reference products for power management and conversion applications in the automotive, communications, industrial, and high-end consumer markets; and microelectromechanical systems technology solutions, including accelerometers used to sense acceleration, gyroscopes to sense rotation, and inertial measurement units to sense multiple degrees of freedom. In addition, the company offers isolators for various applications, such as universal serial bus isolation in patient monitors; and smart metering and satellite applications, as well as digital signal processing products for high-speed numeric calculations. The company serves clients in industrial, automotive, consumer, and communications markets through a direct sales force, third-party distributors, and independent sales representatives in the United States, the rest of North and South America, Europe, Japan, China, and the rest of Asia, as well as through its Website. It has a strategic collaboration with Pinpoint Science Inc. to advance the development and manufacture of novel nanosensor diagnostics. Analog Devices, Inc. was founded in 1965 and is headquartered in Norwood, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductors", "Address": "One Technology Way, Norwood, MA, United States, 02062", "FullTimeEmployees": "16400", "FiscalYearEnd": "October", "LatestQuarter": "2020-07-31", "MarketCapitalization": "44144873472", "EBITDA": "2298074880", "PERatio": "40.3043", "PEGRatio": "2.3607", "BookValue": "31.903", "DividendPerShare": "2.48", "DividendYield": "0.0208", "EPS": "2.99", "RevenuePerShareTTM": "14.977", "ProfitMargin": "0.2014", "OperatingMarginTTM": "0.2689", "ReturnOnAssetsTTM": "0.043", "ReturnOnEquityTTM": "0.0944", "RevenueTTM": "5519980032", "GrossProfitTTM": "4013750000", "DilutedEPSTTM": "2.99", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.016", "AnalystTargetPrice": "138.4", "TrailingPE": "40.3043", "ForwardPE": "21.322", "PriceToSalesRatioTTM": "8.1222", "PriceToBookRatio": "3.7774", "EVToRevenue": "8.8752", "EVToEBITDA": "22.3551", "Beta": "1.306", "52WeekHigh": "127.39", "52WeekLow": "79.075", "50DayMovingAverage": "117.055", "200DayMovingAverage": "110.6853", "SharesOutstanding": "369166016", "SharesFloat": "367752350", "SharesShort": "4451611", "SharesShortPriorMonth": "4918771", "ShortRatio": "3.69", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0363", "PercentInsiders": "0.326", "PercentInstitutions": "91.448", "ForwardAnnualDividendRate": "2.48", "ForwardAnnualDividendYield": "0.0208", "PayoutRatio": "0.7759", "DividendDate": "2020-09-09", "ExDividendDate": "2020-08-27", "LastSplitFactor": "2:1", "LastSplitDate": "2000-03-16"}