{"Symbol": "ADTN", "AssetType": "Common Stock", "Name": "ADTRAN, Inc", "Description": "ADTRAN, Inc. provides networking and communications equipment for service providers, cable/multiple system operators, and distributed enterprises in the United States and internationally. The company operates through Network Solutions, and Services & Support segments. It offers fiber to the premises and fiber to the node (FTTN) multi-service access nodes (MSAN); fiber aggregation and FTTN MSAN; network management and subscriber services control and orchestration software; software defined networking -controlled programmable network elements; fiber to the distribution point units; optical line terminals and transport solutions; optical networking edge aggregation; IP digital subscriber line access multiplexers; cabinet and outside-plant enclosures and services; transceivers, cables, and other miscellaneous materials; and other products, software, and services. The company also provides broadband customer premise solutions and point-to-point Ethernet optical network terminals; radio frequency over glass micro nodes; residential gateway products and accessories; Wi-Fi access points; ethernet switches for multi-gigabit local area networking; SmartOS software licensing for residential and enterprise gateway, and Wi-Fi devices; cloud-based SaaS management platforms; Wi-Fi-enabled residential gateway products and accessories; access points and virtual wireless local area networks for business-class Wi-Fi and management; and pre-sale and post-sale technical support. In addition, it offers planning, engineering, program management, maintenance, installation, and commissioning services. Further, the company offers time division multiplexed and asynchronous transfer mode based aggregation systems and customer devices; and high-bit-rate digital subscriber line, asymmetric digital subscriber line, and other technologies to deliver business and residential services. ADTRAN, Inc. was founded in 1985 and is headquartered in Huntsville, Alabama.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "901 Explorer Boulevard, Huntsville, AL, United States, 35806", "FullTimeEmployees": "1790", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "538088768", "EBITDA": "1229000", "PERatio": "114.75", "PEGRatio": "11.04", "BookValue": "7.594", "DividendPerShare": "0.36", "DividendYield": "0.0319", "EPS": "0.082", "RevenuePerShareTTM": "9.873", "ProfitMargin": "-0.1415", "OperatingMarginTTM": "-0.0782", "ReturnOnAssetsTTM": "-0.0398", "ReturnOnEquityTTM": "-0.1653", "RevenueTTM": "473116992", "GrossProfitTTM": "219952000", "DilutedEPSTTM": "-1.398", "QuarterlyEarningsGrowthYOY": "-0.804", "QuarterlyRevenueGrowthYOY": "-0.177", "AnalystTargetPrice": "13.9", "TrailingPE": "114.75", "ForwardPE": "112.3596", "PriceToSalesRatioTTM": "1.1425", "PriceToBookRatio": "1.4854", "EVToRevenue": "0.9783", "EVToEBITDA": "0", "Beta": "1.3692", "52WeekHigh": "12.91", "52WeekLow": "4.8", "50DayMovingAverage": "11.9689", "200DayMovingAverage": "10.0955", "SharesOutstanding": "47958000", "SharesFloat": "47472138", "SharesShort": "822602", "SharesShortPriorMonth": "857208", "ShortRatio": "3.13", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0294", "PercentInsiders": "1.104", "PercentInstitutions": "93.476", "ForwardAnnualDividendRate": "0.36", "ForwardAnnualDividendYield": "0.0319", "PayoutRatio": "0", "DividendDate": "2020-09-03", "ExDividendDate": "2020-08-19", "LastSplitFactor": "2:1", "LastSplitDate": "2003-12-16"}