{"Symbol": "AEIS", "AssetType": "Common Stock", "Name": "Advanced Energy Industries, Inc", "Description": "Advanced Energy Industries, Inc. designs, manufactures, sells, and supports precision power conversion, measurement, and control solutions worldwide. It offers process power solutions, including direct current (DC), pulsed DC, low frequency alternating current, high voltage, and radio frequency (RF) power supplies, as well as RF matching networks and remote plasma sources for reactive gas applications and RF instrumentation. The company also provides power control modules and thermal instrumentation products for rapid thermal processing, chemical vapor deposition, crystal growing, and other semiconductor and adjacent thin film applications, as well as in chemical processing, metal and glass manufacturing, and other general industrial power applications; and high voltage products for semiconductor wafer processing and metrology, electrostatic clamping of substrates, scientific instrumentation, mass spectrometry, and analytical X-ray systems for industrial and analytical applications. In addition, it offers gas detection and monitoring products for the automotive, energy, environmental control, aerospace, medical, and research industries; and embedded IEC 60601-1 for medical equipment or IEC 60950-1 for information technology equipment. Further, the company provides amplifiers, power supplies and generators, and electrostatic discharge sensors and monitors; electrostatic detection and measurement instrumentation products; and photonic-based measurement and monitoring solutions. In addition, it offers repair services, conversions, upgrades, and refurbishments and used equipment to companies. The company provides its products through direct sales force, independent sales representatives, channel partners, and distributors. Advanced Energy Industries, Inc. was founded in 1981 and is headquartered in Denver, Colorado.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Electrical Equipment & Parts", "Address": "1595 Wynkoop Street, Denver, CO, United States, 80202", "FullTimeEmployees": "10917", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2913524224", "EBITDA": "161568992", "PERatio": "44.6941", "PEGRatio": "0.41", "BookValue": "18.73", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.693", "RevenuePerShareTTM": "30.494", "ProfitMargin": "0.0557", "OperatingMarginTTM": "0.1032", "ReturnOnAssetsTTM": "0.0613", "ReturnOnEquityTTM": "0.0952", "RevenueTTM": "1168731008", "GrossProfitTTM": "327833000", "DilutedEPSTTM": "1.693", "QuarterlyEarningsGrowthYOY": "-0.085", "QuarterlyRevenueGrowthYOY": "1.521", "AnalystTargetPrice": "84.43", "TrailingPE": "44.6941", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.5053", "PriceToBookRatio": "4.0573", "EVToRevenue": "2.5423", "EVToEBITDA": "20.9482", "Beta": "1.5709", "52WeekHigh": "82.26", "52WeekLow": "33.38", "50DayMovingAverage": "74.2569", "200DayMovingAverage": "62.9374", "SharesOutstanding": "38330800", "SharesFloat": "37974362", "SharesShort": "904878", "SharesShortPriorMonth": "832746", "ShortRatio": "3.46", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0336", "PercentInsiders": "2.506", "PercentInstitutions": "102.642", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}