{"Symbol": "AFSI", "AssetType": "Common Stock", "Name": "AmTrust Financial Services, Inc", "Description": "AmTrust Financial Services, Inc. provides property and casualty insurance in the United States and internationally. The company operates in three segments: Small Commercial Business, Specialty Risk and Extended Warranty, and Specialty Program. The Small Commercial Business segment offers workers' compensation insurance products; and commercial package, and other property and casualty insurance products, such as commercial property, general liability, inland marine, employment practices liability, commercial automobile, and umbrella coverage to small businesses. The Specialty Risk and Extended Warranty segment provides custom designed coverages, such as accidental damage plans, mechanical breakdown protection, and payment protection plans in connection with the sale of consumer and commercial goods; and coverage for niche property, casualty, and specialty liability risks comprising general liability, employers' liability, and professional and medical liability. The Specialty Program segment offers workers' compensation, general liability, commercial auto liability, property coverage, excess and surplus lines programs, and other specialty commercial property and casualty insurance products to small and middle market companies. The company also provides reinsurance services primarily for personal and commercial automotive business. It distributes its policies third-party brokers, agents, retailers, or administrators. AmTrust Financial Services, Inc. was founded in 1998 and is based in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "59 Maiden Lane, 43rd Floor\n10038,New York,USA\n", "FullTimeEmployees": "9300", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "2916089600", "EBITDA": "-284692000", "PERatio": "15.0972", "PEGRatio": "1.12", "BookValue": "12.599", "DividendPerShare": "0.68", "DividendYield": "0.0485", "EPS": "1.03", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "18.7", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}