{"Symbol": "AGEN", "AssetType": "Common Stock", "Name": "Agenus Inc", "Description": "Agenus Inc., a clinical-stage immuno-oncology company, engages in advancing a pipeline of immune checkpoint antibodies, adoptive cell therapies and neoantigen cancer vaccines, to fight cancer. The company offers Retrocyte Display, an antibody discovery platform for the identification of fully-human and humanized monoclonal antibodies; and display technologies. In addition, the company develops vaccine programs, including Prophage vaccine candidate; AutoSynVax, a synthetic neoantigen; PhosPhoSynVax, a vaccine candidate designed to induce immunity against a class of tumor specific neoepitopes; and QS-21 Stimulon adjuvant, a saponin-based vaccine adjuvant. Further, it develops CTLA-4 and PD-1 antagonists which is in clinical trial phase I for the dose escalation study; AGEN2373, an anti-CD137 monospecific antibody which is in Phase 1 clinical trial; AGEN1223, a novel bispecific antibody designed to deplete regulatory T cells which is in a Phase 1 clinical trial; GS-1423, a tumor microenvironment conditioning anti-CD73/TGF TRAP bifunctional antibody which is in Phase 1 clinical trial; and TIGIT antibodies. Additionally, the company engages in the development INCAGN1876, an anti-GITR monospecific antibody; INCAGN1949, an anti-OX40 monospecific antibody; INCAGN2390 ? an anti-TIM-3 monospecific antibody; INCAGN2385, an anti-LAG-3 monospecific antibody; and MK-4830, a monospecific antibody targeting ILT4. Agenus Inc. has collaboration agreements with Incyte Corporation, Merck Sharpe & Dohme, and Recepta Biopharma SA.; and collaboration with Gilead Sciences, Inc. to develop immuno-oncology therapies. The company was formerly known as Antigenics Inc. and changed its name to Agenus Inc. in January 2011. Agenus Inc. was founded in 1994 and is headquartered in Lexington, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "3 Forbes Road, Lexington, MA, United States, 02421", "FullTimeEmployees": "328", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "785136128", "EBITDA": "-71034552", "PERatio": "None", "PEGRatio": "0", "BookValue": "-1.145", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.906", "RevenuePerShareTTM": "0.655", "ProfitMargin": "-1.7374", "OperatingMarginTTM": "-1.1464", "ReturnOnAssetsTTM": "-0.3524", "ReturnOnEquityTTM": "0", "RevenueTTM": "96513000", "GrossProfitTTM": "-18291000", "DilutedEPSTTM": "-1.139", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.715", "AnalystTargetPrice": "6.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "6.1565", "PriceToBookRatio": "0", "EVToRevenue": "7.2263", "EVToEBITDA": "0", "Beta": "1.9165", "52WeekHigh": "4.79", "52WeekLow": "1.82", "50DayMovingAverage": "3.6603", "200DayMovingAverage": "3.1799", "SharesOutstanding": "183443008", "SharesFloat": "115337734", "SharesShort": "20506691", "SharesShortPriorMonth": "16961156", "ShortRatio": "9.78", "ShortPercentOutstanding": "0.13", "ShortPercentFloat": "0.1481", "PercentInsiders": "19.714", "PercentInstitutions": "41.541", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:6", "LastSplitDate": "2011-10-03"}