{"Symbol": "AGIO", "AssetType": "Common Stock", "Name": "Agios Pharmaceuticals, Inc", "Description": "Agios Pharmaceuticals, Inc., a biopharmaceutical company, engages in the discovery and development of medicines in the field of cellular metabolism and adjacent areas of hematologic malignancies, solid tumors, and rare genetic diseases. The company offers TIBSOVO (ivosidenib), an oral targeted inhibitor for treating adult patients with relapsed or refractory acute myeloid leukemia (R/R AML), as well as to treat patients with newly diagnosed AML; and IDHIFA, an oral targeted inhibitor for patients with R/R AML and an isocitrate dehydrogenase 2 mutation. It is also developing TIBSOVO, which has completed Phase II clinical trials to treat IC eligible frontline AML; that is in Phase III clinical trials for treating IC ineligible frontline AML; and that is in Phase III clinical trials for the treatment of cholangiocarcinoma, as well as in early stage clinical development to treat glioma and solid tumors. In addition, the company is developing IDHIFA, which has completed Phase II clinical study for treating IC eligible frontline AML; and that is in Phase I/II clinical trials for the treatment of IC ineligible frontline AML. Further, it is developing mitapivat, which is in Phase III clinical trials to treat pyruvate kinase deficiency, as well as in Phase II clinical study for treating thalassemia; vorasidenib (AG-881) that is in Phase I clinical trials for the treatment of solid tumors, including glioma; AG-270, which is in Phase I dose-escalation trial to treat methylthioadenosine phosphorylase deleted cancers; and AG-636 that is in pre-clinical stage for treating hematologic malignancies. Agios Pharmaceuticals, Inc. was incorporated in 2007 and is based in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "88 Sidney Street, Cambridge, MA, United States, 02139", "FullTimeEmployees": "536", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2769932800", "EBITDA": "-399112000", "PERatio": "None", "PEGRatio": "0", "BookValue": "8.087", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-6.673", "RevenuePerShareTTM": "2.856", "ProfitMargin": "-1.8249", "OperatingMarginTTM": "-1.8739", "ReturnOnAssetsTTM": "-0.2474", "ReturnOnEquityTTM": "-0.6218", "RevenueTTM": "185908992", "GrossProfitTTM": "-294299000", "DilutedEPSTTM": "-5.212", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.424", "AnalystTargetPrice": "65.45", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "13.725", "PriceToBookRatio": "4.851", "EVToRevenue": "10.9104", "EVToEBITDA": "0", "Beta": "2.0275", "52WeekHigh": "56.75", "52WeekLow": "27.774", "50DayMovingAverage": "45.7044", "200DayMovingAverage": "45.7163", "SharesOutstanding": "69110096", "SharesFloat": "61253650", "SharesShort": "7458952", "SharesShortPriorMonth": "7499074", "ShortRatio": "11.42", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1488", "PercentInsiders": "11.369", "PercentInstitutions": "102.1", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}