{"Symbol": "AIMC", "AssetType": "Common Stock", "Name": "Altra Industrial Motion Corp", "Description": "Altra Industrial Motion Corp. designs, produces, and markets a range of electromechanical power transmission motion control products for use in various motion related applications, and high-volume manufacturing and non-manufacturing processes worldwide. It operates in two segments, Power Transmission Technologies and Automation & Specialty. The Power Transmission Technologies segment offers couplings, such as gear couplings, diaphragm and disc couplings, elastomeric couplings, miniature and precision couplings, joints, mill spindles, and shaft locking devices under the Ameridrives, Bibby, Guardian, Huco, Lamiflex, Stromag, and TB Wood's brands; clutches and brakes under the Industrial Clutch, Formsprag, Stieber, Stromag, Svendborg, Twiflex, and Wichita brands; electromagnetic clutches and brakes under the Inertia Dynamics, Matrix, Stromag, and Warner Electric brands; and gears under the Bauer Gear Motor, Boston Gear, Delroyd, and Nuttall brands. The Automation & Specialty segment provides rotary precision motion solutions, including servo and stepper motors, precision linear actuators, and electronic drives and motion controllers, as well as related software under the Kollmorgen brand; and miniature motors, as well as motion control products, such as brush and brushless DC, can stack, and disc magnet motors under the Portescap brand. This segment also offers linear bearings, guides, glides, lead and ball screws, industrial linear actuators, resolvers, and inductors for the transition of rotary motion to linear motion under the Thomson brand; and heavy-duty diesel engine brake systems and valve actuation mechanisms, including compression release, and bleeder and exhaust brakes under the Jacobs Vehicle Systems brand. The company was formerly known as Altra Holdings, Inc. and changed its name to Altra Industrial Motion Corp. in November 2013. Altra Industrial Motion Corp. was incorporated in 2004 and is headquartered in Braintree, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "300 Granite Street, Braintree, MA, United States, 02184", "FullTimeEmployees": "9200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2616628480", "EBITDA": "342100000", "PERatio": "13.5888", "PEGRatio": "1.1994", "BookValue": "28.006", "DividendPerShare": "0.16", "DividendYield": "0.0041", "EPS": "1.306", "RevenuePerShareTTM": "26.705", "ProfitMargin": "-0.0186", "OperatingMarginTTM": "0.1244", "ReturnOnAssetsTTM": "0.0316", "ReturnOnEquityTTM": "-0.0173", "RevenueTTM": "1719800064", "GrossProfitTTM": "656300000", "DilutedEPSTTM": "-0.501", "QuarterlyEarningsGrowthYOY": "-0.254", "QuarterlyRevenueGrowthYOY": "-0.141", "AnalystTargetPrice": "43.67", "TrailingPE": "13.5888", "ForwardPE": "17.9856", "PriceToSalesRatioTTM": "1.4979", "PriceToBookRatio": "1.4279", "EVToRevenue": "2.3016", "EVToEBITDA": "21.8447", "Beta": "2.5324", "52WeekHigh": "43.17", "52WeekLow": "12", "50DayMovingAverage": "36.4692", "200DayMovingAverage": "28.9018", "SharesOutstanding": "64656000", "SharesFloat": "63964159", "SharesShort": "1551319", "SharesShortPriorMonth": "1388012", "ShortRatio": "4.38", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0235", "PercentInsiders": "1.167", "PercentInstitutions": "105.423", "ForwardAnnualDividendRate": "0.16", "ForwardAnnualDividendYield": "0.0041", "PayoutRatio": "0.3452", "DividendDate": "2020-10-02", "ExDividendDate": "2020-09-17", "LastSplitFactor": "None", "LastSplitDate": "None"}