{"Symbol": "ALLT", "AssetType": "Common Stock", "Name": "Allot Ltd", "Description": "Allot Ltd. provides network intelligence and security solutions to protect and personalize the digital experience worldwide. It offers various platforms, including Allot Service Gateway 9500 and 9700, Allot Service Gateway Tera, Allot Service Gateway Virtual Edition, and Allot Secure Service Gateway, for in-line deployment in traditional and virtualized network access infrastructure. The company also provides subscriber management platform that drives the centralized creation, provisioning, and pricing of subscriber services; and analytics solutions comprising Allot ClearSee Analytics and Allot ClearSee Data Source that analyze traffic data. In addition, it offers security solutions comprising Allot NetworkSecure, Allot HomeSecure, Allot IoTSecure, Allot DDoS Secure, Allot Content Protector, Allot SpamOut Protector, and Allot Unified Security, as well as security as a service for protecting network service integrity and brand reputation. Further, the company offers centralized management solutions, such as Allot NetXplorer for providing a central access point for network-wide monitoring, reporting, analytics, troubleshooting, accounting, and quality of service policy provisioning. It markets its products through direct sales, distributors, resellers, original equipment manufacturers, and system integrators to carriers, mobile and fixed service providers, cable operators, private networks, data centers, educational institutions, governments, and enterprises, as well as wireless, wireline, and satellite Internet service providers. The company was formerly known as Allot Communications Ltd. and changed its name to Allot Ltd. in October 2018. Allot Ltd. was founded in 1996 and is based in Hod-Hasharon, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "22 Hanagar Street, Hod HaSharon, Israel, 4501317", "FullTimeEmployees": "478", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "366438336", "EBITDA": "-6448000", "PERatio": "None", "PEGRatio": "1.53", "BookValue": "3.753", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.27", "RevenuePerShareTTM": "3.478", "ProfitMargin": "-0.0754", "OperatingMarginTTM": "-0.0792", "ReturnOnAssetsTTM": "-0.0299", "ReturnOnEquityTTM": "-0.0683", "RevenueTTM": "120283000", "GrossProfitTTM": "76266000", "DilutedEPSTTM": "-0.262", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.235", "AnalystTargetPrice": "14.4", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "3.0681", "PriceToBookRatio": "2.8251", "EVToRevenue": "2.4181", "EVToEBITDA": "0", "Beta": "0.7962", "52WeekHigh": "13.05", "52WeekLow": "6.44", "50DayMovingAverage": "11.3506", "200DayMovingAverage": "10.6274", "SharesOutstanding": "34700600", "SharesFloat": "21860872", "SharesShort": "251520", "SharesShortPriorMonth": "255316", "ShortRatio": "1.67", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0097", "PercentInsiders": "3.312", "PercentInstitutions": "73.611", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}