{"Symbol": "ALNY", "AssetType": "Common Stock", "Name": "Alnylam Pharmaceuticals, Inc", "Description": "Alnylam Pharmaceuticals, Inc., a biopharmaceutical company, focuses on discovering, developing, and commercializing RNA interference (RNAi) therapeutics. The company's pipeline of investigational RNAi therapeutics focus on genetic medicines, cardio-metabolic diseases, hepatic infectious diseases, and central nervous system/ocular diseases. Its marketed products include ONPATTRO (patisiran), a lipid complex injection for the treatment of the polyneuropathy of hereditary transthyretin-mediated amyloidosis in adults; and GIVLAARI for the treatment of adults with acute hepatic porphyria (AHP). In addition, the company is developing givosiran for the treatment of patients with AHP; lumasiran for the treatment of primary hyperoxaluria type 1, or PH1; patisiran for the treatment of transthyretin amyloidosis, or ATTR amyloidosis, with cardiomyopathy; and vutrisiran for the treatment of ATTR amyloidosis. Alnylam Pharmaceuticals, Inc. has strategic alliances primarily with Sanofi Genzyme; The Medicines Company; Ionis Pharmaceuticals, Inc.; and Regeneron Pharmaceuticals, Inc., as well as collaboration with Vir Biotechnology, Inc. to advance RNAi therapeutics for the treatment of coronavirus infection, including COVID-19. It also has a collaboration and license agreement with Dicerna Pharmaceuticals, Inc. to develop and commercialize investigational ribonucleic acid interference therapeutics for the treatment of alpha-1 antitrypsin deficiency-associated liver disease, as well as Vir Biotechnology, Inc. to develop and commercialize RNAi therapeutics. The company was founded in 2002 and is headquartered in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "675 West Kendall Street, Cambridge, MA, United States, 02142", "FullTimeEmployees": "1323", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "15239618560", "EBITDA": "-877000000", "PERatio": "None", "PEGRatio": "-0.49", "BookValue": "12.103", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-8.254", "RevenuePerShareTTM": "3.063", "ProfitMargin": "-2.4514", "OperatingMarginTTM": "-2.6751", "ReturnOnAssetsTTM": "-0.1895", "ReturnOnEquityTTM": "-0.5361", "RevenueTTM": "345180000", "GrossProfitTTM": "194688000", "DilutedEPSTTM": "-7.509", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "1.325", "AnalystTargetPrice": "166", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "43.4328", "PriceToBookRatio": "11.0234", "EVToRevenue": "40.035", "EVToEBITDA": "0", "Beta": "1.7962", "52WeekHigh": "167.33", "52WeekLow": "73.32", "50DayMovingAverage": "146.5514", "200DayMovingAverage": "133.3178", "SharesOutstanding": "115970000", "SharesFloat": "114994477", "SharesShort": "5439744", "SharesShortPriorMonth": "5851089", "ShortRatio": "8.63", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0507", "PercentInsiders": "0.801", "PercentInstitutions": "94.741", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}