{"Symbol": "AMPH", "AssetType": "Common Stock", "Name": "Amphastar Pharmaceuticals, Inc", "Description": "Amphastar Pharmaceuticals, Inc., a specialty pharmaceutical company, develops, manufactures, markets, and sells generic and proprietary injectable, inhalation, and intranasal products in the United States, China, and France. The company operates through two segments, Finished Pharmaceutical Products and API. It offers enoxaparin, a low molecular weight heparin to prevent and treat deep vein thrombosis; naloxone for opioid overdose; Primatene Mist, an over-the-counter epinephrine inhalation product for the temporary relief of mild symptoms of intermittent asthma; and Cortrosyn, a lyophilized powder use as a diagnostic agent in the screening of patients with adrenocortical insufficiency. The company also provides Amphadase, a bovine-sourced hyaluronidase injection to absorb and disperse other injected drugs; lidocaine jelly, a local anesthetic product for urological procedures; lidocaine topical solution for various procedures; phytonadione injection for newborn babies; atropine, calcium chloride, dextrose, epinephrine, lidocaine, and sodium bicarbonate for emergency use in hospital settings; morphine injection; and lorazepam injection for surgery and medical procedures. In addition, it offers procainamide for documented ventricular arrhythmias; neostigmine methylsulfate injection to treat myasthenia gravis and to reverse the effects of muscle relaxants; medroxyprogesterone acetate injectable suspension for the prevention of pregnancy; and Isoproterenol hydrochloride injection for mild or transient episodes of heart block, as well as recombinant human insulin API (active pharmaceutical ingredients) and porcine insulin API. Further, the company has a pipeline of 20 product candidates in various stages of development for various indications. It serves hospitals, care facilities, alternate care sites, clinics, and doctors' offices. The company was founded in 1996 and is headquartered in Rancho Cucamonga, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersSpecialty & Generic", "Address": "11570 6th Street, Rancho Cucamonga, CA, United States, 91730", "FullTimeEmployees": "2027", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "968466816", "EBITDA": "26031000", "PERatio": "253.875", "PEGRatio": "2.77", "BookValue": "8.373", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.084", "RevenuePerShareTTM": "7.136", "ProfitMargin": "0.0121", "OperatingMarginTTM": "0.0201", "ReturnOnAssetsTTM": "0.007", "ReturnOnEquityTTM": "0.0088", "RevenueTTM": "334014016", "GrossProfitTTM": "131923000", "DilutedEPSTTM": "0.084", "QuarterlyEarningsGrowthYOY": "3.308", "QuarterlyRevenueGrowthYOY": "0.086", "AnalystTargetPrice": "22.4", "TrailingPE": "253.875", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.983", "PriceToBookRatio": "2.4251", "EVToRevenue": "2.7863", "EVToEBITDA": "31.1473", "Beta": "1.1132", "52WeekHigh": "22.7", "52WeekLow": "12.325", "50DayMovingAverage": "20.4014", "200DayMovingAverage": "18.3767", "SharesOutstanding": "47485500", "SharesFloat": "36353035", "SharesShort": "2822458", "SharesShortPriorMonth": "3071617", "ShortRatio": "10.3", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.083", "PercentInsiders": "23.799", "PercentInstitutions": "53.595", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}