{"Symbol": "ANAT", "AssetType": "Common Stock", "Name": "American National Group, Inc", "Description": "American National Group, Inc. provides life insurance, annuities, property and casualty insurance, health insurance, credit insurance, and pension products in the United States, the District of Columbia, and Puerto Rico. It offers whole life, term life, universal life, variable universal life, and credit life insurance products. The company also provides deferred, variable, and single premium immediate annuity products; and medicare supplement, supplemental, stop-loss, credit disability, and medical expense insurance products. In addition, it offers personal lines insurance, such as auto, homeowners, boats, motorcycles, recreational vehicles, and other exposures; and commercial lines of insurance, including property and casualty coverage tailored for a farm, ranch, or other agricultural business within the rural and suburban markets, as well as business owners, property, liability, mortgage security insurance, and workers' compensation coverages. Further, the company provides credit-related property insurance products comprising collateral or creditor protection insurance; and guaranteed auto protection or guaranteed asset protection insurance. Additionally, it engages in the investment activities. The company distributes its products through career and multiple-line agents, broker-dealers, independent insurance agents and brokers, managing general underwriters, marketing organizations, employee benefit firms, and financial institutions, as well as through direct marketing channels and call centers. American National Group, Inc. was founded in 1905 and is based in Galveston, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceDiversified", "Address": "One Moody Plaza, Galveston, TX, United States, 77550-7999", "FullTimeEmployees": "0", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2025412864", "EBITDA": "163871008", "PERatio": "8.0613", "PEGRatio": "0", "BookValue": "208.392", "DividendPerShare": "3.28", "DividendYield": "0.0435", "EPS": "5.27", "RevenuePerShareTTM": "123.36", "ProfitMargin": "0.0427", "OperatingMarginTTM": "0.0338", "ReturnOnAssetsTTM": "0.0025", "ReturnOnEquityTTM": "0.0276", "RevenueTTM": "3316134912", "GrossProfitTTM": "1219265000", "DilutedEPSTTM": "5.27", "QuarterlyEarningsGrowthYOY": "-0.468", "QuarterlyRevenueGrowthYOY": "-0.671", "AnalystTargetPrice": "87.04", "TrailingPE": "8.0613", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5601", "PriceToBookRatio": "0.3395", "EVToRevenue": "0.6124", "EVToEBITDA": "0", "Beta": "0.6357", "52WeekHigh": "124.895", "52WeekLow": "63.93", "50DayMovingAverage": "73.4286", "200DayMovingAverage": "78.3902", "SharesOutstanding": "26887200", "SharesFloat": "15351182", "SharesShort": "74485", "SharesShortPriorMonth": "89735", "ShortRatio": "3.5", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0157", "PercentInsiders": "23.504", "PercentInstitutions": "63.557", "ForwardAnnualDividendRate": "3.28", "ForwardAnnualDividendYield": "0.0435", "PayoutRatio": "0.3509", "DividendDate": "2020-06-19", "ExDividendDate": "2020-06-04", "LastSplitFactor": "None", "LastSplitDate": "None"}