{"Symbol": "ANDE", "AssetType": "Common Stock", "Name": "The Andersons, Inc", "Description": "The Andersons, Inc., an agriculture company, operates in the grain, ethanol, plant nutrient, and rail sectors in the United States and internationally. The company's Grain segment operates grain elevators; stores grains; and provides grain marketing, risk management, and corn origination services to its customers and affiliated ethanol facilities. Its Ethanol segment purchases and sells ethanol; and offers facility operations, risk management, and corn origination services. Its Ethanol segment purchases and sells ethanol, as well as offers facility operations, risk management, and ethanol and corn oil marketing services to the ethanol plants it invests in and operates. The company's Plant Nutrient segment manufactures, distributes, and retails agricultural and related plant nutrients, and pelleted lime and gypsum products; and crop nutrients, crop protection chemicals, and seed products, as well as provides application and agronomic services to commercial and family farmers. This segment also offers warehousing, packaging, and manufacturing services to nutrient producers and other distributors; and manufactures and distributes various industrial products, such as nitrogen reagents for air pollution control systems that are used in coal-fired power plants, and water treatment and dust abatement products. In addition, this segment produces corncob-based products for laboratory animal bedding and private-label cat litter, as well as absorbents, blast cleaners, carriers, and polishers; professional lawn care products for golf course and turf care markets; and fertilizer and control products. Its Rail segment leases, sells, and repairs various types of railcars, locomotives, and barges; provides fleet management services to private railcar owners; and offers metal fabrication services. The Andersons, Inc. was founded in 1947 and is based in Maumee, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Food Distribution", "Address": "1947 Briarfield Boulevard, Maumee, OH, United States, 43537", "FullTimeEmployees": "2247", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "593009984", "EBITDA": "188843008", "PERatio": "34.0545", "PEGRatio": "2.93", "BookValue": "28.595", "DividendPerShare": "0.7", "DividendYield": "0.0396", "EPS": "1.112", "RevenuePerShareTTM": "232.399", "ProfitMargin": "-0.0006", "OperatingMarginTTM": "0.0017", "ReturnOnAssetsTTM": "0.0024", "ReturnOnEquityTTM": "-0.0291", "RevenueTTM": "7611643904", "GrossProfitTTM": "517892000", "DilutedEPSTTM": "-0.15", "QuarterlyEarningsGrowthYOY": "0.011", "QuarterlyRevenueGrowthYOY": "-0.187", "AnalystTargetPrice": "20", "TrailingPE": "34.0545", "ForwardPE": "55.2486", "PriceToSalesRatioTTM": "0.0766", "PriceToBookRatio": "0.6207", "EVToRevenue": "0.2279", "EVToEBITDA": "8.9446", "Beta": "0.7555", "52WeekHigh": "28.82", "52WeekLow": "11.05", "50DayMovingAverage": "15.7733", "200DayMovingAverage": "15.8342", "SharesOutstanding": "33000000", "SharesFloat": "29939163", "SharesShort": "637306", "SharesShortPriorMonth": "620600", "ShortRatio": "2.64", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0192", "PercentInsiders": "6.347", "PercentInstitutions": "78.821", "ForwardAnnualDividendRate": "0.7", "ForwardAnnualDividendYield": "0.0396", "PayoutRatio": "1.2455", "DividendDate": "2020-10-22", "ExDividendDate": "2020-09-30", "LastSplitFactor": "3:2", "LastSplitDate": "2014-02-20"}