{"Symbol": "ANIK", "AssetType": "Common Stock", "Name": "Anika Therapeutics, Inc", "Description": "Anika Therapeutics, Inc., together with its subsidiaries, provides orthopedic medicines for patients with degenerative orthopedic diseases and traumatic conditions in the United States and internationally. The company develops, manufactures, and commercializes therapeutic products based on its proprietary hyaluronic acid (HA) technology. Its orthobiologics products comprise ORTHOVISC, ORTHOVISC mini, MONOVISC, and CINGAL for the treatment of osteoarthritis of the knee; HYALOFAST, a biodegradable support for human bone marrow mesenchymal stem cells used for cartilage regeneration and as an adjunct for microfracture surgery; HYALONECT, a resorbable knitted fabric mesh; HYALOSS MATRIX, HYAFF fibers used to mix blood/bone grafts to form a paste for bone regeneration; and HYALOGLIDE, an ACP gel used in tenolysis treatment. The company's dermal products include wound care products that comprise HYALOMATRIX and HYALOFILL for the treatment of complex wounds, such as burns and ulcers, and for use in connection with the regeneration of skin; and ELEVESS, an aesthetic dermatology product. Its surgical products comprise HYALOBARRIER, a post-operative adhesion barrier for use in the abdomino-pelvic area; MEROGEL, a woven fleece nasal packing; and MEROGEL INJECTABLE, a viscous hydrogel. The company also offers ophthalmic products, including injectable HA products that are used as viscoelastic agents in ophthalmic surgical procedures, such as cataract extraction and intraocular lens implantation; and veterinary products, which include HYVISC, an injectable HA product for the treatment of joint dysfunction in horses. The company was founded in 1983 and is headquartered in Bedford, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "32 Wiggins Avenue, Bedford, MA, United States, 01730", "FullTimeEmployees": "154", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "530220160", "EBITDA": "32430000", "PERatio": "47.9872", "PEGRatio": "3.1868", "BookValue": "20.307", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.793", "RevenuePerShareTTM": "8.845", "ProfitMargin": "0.0903", "OperatingMarginTTM": "0.1826", "ReturnOnAssetsTTM": "0.0394", "ReturnOnEquityTTM": "0.042", "RevenueTTM": "125544000", "GrossProfitTTM": "85863000", "DilutedEPSTTM": "0.793", "QuarterlyEarningsGrowthYOY": "0.29", "QuarterlyRevenueGrowthYOY": "0.009", "AnalystTargetPrice": "51", "TrailingPE": "47.9872", "ForwardPE": "59.5238", "PriceToSalesRatioTTM": "4.2852", "PriceToBookRatio": "1.8436", "EVToRevenue": "3.668", "EVToEBITDA": "21.1875", "Beta": "1.1225", "52WeekHigh": "75.715", "52WeekLow": "22.01", "50DayMovingAverage": "36.1361", "200DayMovingAverage": "34.6727", "SharesOutstanding": "14207400", "SharesFloat": "13222419", "SharesShort": "2109139", "SharesShortPriorMonth": "2141464", "ShortRatio": "17.97", "ShortPercentOutstanding": "0.14", "ShortPercentFloat": "0.1701", "PercentInsiders": "4.043", "PercentInstitutions": "99.609", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}