{"Symbol": "ANIP", "AssetType": "Common Stock", "Name": "ANI Pharmaceuticals, Inc", "Description": "ANI Pharmaceuticals, Inc., a specialty pharmaceutical company, develops, manufactures, and markets branded and generic prescription pharmaceuticals in the United States and Canada. It focuses on producing controlled substances, oncolytics (anti-cancers), hormones and steroids, and other formulations. The company offers pharmaceuticals for the treatment of breast cancer, hypertension, ventricular arrhythmias, stage D2 metastatic carcinoma of the prostate, depression, diarrhea, infections, vasomotor symptoms of menopause, pain caused by osteoarthritis and rheumatoid arthritis, epilepsy, arrhythmia, obsessive-compulsive disorder and social anxiety disorder, ulcerative colitis, salt and fluid retention, manic episodes of bipolar disorder, ulcerative colitis, proctosigmoiditis, ocular conditions, metastatic prostate cancer, arrhythmia, migraine headache, and enterocolitis caused by staphylococcus aureus. It also provides aspirin and extended-release dipyridamole; Cholestyramine, an adjunctive therapy to diet for the reduction of elevated serum cholesterol; Ezetimibe-Simvastatin to lower high cholesterol and triglyceride levels; Fenofibrate, a peroxisome proliferator receptor alpha activator; Hydrocortisone rectal cream for the relief of inflammatory and pruritic manifestations of corticosteroid-responsive dermatoses; Morphine Sulfate, an oral solution for acute and chronic pain management; Nimodipine to enhance neurological outcomes; and Terbutaline Sulfate for the prevention and reversal of bronchospasm. The company manufactures oral solid dose products; semi-solids, liquids, and topicals; and potent products, as well as performs contract manufacturing for other pharmaceutical companies. It markets its products through retail pharmacy chains, wholesalers, distributors and mail order pharmacies, and group purchasing organizations. The company was founded in 2001 and is headquartered in Baudette, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersSpecialty & Generic", "Address": "210 Main Street West, Baudette, MN, United States, 56623", "FullTimeEmployees": "338", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "384970016", "EBITDA": "33701000", "PERatio": "77.58", "PEGRatio": "1.06", "BookValue": "15.936", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.337", "RevenuePerShareTTM": "16.588", "ProfitMargin": "-0.1027", "OperatingMarginTTM": "-0.0391", "ReturnOnAssetsTTM": "-0.0106", "ReturnOnEquityTTM": "-0.1017", "RevenueTTM": "197547008", "GrossProfitTTM": "143393000", "DilutedEPSTTM": "-1.702", "QuarterlyEarningsGrowthYOY": "-0.238", "QuarterlyRevenueGrowthYOY": "-0.108", "AnalystTargetPrice": "39.33", "TrailingPE": "77.58", "ForwardPE": "9.0909", "PriceToSalesRatioTTM": "1.897", "PriceToBookRatio": "2.0126", "EVToRevenue": "2.772", "EVToEBITDA": "22.1915", "Beta": "1.45", "52WeekHigh": "80.87", "52WeekLow": "25.23", "50DayMovingAverage": "30.3042", "200DayMovingAverage": "37.0931", "SharesOutstanding": "12304200", "SharesFloat": "9218490", "SharesShort": "542585", "SharesShortPriorMonth": "559526", "ShortRatio": "6.15", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0781", "PercentInsiders": "3.966", "PercentInstitutions": "86.039", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:6", "LastSplitDate": "2013-07-18"}