{"Symbol": "ANY", "AssetType": "Common Stock", "Name": "Sphere 3D Corp", "Description": "Sphere 3D Corp. provides data management, and desktop and application virtualization solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. It enables organizations to deploy a combination of public, private, or hybrid cloud strategies through containerized applications, virtual desktops, virtual storage, and physical hyper-converged platforms. The company offers HVE converged and hyper-converged Infrastructure solutions, such as HVE-STACK high density server solution; HVE-VELOCITY high availability dual enclosure storage area network solution; and HVE 3DGFX, a virtualized desktop infrastructure solution. It also provides G-Series appliance to simplify Windows application migration and to enable access from various devices; and G-Series Cloud solution to provide a virtual appliance, as well as offers Glassware solution, which is compatible with the open virtual appliance and open virtual format. In addition, the company provides SnapServer network attached storage solutions, including SnapServer XSR40, a 1U server that can be configured with up to four SATA III and SSD drives; SnapServer XSR120, a 2U server, which can be configured with up to 12 SATA III, SAS, and SSD drives; GuardianOS, a storage software solution; and Snap Enterprise Data Replicator that provides multi-directional WAN-optimized replication. Sphere 3D Corp. markets its products under the SnapCLOUD, SnapServer, V3, SnapSync, and HVE brand names. The company sells its products through its distributor and reseller network to small and medium businesses, and distributed enterprises. Sphere 3D Corp. was incorporated in 2007 and is based in Toronto, Canada.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "Building No. 2, Toronto, ON, Canada, M3C 1W3", "FullTimeEmployees": "28", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "16004136", "EBITDA": "-8714000", "PERatio": "None", "PEGRatio": "-0.02", "BookValue": "-3.79", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-7.947", "RevenuePerShareTTM": "1.171", "ProfitMargin": "-0.871", "OperatingMarginTTM": "-1.3344", "ReturnOnAssetsTTM": "-0.3736", "ReturnOnEquityTTM": "0", "RevenueTTM": "4387000", "GrossProfitTTM": "1854000", "DilutedEPSTTM": "-1.02", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.075", "AnalystTargetPrice": "5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.5115", "PriceToBookRatio": "0", "EVToRevenue": "5.1722", "EVToEBITDA": "0", "Beta": "2.3456", "52WeekHigh": "4.8", "52WeekLow": "0.33", "50DayMovingAverage": "3.1219", "200DayMovingAverage": "1.868", "SharesOutstanding": "6958320", "SharesFloat": "4976733", "SharesShort": "20584", "SharesShortPriorMonth": "6657", "ShortRatio": "0.06", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0042", "PercentInsiders": "28.018", "PercentInstitutions": "5.796", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:8", "LastSplitDate": "2018-11-06"}