{"Symbol": "AOSL", "AssetType": "Common Stock", "Name": "Alpha and Omega Semiconductor Limited", "Description": "Alpha and Omega Semiconductor Limited designs, develops, and supplies power semiconductor products for computing, consumer electronics, communication, and industrial applications worldwide. The company offers power discrete products, including metal-oxide-semiconductor field-effect transistors (MOSFET), SRFETs, XSFET, electrostatic discharge, protected MOSFETs, high and mid-voltage MOSFETs, and insulated gate bipolar transistors. Its power discrete products are used in smart phone chargers, battery packs, notebooks, desktop and servers, data centers, base stations, graphics card, game boxes, TVs, AC adapters, power supplies, motor control, power tools, e-vehicles, white goods and industrial motor drives, UPS systems, solar inverters, and industrial welding. The company also provides power ICs that deliver power, as well as control and regulate the power management variables, such as the flow of current and level of voltage. Its power ICs are used in flat panel displays, TVs, Notebooks, graphic cards, servers, DVD/Blu-Ray players, set-top boxes, and networking equipment. In addition, the company offers aMOS5 family for quick charger, adapter, PC power, server, industrial power, telecom, and hyperscale datacenter applications; and Super Low Capacitance TVS for notebooks and mobile devices. Further, it provides EZBuck regulators for chipsets used in TVs, servers, data storage systems, networking, and other compact PC systems; SOA MOSFET for hot swap applications; and XSPairFET buck-boost MOSFET for type-c applications, such as notebook, USB hubs, and power banks. Additionally, the company offers input protection switches and TO-leadless packaging technologies. Alpha and Omega Semiconductor Limited was incorporated in 2000 and is headquartered in Sunnyvale, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductors", "Address": "475 Oakmead Parkway, Sunnyvale, CA, United States, 94085", "FullTimeEmployees": "0", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "341111392", "EBITDA": "31380322", "PERatio": "271.4279", "PEGRatio": "-8.49", "BookValue": "11.606", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.019", "RevenuePerShareTTM": "18.716", "ProfitMargin": "-0.0142", "OperatingMarginTTM": "-0.0287", "ReturnOnAssetsTTM": "-0.0109", "ReturnOnEquityTTM": "-0.0417", "RevenueTTM": "464908992", "GrossProfitTTM": "102731000", "DilutedEPSTTM": "-0.27", "QuarterlyEarningsGrowthYOY": "-0.6", "QuarterlyRevenueGrowthYOY": "0.094", "AnalystTargetPrice": "15", "TrailingPE": "271.4279", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.7379", "PriceToBookRatio": "1.1899", "EVToRevenue": "0.8546", "EVToEBITDA": "12.8884", "Beta": "2.222", "52WeekHigh": "15.08", "52WeekLow": "5.82", "50DayMovingAverage": "11.8478", "200DayMovingAverage": "10.4075", "SharesOutstanding": "25305000", "SharesFloat": "20009929", "SharesShort": "350382", "SharesShortPriorMonth": "359398", "ShortRatio": "3.43", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0167", "PercentInsiders": "21.391", "PercentInstitutions": "62.537", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}