{"Symbol": "APDN", "AssetType": "Common Stock", "Name": "Applied DNA Sciences, Inc", "Description": "Applied DNA Sciences, Inc. engages in polymerase chain reaction-based DNA manufacturing that enables in vitro diagnostics, and pre-clinical nucleic acid-based therapeutic drug candidates in the United States, Europe, and Asia. The company's supply chain security and product authentication solutions include SigNature molecular tags that are ingredients used to fortify brand protection efforts and strengthen supply chain security, as well as mark, track, and convict criminals; SigNature T molecular tags, which are tagging and authentication systems for use in brand protection efforts and raw material source compliance programs; and fiberTyping, a test of native cotton fiber DNA. It also provides Smart DNA, a tagging solution for vehicle and home asset marking, as well as for commercial and government use; Beacon locked optical markers, which create a protected covert screening tool that can be adapted to packaging, security labels, and high?value assets through inks, varnishes, and coatings; and SigNify IF portable DNA readers. In addition, the company offers Applied DNA Sciences Portal, a software platform that enables customers to manage the security of company-marked goods; and DNA Transfer Systems and Cannabis Tracking System for real-time monitoring. Further, it provides CertainT Supply Chain Platform that provides proof of product claims for materials, items, or products; and Triathlon PCR systems that allow for the large-scale production of specific DNA sequences. Additionally, the company offers contract research services; and various RNA based drug and biologic customers for preclinical studies. It also develops tests in virology, for the detection of COVID-19, and in oncology, for the detection and enumeration of invasive circulating tumor cells. The company was formerly known as Datalink Systems, Inc. and changed its name to Applied DNA Sciences, Inc. in 2002. Applied DNA Sciences, Inc. was founded in 1983 and is headquartered in Stony Brook, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Security & Protection Services", "Address": "50 Health Sciences Drive, Stony Brook, NY, United States, 11790", "FullTimeEmployees": "51", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "39290840", "EBITDA": "-10283919", "PERatio": "None", "PEGRatio": "0", "BookValue": "1.768", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.322", "RevenuePerShareTTM": "1.135", "ProfitMargin": "0", "OperatingMarginTTM": "-3.1444", "ReturnOnAssetsTTM": "-0.7625", "ReturnOnEquityTTM": "-2.9004", "RevenueTTM": "3290350", "GrossProfitTTM": "4511476", "DilutedEPSTTM": "-3.6", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.79", "AnalystTargetPrice": "21.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "6.4785", "PriceToBookRatio": "4.3026", "EVToRevenue": "8.8786", "EVToEBITDA": "0", "Beta": "1.0951", "52WeekHigh": "14.84", "52WeekLow": "0.1671", "50DayMovingAverage": "9.3714", "200DayMovingAverage": "7.265", "SharesOutstanding": "5142780", "SharesFloat": "4435544", "SharesShort": "381592", "SharesShortPriorMonth": "345996", "ShortRatio": "0.23", "ShortPercentOutstanding": "0.11", "ShortPercentFloat": "0.1178", "PercentInsiders": "16.45", "PercentInstitutions": "19.804", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:40", "LastSplitDate": "2019-11-01"}