{"Symbol": "APOG", "AssetType": "Common Stock", "Name": "Apogee Enterprises, Inc", "Description": "Apogee Enterprises, Inc. designs and develops glass and metal products and services in the United States, Canada, and Brazil. The company operates in four segments: Architectural Framing Systems, Architectural Glass, Architectural Services, and Large-Scale Optical Technologies (LSO). The Architectural Framing Systems segment designs, engineers, fabricates, and finishes the aluminum frames used in customized aluminum and glass window; curtain wall; storefront; and entrance systems, such as the outside skin and entrances of commercial, institutional, and multi-family residential buildings. The Architectural Glass segment fabricates coated and high-performance glass used in customized window and wall systems, including the outside skin of commercial, institutional, and multi-family residential buildings. The Architectural Services segment offers full-service installation of the walls of glass, windows, and other curtain wall products making up the outside skin of commercial and institutional buildings. The LSO segment manufactures value-added glass and acrylic products for framing and display applications. The company's products and services are primarily used in commercial buildings, such as office towers, hotels, and retail centers; and institutional buildings comprising education facilities, health care facilities, and government buildings, as well as multi-family residential buildings. It markets its architectural products and services through direct sales force, independent sales representatives, and distributors to glazing subcontractors and general contractors; and value-added glass and acrylics through retail chains, picture-framing shops, and independent distributors to museums, shops, and galleries. The company was founded in 1949 and is based in Minneapolis, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Building Products & Equipment", "Address": "4400 West 78th Street, Minneapolis, MN, United States, 55435", "FullTimeEmployees": "7200", "FiscalYearEnd": "February", "LatestQuarter": "2020-05-31", "MarketCapitalization": "571676864", "EBITDA": "104509000", "PERatio": "11.2811", "PEGRatio": "1.57", "BookValue": "19.119", "DividendPerShare": "0.75", "DividendYield": "0.0349", "EPS": "1.854", "RevenuePerShareTTM": "50.107", "ProfitMargin": "0.0374", "OperatingMarginTTM": "0.0426", "ReturnOnAssetsTTM": "0.0319", "ReturnOnEquityTTM": "0.0998", "RevenueTTM": "1321169024", "GrossProfitTTM": "303959000", "DilutedEPSTTM": "1.854", "QuarterlyEarningsGrowthYOY": "-0.811", "QuarterlyRevenueGrowthYOY": "-0.186", "AnalystTargetPrice": "27", "TrailingPE": "11.2811", "ForwardPE": "12.8205", "PriceToSalesRatioTTM": "0.4205", "PriceToBookRatio": "1.0911", "EVToRevenue": "0.606", "EVToEBITDA": "6.6991", "Beta": "1.378", "52WeekHigh": "43.28", "52WeekLow": "13.767", "50DayMovingAverage": "22.4144", "200DayMovingAverage": "22.4758", "SharesOutstanding": "26356700", "SharesFloat": "25507458", "SharesShort": "1718338", "SharesShortPriorMonth": "1502746", "ShortRatio": "8.48", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0742", "PercentInsiders": "3.143", "PercentInstitutions": "90.662", "ForwardAnnualDividendRate": "0.75", "ForwardAnnualDividendYield": "0.0349", "PayoutRatio": "0.3919", "DividendDate": "2020-07-29", "ExDividendDate": "2020-07-13", "LastSplitFactor": "2:1", "LastSplitDate": "1997-02-18"}