{"Symbol": "ARCB", "AssetType": "Common Stock", "Name": "ArcBest Corporation", "Description": "ArcBest Corporation provides freight transportation services and integrated logistics solutions worldwide. It operates through three segments: Asset-Based, ArcBest, and FleetNet. The Asset-Based segment transports general commodities, such as food, textiles, apparel, furniture, appliances, chemicals, nonbulk petroleum products, rubber, plastics, metal and metal products, wood, glass, automotive parts, machinery, and miscellaneous manufactured products through less-than-truckload services. It also offers motor carrier freight transportation services to customers in Mexico through arrangements with trucking companies. The ArcBest segment provides expedite freight transportation services to commercial and government customers; premium logistics services, such as deployment of specialized equipment to meet linehaul requirements; and international freight transportation with air, ocean, and ground services. It also offers third-party transportation brokerage services by sourcing various capacity solutions, including dry van over the road and intermodal, temperature-controlled and refrigerated, flatbed, intermodal or container shipping, and specialized equipment; full-container and less-than-container load ocean transportation services; warehousing and distribution services; managed transportation services; and moving services to ?do-it-yourself' consumer and corporate account employee relocations, as well as provides final mile, time critical, product launch, warehousing, retail logistics, supply chain optimization, and trade show shipping services. The FleetNet segment provides roadside assistance and maintenance management services for commercial vehicles through third-party service providers. The company was formerly known as Arkansas Best Corporation and changed its name to ArcBest Corporation in May 2014. ArcBest Corporation was founded in 1923 and is headquartered in Fort Smith, Arkansas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Trucking", "Address": "8401 McClure Drive, Fort Smith, AR, United States, 72916", "FullTimeEmployees": "13000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "877594624", "EBITDA": "178380000", "PERatio": "29.5229", "PEGRatio": "3", "BookValue": "30.511", "DividendPerShare": "0.32", "DividendYield": "0.0092", "EPS": "1.085", "RevenuePerShareTTM": "111.177", "ProfitMargin": "0.0101", "OperatingMarginTTM": "0.0222", "ReturnOnAssetsTTM": "0.0224", "ReturnOnEquityTTM": "0.0376", "RevenueTTM": "2833750016", "GrossProfitTTM": "204157000", "DilutedEPSTTM": "1.085", "QuarterlyEarningsGrowthYOY": "-0.337", "QuarterlyRevenueGrowthYOY": "-0.187", "AnalystTargetPrice": "35.44", "TrailingPE": "29.5229", "ForwardPE": "27.7778", "PriceToSalesRatioTTM": "0.2991", "PriceToBookRatio": "1.0564", "EVToRevenue": "0.3044", "EVToEBITDA": "5.2887", "Beta": "1.6192", "52WeekHigh": "35", "52WeekLow": "15.87", "50DayMovingAverage": "31.4239", "200DayMovingAverage": "24.0354", "SharesOutstanding": "25444900", "SharesFloat": "24716450", "SharesShort": "1018892", "SharesShortPriorMonth": "1001777", "ShortRatio": "3.98", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.05", "PercentInsiders": "1.666", "PercentInstitutions": "92.127", "ForwardAnnualDividendRate": "0.32", "ForwardAnnualDividendYield": "0.0092", "PayoutRatio": "0.2936", "DividendDate": "2020-08-21", "ExDividendDate": "2020-08-06", "LastSplitFactor": "None", "LastSplitDate": "None"}