{"Symbol": "ARII", "AssetType": "Common Stock", "Name": "American Railcar Industries, Inc", "Description": "American Railcar Industries, Inc., together with its subsidiaries, designs and manufactures hopper and tank railcars in North America. It operates through three segments: Manufacturing, Railcar Leasing, and Railcar Services. The Manufacturing segment manufactures hopper railcars for shipping various dry bulk products, such as plastic pellets, as well as high-density products, including cement and sand; pressure tank railcars for transporting products comprising chlorine, anhydrous ammonia, liquid propane, and butane; and other types of railcars. This segment also manufactures railcar components, including discharge outlets for hopper railcars, tank railcar components and valves, tank heads, manway covers, wheel pair sets, underframes, outlet components and running boards for industrial and rail customers, and hitches for the intermodal market; and aluminum and special alloy steel castings for the trucking, construction, mining, and oil and gas exploration markets, as well as machined castings and other custom machined products. The Railcar Leasing segment leases hopper and tank railcars. As of December 31, 2017, this segment had a lease fleet of 13,138 railcars. The Railcar Services segment offers railcar services primarily to leasing companies and shippers of specialty hopper and tank railcars. This segment provides repair services consisting of cleaning, interior and exterior coating, repair/rebuilding, non-destructive testing, and engineering for various railcars; engineering and field services through mobile units and mini shops; and sales and administrative, technical, and materials and purchasing support services, as well as licenses intellectual property related to the repair services for railcars. American Railcar Industries, Inc. was founded in 1988 and is headquartered in St. Charles, Missouri.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "100 Clark Street\n63301,St. Charles,USA\n", "FullTimeEmployees": "1932", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "2.95", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "52", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}