{"Symbol": "ARRY", "AssetType": "Common Stock", "Name": "Array BioPharma Inc", "Description": "Array BioPharma Inc., a biopharmaceutical company, focuses on the discovery, development, and commercialization of small molecule drugs to treat patients with cancer and other diseases in North America, Europe, and the Asia Pacific. It provides BRAFTOVITM (encorafenib) capsules in combination with MEKTOVI (binimetinib) tablets for the treatment of patients with unresectable or metastatic melanoma with a BRAF mutation. The company's lead clinical programs include encorafenib and binimetinib that are investigated in approximately 30 clinical trials for various solid tumor indications, including a Phase III trial in BRAF-mutant colorectal cancer. Its product pipeline also includes ipatasertib, an AKT inhibitor that is in Phase III trial to treat prostate or breast cancers; selumetinib, a MEK inhibitor for cancer; larotrectinib, a PanTrk inhibitor that is in a Phase II/registration clinical trial for cancer; tucatinib, a HER2 inhibitor for breast cancer, which is in Phase II/registration trial; and ARRY-797 that is in Phase III clinical trial for Lamin A/C-related dilated cardiomyopathy. In addition, the company is developing varlitinib/ASLAN001, a Pan-HER2 inhibitor for gastric cancer; ARRY-382, a CSF1R inhibitor that is in Phase II clinical trial to treat cancer; motolimod/VTX-2337, a Toll-like receptor that is in Phase II clinical trial for cancer; and prexasertib/LY2606368, a CHK-1 inhibitor, which is in multiple Phase I or II clinical trials for cancer. Further, its drug candidates in Phase I clinical trials include GDC-0575, a CHK-1 inhibitor for cancer; LOXO-292, a RET inhibitor to treat cancer; and LOXO-195, a Trk inhibitor for cancer. Additionally, its drug candidates include Ganovo/danoprevir, a protease inhibitor for hepatitis C virus. The company was founded in 1998 and is headquartered in Boulder, Colorado. As of July 29, 2019, Array BioPharma Inc. operates as a subsidiary of Pfizer Inc.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "3200 Walnut Street\n80301,Boulder,USA\n", "FullTimeEmployees": "298", "FiscalYearEnd": "June", "LatestQuarter": "None", "MarketCapitalization": "10675095552", "EBITDA": "None", "PERatio": "None", "PEGRatio": "-1.18", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "44.29", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}