{"Symbol": "ARTX", "AssetType": "Common Stock", "Name": "Arotech Corporation", "Description": "Arotech Corporation provides defense and security products worldwide. The company's Training and Simulation division develops, manufactures, and markets multimedia and interactive digital solutions for engineering, use-of-force training, and operator training of military, law enforcement, security, emergency services, and other personnel. This division offers simulators, systems engineering support, and software products for training vehicle operators to the United States military, government, municipalities, and private industry; weapon simulations used to train military pilots, weapon employment information used in air launched weapons, and part-task simulators to train aircrew; specialized use-of-force training simulators and systems for police, security personnel, and the military under the MILO Range trade name; and consulting and development support services under the Realtime Technologies trade name. Its Power Systems division provides electronics engineering and design, system integration, rapid prototyping, and vertically production services for military, aerospace, and industrial customers, including hybrid power generation systems, smart power subsystems for military vehicles and dismounted applications, and aircraft and missile systems support for weapons and communications technologies. This division also develops and sells rechargeable and primary batteries, and smart chargers to the military and medical markets, and to private defense industry under the Epsilor name. In addition, it develops, manufactures, and markets primary batteries, rechargeable batteries, and battery chargers for the military; and produces water-activated lifejacket lights for commercial aviation and marine applications under the Electric Fuel name. The company was formerly known as Electric Fuel Corporation and changed its name to Arotech Corporation in September 2003. The company was incorporated in 1990 and is based in Ann Arbor, Michigan. As of December 19, 2019, Arotech Corporation was taken private.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "1229 Oak Valley Drive\n48108,Ann Arbor,USA\n", "FullTimeEmployees": "472", "FiscalYearEnd": "December", "LatestQuarter": "0000-00-00", "MarketCapitalization": "79862272", "EBITDA": "4094536", "PERatio": "None", "PEGRatio": "0", "BookValue": "2.879", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "29197478", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "4.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.8708", "PriceToBookRatio": "1.0516", "EVToRevenue": "1.0963", "EVToEBITDA": "22.3548", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "3", "200DayMovingAverage": "2.9759", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}