{"Symbol": "ASMB", "AssetType": "Common Stock", "Name": "Assembly Biosciences, Inc", "Description": "Assembly Biosciences, Inc. operates as a clinical-stage biotechnology company in the United States. The company develops oral therapeutic candidates for the treatment of hepatitis B virus (HBV) infection and novel class of oral synthetic live biotherapeutic candidates to treat disorders associated with the microbiome. It is involved in the development of core inhibitors that inhibit the functional activities of HBV core protein at various points in the viral lifecycle. The company's microbiome program consists of an integrated platform that includes the disease-targeted strain isolation, identification, characterization, and selection process for strain purification and growth under current good manufacturing practice conditions; and a licensed patented delivery system, GEMICEL, which allows for targeted oral delivery of live biologic and conventional therapies to the lower gastrointestinal tract. Its product candidates include ABI-H0731 that is in Phase 2a clinical trials for the treatment of HBV; ABI-H2158, which is in Phase 1a/1b dose-ranging clinical study in the HBV-cure program; and ABI-H3733 that is in preclinical studies for the treatment of HBV. In addition, the company engages in the development of product candidates for various disease indications, such as Crohn's disease, irritable bowel syndrome, immune-mediated and metabolic disorders, and oncology by using its microbiome platform. It has a collaboration agreement with Allergan Pharmaceuticals International Limited for the development and commercialization of various microbiome gastrointestinal programs. The company was formerly known as Ventrus Biosciences, Inc. and changed its name to Assembly Biosciences, Inc. in June 2014. Assembly Biosciences, Inc. was founded in 2005 and is headquartered in South San Francisco, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "331 Oyster Point Boulevard, South San Francisco, CA, United States, 94080", "FullTimeEmployees": "139", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "697838080", "EBITDA": "-99942000", "PERatio": "None", "PEGRatio": "0", "BookValue": "8.142", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-3.664", "RevenuePerShareTTM": "1.691", "ProfitMargin": "-1.3624", "OperatingMarginTTM": "-1.4125", "ReturnOnAssetsTTM": "-0.1727", "ReturnOnEquityTTM": "-0.3235", "RevenueTTM": "52454000", "GrossProfitTTM": "-69794000", "DilutedEPSTTM": "-2.306", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "11.784", "AnalystTargetPrice": "43", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "12.4459", "PriceToBookRatio": "2.5879", "EVToRevenue": "9.0687", "EVToEBITDA": "0", "Beta": "1.2852", "52WeekHigh": "25.78", "52WeekLow": "8.1301", "50DayMovingAverage": "22.5972", "200DayMovingAverage": "19.849", "SharesOutstanding": "32854900", "SharesFloat": "23428182", "SharesShort": "3641189", "SharesShortPriorMonth": "3123516", "ShortRatio": "17.09", "ShortPercentOutstanding": "0.11", "ShortPercentFloat": "0.1171", "PercentInsiders": "7.35", "PercentInstitutions": "89.857", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:5", "LastSplitDate": "2014-07-14"}