{"Symbol": "ASTE", "AssetType": "Common Stock", "Name": "Astec Industries, Inc", "Description": "Astec Industries, Inc. manufactures and sells equipment and components for the road building, aggregate processing, geothermal, water, oil and gas, and wood processing industries in the United States and internationally. The company's Infrastructure Group segment designs, engineers, manufactures, markets, services, and installs asphalt plants and their related components, asphalt pavers, screeds, milling machines, material transfer vehicles, stabilizers, and related ancillary equipment. This segment serves asphalt producers, highway and heavy equipment contractors, utility contractors, and governmental agencies through direct sales staff and independent distributors. Its Aggregate and Mining Group segment focuses on designing and manufacturing heavy processing equipment, as well as servicing and supplying parts for the aggregate, metallic mining, recycling, ports, and bulk handling markets. This segment serves highway and heavy equipment contractors, sand and gravel producers, recycle and crushing contractors, mine operators, quarry operators, port and inland terminal authorities, power stations, and governmental agencies through direct sales employees and independent distributors. The company's Energy Group segment supplies heavy equipment, such as heaters, drilling rigs, concrete plants, wood chippers and grinders, pump trailers, storage equipment, construction, and water well industries, as well as commercial and industrial burners that are used primarily in commercial, industrial, and process heating applications. It serves oil and gas field operators, industrial product manufacturers, independent contractors, ready mix concrete producers, heating equipment distributors, and government agencies through employee sales agents, manufacturer representatives, and distributors. The company was founded in 1972 and is based in Chattanooga, Tennessee.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Farm & Heavy Construction Machinery", "Address": "1725 Shepherd Road, Chattanooga, TN, United States, 37421", "FullTimeEmployees": "3529", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1209486464", "EBITDA": "39413000", "PERatio": "84.2656", "PEGRatio": "2.6", "BookValue": "27.498", "DividendPerShare": "0.44", "DividendYield": "0.0082", "EPS": "0.643", "RevenuePerShareTTM": "48.484", "ProfitMargin": "0.0133", "OperatingMarginTTM": "0.0126", "ReturnOnAssetsTTM": "0.0105", "ReturnOnEquityTTM": "0.0232", "RevenueTTM": "1093177984", "GrossProfitTTM": "239408000", "DilutedEPSTTM": "0.643", "QuarterlyEarningsGrowthYOY": "-0.602", "QuarterlyRevenueGrowthYOY": "-0.13", "AnalystTargetPrice": "58.33", "TrailingPE": "84.2656", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.12", "PriceToBookRatio": "1.9756", "EVToRevenue": "1.0083", "EVToEBITDA": "37.5078", "Beta": "1.189", "52WeekHigh": "63.74", "52WeekLow": "25.17", "50DayMovingAverage": "49.5528", "200DayMovingAverage": "42.2349", "SharesOutstanding": "22603000", "SharesFloat": "22159738", "SharesShort": "1093766", "SharesShortPriorMonth": "927723", "ShortRatio": "4.96", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0469", "PercentInsiders": "1.883", "PercentInstitutions": "98.793", "ForwardAnnualDividendRate": "0.44", "ForwardAnnualDividendYield": "0.0082", "PayoutRatio": "0.6875", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-28", "LastSplitFactor": "2:1", "LastSplitDate": "1999-01-19"}