{"Symbol": "ASYS", "AssetType": "Common Stock", "Name": "Amtech Systems, Inc", "Description": "Amtech Systems, Inc. manufactures and sells capital equipment and related consumables for use in fabricating silicon carbide (SiC), silicon power chips, electronic assemblies, and light-emitting diodes (LEDs) in the United States, China, France, and internationally. The company operates through Semiconductor and SiC/LED segments. The Semiconductor segment designs, manufactures, sells, and services thermal processing equipment, including solder reflow equipment and related controls for use by various semiconductor manufacturers, as well as in electronics, automotive and other industries; and wafer polishing equipment and related services. Its products include horizontal diffusion furnaces used to produce semiconductors, silicon wafers, and microelectromechanical systems; and belt furnaces. The SiC/LED segment manufactures and sells consumables and machinery for lapping and polishing of materials, such as silicon wafers for semiconductor products; sapphire substrates for LED lighting and mobile devices; silicon carbide wafers for LED and power device applications; various glass and silica components for 3D image transmission; quartz and ceramic components for telecommunications devices; and medical device components, and optical and photonics applications. The company sells its products through sales personnel, as well as a network of independent sales representatives and distributors. The company was formerly known as Quartz Engineering & Materials, Inc. and changed its name to Amtech Systems, Inc. in 1987. Amtech Systems, Inc. was founded in 1981 and is headquartered in Tempe, Arizona.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductor Equipment & Materials", "Address": "131 South Clark Drive, Tempe, AZ, United States, 85281", "FullTimeEmployees": "340", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "78248480", "EBITDA": "3384000", "PERatio": "45.8182", "PEGRatio": "2.84", "BookValue": "5.855", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.042", "RevenuePerShareTTM": "4.964", "ProfitMargin": "-0.1828", "OperatingMarginTTM": "0.0369", "ReturnOnAssetsTTM": "0.0141", "ReturnOnEquityTTM": "-0.0107", "RevenueTTM": "70553000", "GrossProfitTTM": "33357000", "DilutedEPSTTM": "-0.908", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.275", "AnalystTargetPrice": "6.5", "TrailingPE": "45.8182", "ForwardPE": "25.3807", "PriceToSalesRatioTTM": "1.0743", "PriceToBookRatio": "0.9103", "EVToRevenue": "0.5499", "EVToEBITDA": "9.8324", "Beta": "1.7297", "52WeekHigh": "7.96", "52WeekLow": "3.55", "50DayMovingAverage": "5.0928", "200DayMovingAverage": "4.9214", "SharesOutstanding": "14048200", "SharesFloat": "11245140", "SharesShort": "30930", "SharesShortPriorMonth": "24300", "ShortRatio": "0.58", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0025", "PercentInsiders": "2.135", "PercentInstitutions": "63.822", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:2", "LastSplitDate": "1999-03-16"}