{"Symbol": "ATEC", "AssetType": "Common Stock", "Name": "Alphatec Holdings, Inc", "Description": "Alphatec Holdings, Inc., a medical technology company, designs, develops, and advances technologies for the surgical treatment of spinal disorders. The company offers SafeOp Neural InformatiX System, an Alpha InformatiX product platform designed to reduce the risk of intraoperative nerve injury; squadron lateral retractor designed to meet the surgeon's needs and to maximize patient outcomes; LLICO access system, a minimally invasive posterior thoracolumbar access system; Invictus Spinal Fixation System, a comprehensive thoracolumbar fixation system to treat a range of pathologies; and Invictus MIS SingleStep designed to improve surgical efficiency without compromising accuracy. It also provides Arsenal spinal fixation system intended for posterior, non-cervical fixation in skeletally mature patients for treating degenerative disc disease, spondylolisthesis, fracture or dislocation, spinal stenosis, curvatures, tumor, pseud arthrosis, and failed previous fusion; zodiac degenerative spinal fixation system, a comprehensive spinal system used to address degenerative spinal conditions and deformity correction; OsseoScrew system to restore the integrity of the spinal column; trestle luxe anterior cervical plate system; and solanas posterior cervico/thoracic fixation system and avalon occipital plate. In addition, the company offers IdentiTi Porous Ti and Transcend Lateral Interbody Implants; Battalion PC; Novel SD; Solus Anterior Lumbar Interbody Fusion System. Further, it is developing EOS imaging products. Additionally, the company offers biologics consisting of AlphaGraft Structural Allograft Spacers, AlphaGraft ProFuse Demineralized Bone Scaffold, Amnioshield Amniotic Tissue Barrier, Alphagraft Demineralized Bone Matrix, and Neocore Osteoconductive Matrix. It sells its products through a network of independent distributors and direct sales representatives in the United States. Alphatec Holdings, Inc. was founded in 1990 and is headquartered in Carlsbad, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "5818 El Camino Real, Carlsbad, CA, United States, 92008", "FullTimeEmployees": "227", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "385173152", "EBITDA": "-21017000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.295", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.324", "RevenuePerShareTTM": "1.994", "ProfitMargin": "-0.5616", "OperatingMarginTTM": "-0.3463", "ReturnOnAssetsTTM": "-0.1783", "ReturnOnEquityTTM": "-1.6987", "RevenueTTM": "121297000", "GrossProfitTTM": "77594000", "DilutedEPSTTM": "-1.12", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.085", "AnalystTargetPrice": "9.8", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.8383", "PriceToBookRatio": "19.3366", "EVToRevenue": "3.3048", "EVToEBITDA": "0", "Beta": "1.9423", "52WeekHigh": "7.93", "52WeekLow": "2.19", "50DayMovingAverage": "5.4056", "200DayMovingAverage": "4.8167", "SharesOutstanding": "64302700", "SharesFloat": "47495900", "SharesShort": "3548947", "SharesShortPriorMonth": "3144751", "ShortRatio": "8.34", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0683", "PercentInsiders": "30.957", "PercentInstitutions": "47.787", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:12", "LastSplitDate": "2016-08-25"}