{"Symbol": "ATLC", "AssetType": "Common Stock", "Name": "Atlanticus Holdings Corporation", "Description": "Atlanticus Holdings Corporation provides credit and related financial services and products to financially underserved consumer credit market in the United States. It operates in two segments, Credit and Other Investments, and Auto Finance. The Credit and Other Investments segment originates a range of consumer loan products, such as retail credit and credit cards through various channels, including retail point-of-sale, direct mail solicitation, digital marketing, and partnerships with third parties; and offers credit to their customers for the purchase of various goods and services, including consumer electronics, furniture, elective medical procedures, healthcare, educational services, and home-improvements by partnering with retailers and service providers. This segment also invests in and services portfolios of credit card receivables. In addition, it offers loan servicing, such as risk management and customer service outsourcing for third parties; and engages in testing and investment activities in consumer finance technology platforms. The Auto Finance segment purchases and/or services loans secured by automobiles from or for a pre-qualified network of independent automotive dealers and automotive finance companies in the buy-here, pay-here, and used car business. This segment also provides floor plan financing and installment lending products. The company was formerly known as CompuCredit Holdings Corporation and changed its name to Atlanticus Holdings Corporation in November 2012. Atlanticus Holdings Corporation was founded in 1996 and is headquartered in Atlanta, Georgia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Credit Services", "Address": "Five Concourse Parkway, Atlanta, GA, United States, 30328", "FullTimeEmployees": "314", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "141575232", "EBITDA": "None", "PERatio": "4.3529", "PEGRatio": "0", "BookValue": "1.53", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.059", "RevenuePerShareTTM": "7.838", "ProfitMargin": "0.3886", "OperatingMarginTTM": "0.3722", "ReturnOnAssetsTTM": "0.053", "ReturnOnEquityTTM": "0.5768", "RevenueTTM": "113416000", "GrossProfitTTM": "-14317000", "DilutedEPSTTM": "2.059", "QuarterlyEarningsGrowthYOY": "1.671", "QuarterlyRevenueGrowthYOY": "5.141", "AnalystTargetPrice": "3", "TrailingPE": "4.3529", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.394", "PriceToBookRatio": "6.4281", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.6841", "52WeekHigh": "18.365", "52WeekLow": "5", "50DayMovingAverage": "8.9833", "200DayMovingAverage": "11.5575", "SharesOutstanding": "15866500", "SharesFloat": "5137272", "SharesShort": "863193", "SharesShortPriorMonth": "794416", "ShortRatio": "89.42", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.2852", "PercentInsiders": "57.985", "PercentInstitutions": "15.518", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2015-05-06", "ExDividendDate": "2009-12-29", "LastSplitFactor": "None", "LastSplitDate": "None"}