{"Symbol": "ATRC", "AssetType": "Common Stock", "Name": "AtriCure, Inc", "Description": "AtriCure, Inc. develops, manufactures, and sells devices for the surgical ablation of cardiac tissue and systems to medical centers in the United States and internationally. The company offers Isolator Synergy and Isolator Synergy Access clamps for the treatment of persistent and long-standing persistent atrial fibrillation concomitant to other open-heart surgical procedures; EPi-Sense guided coagulation system used for the coagulation of tissue; and COBRA Fusion surgical ablation system to combine bipolar temperature-controlled radio frequency energy control with monopolar energy. It also provides multifunctional pens that allow surgeons to evaluate cardiac arrhythmias, perform temporary cardiac pacing, sensing, and stimulation and ablate cardiac tissue with the same device; and linear ablation devices, which enable users to make longer linear lines of ablation. In addition, the company offers cryoICE cryoablation system used to ablate cardiac tissue for the treatment of cardiac arrhythmias; AtriClip system used to occlude the left atrial appendage by mechanically clamping the appendage; and CryoICE CRYO2 cryoablation system to apply cryo-energy to targeted intercostal peripheral nerves in the ribcage and temporarily relieve pain. Further, it provides Lumitip dissector to separate tissues to provide access to key anatomical structures that are targeted for ablation; Fusion Magnetic Retriever System that allows access around anatomical structures; and cardiac surgery instruments, which are used during surgical procedures for repair or replacement of certain heart valves. The company sells its products through independent distributors and direct sales personnel. The company was founded in 2000 and is headquartered in Mason, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "7555 Innovation Way, Mason, OH, United States, 45040", "FullTimeEmployees": "730", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1910495872", "EBITDA": "-17654000", "PERatio": "None", "PEGRatio": "-1.18", "BookValue": "9.276", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.565", "RevenuePerShareTTM": "5.423", "ProfitMargin": "-0.2364", "OperatingMarginTTM": "-0.2303", "ReturnOnAssetsTTM": "-0.0583", "ReturnOnEquityTTM": "-0.1522", "RevenueTTM": "211984000", "GrossProfitTTM": "170335000", "DilutedEPSTTM": "-1.282", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.307", "AnalystTargetPrice": "55.63", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "7.6823", "PriceToBookRatio": "4.4903", "EVToRevenue": "8.0863", "EVToEBITDA": "0", "Beta": "0.7407", "52WeekHigh": "51.76", "52WeekLow": "22.57", "50DayMovingAverage": "42.7283", "200DayMovingAverage": "41.3131", "SharesOutstanding": "44931700", "SharesFloat": "43538381", "SharesShort": "1307506", "SharesShortPriorMonth": "1021410", "ShortRatio": "5.72", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0479", "PercentInsiders": "3.214", "PercentInstitutions": "91.966", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}