{"Symbol": "ATRI", "AssetType": "Common Stock", "Name": "Atrion Corporation", "Description": "Atrion Corporation develops, manufactures, and sells products for fluid delivery, cardiovascular, and ophthalmology applications in the United States, Germany, and internationally. Its fluid delivery products include valves that fill, hold, and release controlled amounts of fluids or gasses for use in various intubation, intravenous, catheter, and other applications in the anesthesia and oncology fields, as well as promote infection control in hospital and home healthcare environments. The company's cardiovascular products comprise MPS2 Myocardial Protection System that delivers fluids and medications, mixes critical drugs, and controls temperature, pressure, and other variables; cardiac surgery vacuum relief valves; silicone vessel loops for retracting and occluding vessels; and inflation devices for balloon catheter dilation, stent deployment, and fluid dispensing, as well as products for use in heart bypass surgery. Its ophthalmic products include specialized medical devices that disinfect contact lenses; and a line of balloon catheters, which are used for the treatment of nasolacrimal duct obstruction in children and adults. The company also manufactures instrumentation and associated disposables that measure the activated clotting time of blood; and a line of products designed for safe needle and scalpel blade containment. In addition, it manufactures inflation systems and valves used in marine and aviation safety products; components used in inflatable survival products and structures; one-way and two-way pressure relief valves that protect sensitive electronics; and other products during transport in other medical and non-medical applications. The company sells its products to physicians, hospitals, clinics, and other treatment centers; and other equipment manufacturers through direct sales personnel, independent sales representatives, and distributors. Atrion Corporation was founded in 1944 and is headquartered in Allen, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "One Allentown Parkway, Allen, TX, United States, 75002-4211", "FullTimeEmployees": "616", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1196133248", "EBITDA": "51503000", "PERatio": "34.934", "PEGRatio": "0", "BookValue": "127.68", "DividendPerShare": "7", "DividendYield": "0.0106", "EPS": "18.95", "RevenuePerShareTTM": "83.736", "ProfitMargin": "0.227", "OperatingMarginTTM": "0.2601", "ReturnOnAssetsTTM": "0.0989", "ReturnOnEquityTTM": "0.1533", "RevenueTTM": "154912000", "GrossProfitTTM": "70688000", "DilutedEPSTTM": "18.95", "QuarterlyEarningsGrowthYOY": "-0.097", "QuarterlyRevenueGrowthYOY": "-0.053", "AnalystTargetPrice": "300", "TrailingPE": "34.934", "ForwardPE": "0", "PriceToSalesRatioTTM": "7.9314", "PriceToBookRatio": "5.1847", "EVToRevenue": "7.6178", "EVToEBITDA": "22.9131", "Beta": "0.1456", "52WeekHigh": "846.15", "52WeekLow": "592.55", "50DayMovingAverage": "649.9995", "200DayMovingAverage": "653.6886", "SharesOutstanding": "1828950", "SharesFloat": "1402514", "SharesShort": "80265", "SharesShortPriorMonth": "82922", "ShortRatio": "13.91", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0536", "PercentInsiders": "21.927", "PercentInstitutions": "66.653", "ForwardAnnualDividendRate": "7", "ForwardAnnualDividendYield": "0.0106", "PayoutRatio": "0.3272", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-14", "LastSplitFactor": "3:2", "LastSplitDate": "1996-12-03"}