{"Symbol": "AUDC", "AssetType": "Common Stock", "Name": "AudioCodes Ltd", "Description": "AudioCodes Ltd. designs, develops, and sells voice over IP (VoIP), converged VoIP, and data networking solutions, products, and applications for enterprise unified communications, contact centers, service provider business services, mobile VoIP, and cloud virtualized data centers. The company's products include IP phones, session border controllers (SBC), media gateways, multi-service business routers, managed IP phones, residential gateways, media servers, mobile communications solutions, value added applications, life cycle management solutions, professional services, and survivable branch appliances; device manager; CloudBond 365, an adaptable solution for the data center, customer premises or the branch; CloudBond 365 CCE appliances; User Management Pack 365, a software management application; and VoIP management and routing, a suite of lifecycle applications for large scale cloud or premises-based unified communications deployments. It also provides VocaNOM call routing products; SmartTAP call recording products; Auto Attendant, a tool for managing inbound calls and delivery services; signal processor chips; communications boards; and voice and data logging hardware integration board products. In addition, the company offers planning, implementation, operations, and support services, as well as consulting and training services. It primarily markets and sells its products through a direct sales force and sales representatives to original equipment manufacturers, system integrators and distributors, and network equipment providers in the telecommunication and networking industries. The company operates in the Americas, Europe, the Far East, and Israel. AudioCodes Ltd. was incorporated in 1992 and is headquartered in Lod, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "1 Hayarden Street, Lod, Israel, 7019900", "FullTimeEmployees": "728", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1007858112", "EBITDA": "29413000", "PERatio": "130.4", "PEGRatio": "0.83", "BookValue": "6.303", "DividendPerShare": "0.28", "DividendYield": "0.0086", "EPS": "0.256", "RevenuePerShareTTM": "7.073", "ProfitMargin": "0.0383", "OperatingMarginTTM": "0.1298", "ReturnOnAssetsTTM": "0.0601", "ReturnOnEquityTTM": "0.056", "RevenueTTM": "209752992", "GrossProfitTTM": "127136000", "DilutedEPSTTM": "0.256", "QuarterlyEarningsGrowthYOY": "0.312", "QuarterlyRevenueGrowthYOY": "0.081", "AnalystTargetPrice": "40.83", "TrailingPE": "130.4", "ForwardPE": "0", "PriceToSalesRatioTTM": "4.8504", "PriceToBookRatio": "5.5441", "EVToRevenue": "4.4909", "EVToEBITDA": "0", "Beta": "0.6566", "52WeekHigh": "44.94", "52WeekLow": "16.21", "50DayMovingAverage": "36.0714", "200DayMovingAverage": "29.8747", "SharesOutstanding": "32685100", "SharesFloat": "23263720", "SharesShort": "316382", "SharesShortPriorMonth": "257301", "ShortRatio": "0.66", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0259", "PercentInsiders": "30.859", "PercentInstitutions": "36.565", "ForwardAnnualDividendRate": "0.28", "ForwardAnnualDividendYield": "0.0086", "PayoutRatio": "1", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-14", "LastSplitFactor": "2:1", "LastSplitDate": "2000-10-10"}