{"Symbol": "AVEO", "AssetType": "Common Stock", "Name": "AVEO Pharmaceuticals, Inc", "Description": "AVEO Pharmaceuticals, Inc., a biopharmaceutical company, develops and commercializes a portfolio of targeted medicines for oncology and other areas of unmet medical needs. It markets its lead candidate, tivozanib, an oral, once-daily, vascular endothelial growth factor receptor tyrosine kinase inhibitor, which is used for the treatment of renal cell carcinoma (RCC). The company has also completed a Phase III TIVO-3 trial of tivozanib for the treatment of RCC; and initiated enrollment in a phase Ib/II clinical trial of tivozanib in combination with Opdivo (nivolumab), an immune checkpoint (PD-1) inhibitor for the treatment of RCC. In addition, it is developing Ficlatuzumab, a potent hepatocyte growth factor inhibitory antibody that is in a Phase II clinical trial for the treatment of squamous cell carcinoma of the head and neck, acute myeloid leukemia, and pancreatic cancer; and AV-203, a potent anti-ErbB3 specific monoclonal antibody, which has completed Phase I clinical trial for treating esophageal cancer. The company's preclinical stage products include AV-380, a potent humanized IgG1 inhibitory monoclonal antibody for the treatment or prevention of cachexia; and AV-353 for the treatment of pulmonary arterial hypertension. AVEO Pharmaceuticals, Inc. has collaboration and license agreements with CANbridge Life Sciences Ltd.; EUSA Pharma (UK) Limited; Novartis International Pharmaceutical Ltd.; Biodesix, Inc.; St. Vincent's Hospital Sydney Limited; Biogen Idec International GmbH; and Kyowa Kirin Co., Ltd. AVEO Pharmaceuticals, Inc. has a clinical collaboration with AstraZeneca PLC to evaluate IMFINZI (durvalumab), a human monoclonal antibody directed against programmed death-ligand 1 (PD-L1). The company was formerly known as GenPath Pharmaceuticals, Inc. and changed its name to AVEO Pharmaceuticals, Inc. in March 2005. AVEO Pharmaceuticals, Inc. was incorporated in 2001 and is headquartered in Boston, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "30 Winter Street, Boston, MA, United States, 02108", "FullTimeEmployees": "19", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "119234344", "EBITDA": "None", "PERatio": "84.8", "PEGRatio": "0", "BookValue": "1.862", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.028", "RevenuePerShareTTM": "1.708", "ProfitMargin": "-0.1327", "OperatingMarginTTM": "-0.2108", "ReturnOnAssetsTTM": "-0.063", "ReturnOnEquityTTM": "-0.1497", "RevenueTTM": "28014000", "GrossProfitTTM": "10837000", "DilutedEPSTTM": "-0.227", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.065", "AnalystTargetPrice": "15.5", "TrailingPE": "84.8", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.7775", "PriceToBookRatio": "2.5404", "EVToRevenue": "2.2375", "EVToEBITDA": "48.8452", "Beta": "1.5225", "52WeekHigh": "10.32", "52WeekLow": "0.4653", "50DayMovingAverage": "4.6028", "200DayMovingAverage": "5.2666", "SharesOutstanding": "25808300", "SharesFloat": "20424184", "SharesShort": "1837517", "SharesShortPriorMonth": "2014422", "ShortRatio": "3.69", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0509", "PercentInsiders": "0.245", "PercentInstitutions": "27.01", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:10", "LastSplitDate": "2020-02-20"}