{"Symbol": "AVNW", "AssetType": "Common Stock", "Name": "Aviat Networks, Inc", "Description": "Aviat Networks, Inc. designs, manufactures, and sells a range of wireless networking products, solutions, and services in North America, Africa, the Middle East, Europe, Russia, Latin America, and the Asia Pacific. Its products include broadband wireless access base stations and customer premises equipment for fixed and mobile networks; and point-to-point digital microwave radio systems for access, backhaul, trunking, and license-exempt applications, as well as supporting new network deployments, network expansion, and capacity upgrades. The company also offers software tools and applications to enable deployment, monitoring, network management, and optimization of its systems, as well as to automate network design and procurement; and sources, supplies, and supports third party equipment, such as antennas, routers, optical transmission equipment, and other equipment to build and deploy telecommunications transmission network. In addition, it provides a suite of professional services, including planning, deployment, operation, optimization, and maintenance of customers' networks. The company serves mobile and fixed telecommunications network operators, and broadband and internet service providers and network operators; federal, state, and local government agencies; and transportation, energy, and utility companies, as well as public safety agencies and broadcast network operators. It markets its products through a direct sales, service, and support organization, as well as through original equipment manufacturers and system integrators; indirectly through dealers, resellers, and sales representatives; and through online. The company was formerly known as Harris Stratex Networks, Inc. and changed its name to Aviat Networks, Inc. in January 2010. Aviat Networks, Inc. was incorporated in 2006 and is headquartered in Austin, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "200 Parker Drive, Austin, TX, United States, 78728", "FullTimeEmployees": "0", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "111096424", "EBITDA": "11814000", "PERatio": "37.9615", "PEGRatio": "0", "BookValue": "12.718", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.048", "RevenuePerShareTTM": "44.267", "ProfitMargin": "0.0011", "OperatingMarginTTM": "0.0311", "ReturnOnAssetsTTM": "0.0266", "ReturnOnEquityTTM": "0.0037", "RevenueTTM": "238642000", "GrossProfitTTM": "84696000", "DilutedEPSTTM": "0.048", "QuarterlyEarningsGrowthYOY": "-0.695", "QuarterlyRevenueGrowthYOY": "-0.025", "AnalystTargetPrice": "21.5", "TrailingPE": "37.9615", "ForwardPE": "19.5313", "PriceToSalesRatioTTM": "0.4466", "PriceToBookRatio": "1.5903", "EVToRevenue": "0.3378", "EVToEBITDA": "9.5661", "Beta": "1.3511", "52WeekHigh": "21.42", "52WeekLow": "7.098", "50DayMovingAverage": "20.4856", "200DayMovingAverage": "14.4171", "SharesOutstanding": "5393030", "SharesFloat": "3984810", "SharesShort": "27134", "SharesShortPriorMonth": "9525", "ShortRatio": "0.27", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0022", "PercentInsiders": "10.144", "PercentInstitutions": "55.564", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:12", "LastSplitDate": "2016-06-14"}