{"Symbol": "BANF", "AssetType": "Common Stock", "Name": "BancFirst Corporation", "Description": "BancFirst Corporation operates as the bank holding company for BancFirst that provides a range of commercial banking services to retail customers, and small to medium-sized businesses. It operates through Metropolitan Banks, Community Banks, Pegasus Bank, and Other Financial Services segments. The company offers checking accounts, negotiable order of withdrawal accounts, savings accounts, money market accounts, sweep accounts, club accounts, individual retirement accounts, and certificates of deposit, as well as overdraft protection and auto draft services. It also provides commercial, financial, and other loans for working capital, facilities acquisition or expansion, purchase of equipment, and other needs; construction, farmland, one-to-four family residence, multifamily residential property, and commercial real estate loans; and loans to finance purchases of consumer goods, such as automobiles, boats, household goods, vacations, and education. In addition, the company engages in the investment management and administration of trusts for individuals, corporations, and employee benefit plans, as well as bond trustee and paying agent business for various Oklahoma municipalities and governmental entities; and provision of item processing, research, and other correspondent banking services. Further, it is involved in real estate investment and insurance agency services; and providing funds transfer, collection, safe deposit box, cash management, retail brokerage, and other services for individual and corporate customers. The company serves customers in non-metropolitan trade centers and cities in the metropolitan statistical areas of Oklahoma. It operates through 108 banking locations in Oklahoma and 3 banking locations in Dallas, Texas. The company was formerly known as United Community Corporation and changed its name to BancFirst Corporation in November 1988. BancFirst Corporation was incorporated in 1984 and is based in Oklahoma City, Oklahoma.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "101 North Broadway, Oklahoma City, OK, United States, 73102", "FullTimeEmployees": "1948", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1464595456", "EBITDA": "None", "PERatio": "13.0917", "PEGRatio": "2.08", "BookValue": "31.663", "DividendPerShare": "1.28", "DividendYield": "0.0285", "EPS": "3.382", "RevenuePerShareTTM": "12.026", "ProfitMargin": "0.2857", "OperatingMarginTTM": "0.3566", "ReturnOnAssetsTTM": "0.013", "ReturnOnEquityTTM": "0.1127", "RevenueTTM": "392799008", "GrossProfitTTM": "410863000", "DilutedEPSTTM": "3.382", "QuarterlyEarningsGrowthYOY": "-0.382", "QuarterlyRevenueGrowthYOY": "-0.104", "AnalystTargetPrice": "44.25", "TrailingPE": "13.0917", "ForwardPE": "15.361", "PriceToSalesRatioTTM": "3.4285", "PriceToBookRatio": "1.3975", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.2879", "52WeekHigh": "63.96", "52WeekLow": "26.0001", "50DayMovingAverage": "42.56", "200DayMovingAverage": "40.3604", "SharesOutstanding": "32662700", "SharesFloat": "18696451", "SharesShort": "748336", "SharesShortPriorMonth": "558591", "ShortRatio": "4.26", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0846", "PercentInsiders": "58.627", "PercentInstitutions": "42.604", "ForwardAnnualDividendRate": "1.28", "ForwardAnnualDividendYield": "0.0285", "PayoutRatio": "0.3787", "DividendDate": "2020-07-15", "ExDividendDate": "2020-06-29", "LastSplitFactor": "2:1", "LastSplitDate": "2017-08-01"}