{"Symbol": "BASI", "AssetType": "Common Stock", "Name": "Bioanalytical Systems, Inc", "Description": "Bioanalytical Systems, Inc., doing business as Inotiv, a pharmaceutical development company, provides drug discovery and development services, and analytical instruments for pharmaceutical, biotechnology, academic, and government organizations in the United States, rest of North America, the Pacific Rim, Europe, and internationally. It operates through two segments, Contract Research Services and Research Products. The Contract Research Services segment offers screening and pharmacological testing, nonclinical safety testing, formulation development, regulatory compliance, and quality control testing services. This segment also provides in vivo sampling services for the continuous monitoring of chemical changes in life; non-clinical toxicology and pathology services; analytical method development and validation; drug metabolism, bioanalysis, and pharmacokinetics testing to measure drug and metabolite concentrations in complex biological matrices; stability testing to ensure the integrity of various solutions used in nonclinical and clinical studies, and post-study analyses; and climate-controlled archiving services for its customers' data and samples. The Research Products segment offers analytical products comprising liquid chromatographic and electrochemical instruments with associated accessories; in vivo sampling products consisting of Culex family of automated in vivo sampling and dosing instruments; and Vetronics' products, such as instruments and related software to monitor and diagnose cardiac function, and measure other vital physiological parameters in cats and dogs in veterinary clinics. Bioanalytical Systems, Inc. was founded in 1974 and is headquartered in West Lafayette, Indiana.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "2701 Kent Avenue, West Lafayette, IN, United States, 47906", "FullTimeEmployees": "311", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "51319096", "EBITDA": "3219000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.839", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.124", "RevenuePerShareTTM": "5.543", "ProfitMargin": "-0.0438", "OperatingMarginTTM": "0.0059", "ReturnOnAssetsTTM": "0.0043", "ReturnOnEquityTTM": "-0.2661", "RevenueTTM": "59481000", "GrossProfitTTM": "12921000", "DilutedEPSTTM": "-0.253", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.452", "AnalystTargetPrice": "2.15", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.8479", "PriceToBookRatio": "5.6128", "EVToRevenue": "1.438", "EVToEBITDA": "37.9134", "Beta": "1.4802", "52WeekHigh": "5.99", "52WeekLow": "2.731", "50DayMovingAverage": "5.04", "200DayMovingAverage": "4.6518", "SharesOutstanding": "10989100", "SharesFloat": "7221355", "SharesShort": "21312", "SharesShortPriorMonth": "12422", "ShortRatio": "0.4", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0018", "PercentInsiders": "34.699", "PercentInstitutions": "9.398", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}