{"Symbol": "BCOV", "AssetType": "Common Stock", "Name": "Brightcove Inc", "Description": "Brightcove Inc. provides cloud-based services for video. Its flagship product include Video Cloud, an online video platform that enables its customers to publish and distribute video to Internet-connected devices. The company also offers Video Marketing Suite, a suite of video technologies to drive awareness, engagement, and conversion; Enterprise Video Suite, an enterprise-class platform for internal communications, employee training, live streaming, marketing, and e-commerce videos; and OTT Flow, a service for media companies and content owners to deploy direct-to-consumer, live and on-demand video services across platforms. In addition, it provides Zencoder, a cloud-based video encoding service; SSAI, a cloud-based ad insertion and video stitching service; Player, a cloud-based service to create and manage video player experiences; and Ooyala, an online video platform. Further, the company offers Brightcove Beacon, an app that enables companies to deliver and launch over the top video experiences on mobile, web, and smart and connected TVs; and Brightcove Campaign, an app that enables marketers to create video-driven marketing campaigns. Additionally, it provides account management, professional, support, and training services. The company serves media, sports, and entertainment companies, broadcasters, publishers, fashion and hospitality brands and corporations, faith-based institutions, e-commerce platforms, and hi-tech organizations; and governments, educational institutions, and non-profit organizations through direct sales, referral and channel partners, and resellers in North America, Europe, Japan, the Asia Pacific, and internationally, as well as sells its products online. The company was formerly known as Video Marketplace, Inc. and changed its name to Brightcove Inc. in March 2005. Brightcove Inc. was founded in 2004 and is headquartered in Boston, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "290 Congress Street, Boston, MA, United States, 02210", "FullTimeEmployees": "607", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "439470560", "EBITDA": "1342000", "PERatio": "None", "PEGRatio": "-1.27", "BookValue": "1.765", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.498", "RevenuePerShareTTM": "4.87", "ProfitMargin": "-0.0993", "OperatingMarginTTM": "-0.0196", "ReturnOnAssetsTTM": "-0.0134", "ReturnOnEquityTTM": "-0.2658", "RevenueTTM": "189616000", "GrossProfitTTM": "109279000", "DilutedEPSTTM": "-0.484", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.007", "AnalystTargetPrice": "13.33", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.2854", "PriceToBookRatio": "6.3062", "EVToRevenue": "2.269", "EVToEBITDA": "140.1415", "Beta": "0.9297", "52WeekHigh": "13.36", "52WeekLow": "5.44", "50DayMovingAverage": "10.19", "200DayMovingAverage": "8.4255", "SharesOutstanding": "39414400", "SharesFloat": "22706246", "SharesShort": "720207", "SharesShortPriorMonth": "741942", "ShortRatio": "1.07", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0223", "PercentInsiders": "1.694", "PercentInstitutions": "87.394", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}