{"Symbol": "BCPC", "AssetType": "Common Stock", "Name": "Balchem Corporation", "Description": "Balchem Corporation develops, manufactures, and markets specialty performance ingredients and products for the food, nutritional, feed, pharmaceutical, medical sterilization, and industrial markets in the United States and internationally. The company's Human Nutrition & Health segment supplies ingredients in the food and beverage industry. Its products include spray dried and emulsified powders, blended lipid systems, liquid flavor delivery systems, juice and dairy bases, chocolate systems, and cereal systems, as well as ice cream bases and variegates. This segment also offers microencapsulation solutions; and human grade choline nutrients and mineral amino acid chelated products for wellness applications. Its Animal Nutrition & Health segment provides microencapsulated products to enhance health and milk production in ruminant animals; chelation technology, which offers enhanced nutrient absorption for various species of production and companion animals; and choline chloride, a nutrient for monogastric animal health. The company's Specialty Products segment offers ethylene oxide primarily for use in the health care industry; and single use canisters with ethylene oxide for sterilizing re-usable devices. It also sells propylene oxide, a fumigant to aid in the control of insects and microbiological spoilage, as well as to reduce bacterial and mold contamination in shell and processed nut meats, processed spices, cacao beans, cocoa powder, raisins, figs, and prunes; and chelated minerals for high value crops. The company's Industrial Products segment provides choline chloride derivatives for hydraulic fracturing of shale natural gas wells; and methylamines, which are building blocks for the manufacture of choline products, as well as used in industrial applications. The company sells its products through sales force, independent distributors, and sales agents. Balchem Corporation was founded in 1967 and is headquartered in New Hampton, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Basic Materials", "Industry": "Specialty Chemicals", "Address": "52 Sunrise Park Road, New Hampton, NY, United States, 10958", "FullTimeEmployees": "1424", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3156233472", "EBITDA": "155008000", "PERatio": "38.6984", "PEGRatio": "8.061", "BookValue": "24.505", "DividendPerShare": "0.52", "DividendYield": "0.0053", "EPS": "2.52", "RevenuePerShareTTM": "20.953", "ProfitMargin": "0.1218", "OperatingMarginTTM": "0.1573", "ReturnOnAssetsTTM": "0.0588", "ReturnOnEquityTTM": "0.1075", "RevenueTTM": "672913024", "GrossProfitTTM": "211367000", "DilutedEPSTTM": "2.52", "QuarterlyEarningsGrowthYOY": "0.066", "QuarterlyRevenueGrowthYOY": "0.073", "AnalystTargetPrice": "115.33", "TrailingPE": "38.6984", "ForwardPE": "34.1297", "PriceToSalesRatioTTM": "4.7072", "PriceToBookRatio": "3.9805", "EVToRevenue": "4.908", "EVToEBITDA": "21.6952", "Beta": "0.6242", "52WeekHigh": "113.925", "52WeekLow": "78.3", "50DayMovingAverage": "99.5936", "200DayMovingAverage": "96.2995", "SharesOutstanding": "32348400", "SharesFloat": "32101608", "SharesShort": "494519", "SharesShortPriorMonth": "493071", "ShortRatio": "3.44", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0187", "PercentInsiders": "0.764", "PercentInstitutions": "88.628", "ForwardAnnualDividendRate": "0.52", "ForwardAnnualDividendYield": "0.0053", "PayoutRatio": "0.2063", "DividendDate": "2020-01-17", "ExDividendDate": "2019-12-27", "LastSplitFactor": "3:2", "LastSplitDate": "2010-01-21"}