{"Symbol": "BDE", "AssetType": "Common Stock", "Name": "Black Diamond, Inc", "Description": "Black Diamond, Inc., together with its subsidiaries, designs, manufactures, and markets outdoor performance equipment and apparel for climbing, mountaineering, backpacking, skiing, cycling, and other outdoor recreation activities in the United States and internationally. The company provides climbing products, such as belay/rappel devices, bouldering products, carabiners and quickdraws, chalk, chalk bags, climbing packs, crampons, crash pads, harnesses, ice axes, ice and rock protection devices, and various other climbing accessories; and skiing products comprising technical apparel, helmets, airbags, winter packs for skiing and snowboarding, bindings, body armor, boots, goggles, poles, skis, skins, snow gloves, and snow packs, as well as avalanche safety devices, including transceivers, probes, and shovels. It also offers mountain line products, such as mountaineering backpacks for backpacking, expeditions, alpinism, and day uses in the outdoor and urban environments, as well as gaiters, gloves, headlamps, lights, tents, trekking poles, and various other hiking and mountaineering accessories; and wheels line products comprising eyewear, hydration packs, and apparel for mountain and road cycling. Black Diamond, Inc. sells its products under the Black Diamond, POC, and PIEPS brands to mountain climbers, winter outdoor enthusiasts, backpackers, cyclists, ski racers, and outdoor-inspired consumers. The company offers its products through independent specialty stores; specialty chains, including premium sporting goods and outdoor recreation stores, and consumer catalogs; and online at blackdiamondequipment.com and pocsports.com. Black Diamond, Inc. is headquartered in Salt Lake City, Utah.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "0", "FiscalYearEnd": "None", "LatestQuarter": "None", "MarketCapitalization": "0", "EBITDA": "0", "PERatio": "None", "PEGRatio": "6.29", "BookValue": "0", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-2.4", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "7.67", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}