{"Symbol": "BEAT", "AssetType": "Common Stock", "Name": "BioTelemetry, Inc", "Description": "BioTelemetry, Inc., a remote medical technology company, provides remote cardiac monitoring, remote blood glucose monitoring, centralized core laboratory services for clinical trials, and original equipment manufacturing services for healthcare and clinical research customers worldwide. It operates in two segments, Healthcare and Research. The Healthcare segment focuses on the remote cardiac monitoring to identify cardiac arrhythmias or heart rhythm disorders. This segment offers mobile cardiac telemetry services; and event monitoring services, which enable physicians to prescribe wireless event, digital loop event, memory loop event, memory loop event, and non-loop event monitors. It also provides traditional and extended Holter, pacemaker, international normalized ratio, implantable loop recorder, and other implantable cardiac device monitoring services. It serves cardiologists, electrophysiologists, neurologists, and primary care physicians. The Research segment offers laboratory services, such as cardiac monitoring, imaging, scientific consulting, and data management services for drug and medical device trials. Its centralized services comprise electrocardiogram, Holter monitoring, ambulatory blood pressure monitoring, echocardiography, multigated acquisition scan, imaging, protocol development, expert reporting, and statistical analysis. It also provides support services, such as project coordination, setup and management, equipment rental, data transfer, processing, analysis, and 24/7 customer support and site training. The company also focuses on manufacturing, testing, and marketing of cardiac devices and blood glucose monitoring devices, as well as offers contract manufacturing services. BioTelemetry, Inc. was founded in 1994 and is headquartered in Malvern, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "1000 Cedar Hollow Road, Malvern, PA, United States, 19355", "FullTimeEmployees": "1700", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1363659520", "EBITDA": "100596000", "PERatio": "75.6038", "PEGRatio": "1.48", "BookValue": "11.228", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.53", "RevenuePerShareTTM": "12.061", "ProfitMargin": "0.0467", "OperatingMarginTTM": "0.1371", "ReturnOnAssetsTTM": "0.0514", "ReturnOnEquityTTM": "0.0527", "RevenueTTM": "412038016", "GrossProfitTTM": "252506000", "DilutedEPSTTM": "0.53", "QuarterlyEarningsGrowthYOY": "-0.739", "QuarterlyRevenueGrowthYOY": "-0.127", "AnalystTargetPrice": "57.75", "TrailingPE": "75.6038", "ForwardPE": "28.0112", "PriceToSalesRatioTTM": "3.3634", "PriceToBookRatio": "3.5688", "EVToRevenue": "3.3285", "EVToEBITDA": "17.1173", "Beta": "1.2071", "52WeekHigh": "55.85", "52WeekLow": "27.35", "50DayMovingAverage": "41.8947", "200DayMovingAverage": "43.3212", "SharesOutstanding": "34185500", "SharesFloat": "28706243", "SharesShort": "2617604", "SharesShortPriorMonth": "2098581", "ShortRatio": "10.75", "ShortPercentOutstanding": "0.11", "ShortPercentFloat": "0.1759", "PercentInsiders": "2.811", "PercentInstitutions": "95.579", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}