{"Symbol": "BECN", "AssetType": "Common Stock", "Name": "Beacon Roofing Supply, Inc", "Description": "Beacon Roofing Supply, Inc., together with its subsidiaries, distributes residential and commercial roofing materials, and other complementary building materials to contractors, home builders, retailers, and building materials suppliers. The company's residential roofing products include asphalt shingles, synthetic slates and tiles, clay and concrete tiles, slates, nail base insulations, metal roofing, felts, synthetic underlayment, wood shingles and shakes, nails and fasteners, metal edgings and flashings, prefabricated flashings, ridges and soffit vents, and solar systems. Its non-residential roofing products comprise single-ply roofing, asphalt, metal, modified bitumen, and build-up roofing products; cements and coatings; flat stock and tapered insulations; commercial fasteners; metal edges and flashings; smoke/roof hatches; roofing tools; sheet metal products, including copper, aluminum, and steel; and PVC, thermoplastic olefin, and ethylene propylene diene monomer membrane products. The company also provides complementary building products, such as vinyl and fiber cement sidings; wallboards; insulations; acoustical ceilings; stone veneers; windows; doors; skylights; gutters and downspouts; decking and railings; air barriers; concrete restoration systems; and steel stud framing and waterproofing systems. In addition, it offers value-added services, including advice and assistance on product identification, specification, technical support, and training; job site delivery, rooftop loading, and logistical services; tapered insulation design and related layout services; metal fabrication and related metal roofing design and layout services; trade credit and online bill pay; and marketing support for contractors. As of September 30, 2019, the company operated through a network of 529 branches in 50 states of the United States and 6 provinces in Canada. Beacon Roofing Supply, Inc. was founded in 1928 and is headquartered in Herndon, Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Building Products & Equipment", "Address": "505 Huntmar Park Drive, Herndon, VA, United States, 20170", "FullTimeEmployees": "8147", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2322185216", "EBITDA": "419571008", "PERatio": "None", "PEGRatio": "1.65", "BookValue": "24.491", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.274", "RevenuePerShareTTM": "101.234", "ProfitMargin": "-0.018", "OperatingMarginTTM": "0.0232", "ReturnOnAssetsTTM": "0.0146", "ReturnOnEquityTTM": "-0.058", "RevenueTTM": "6956016128", "GrossProfitTTM": "1736555000", "DilutedEPSTTM": "-2.174", "QuarterlyEarningsGrowthYOY": "-0.434", "QuarterlyRevenueGrowthYOY": "-0.069", "AnalystTargetPrice": "34", "TrailingPE": "0", "ForwardPE": "14.3472", "PriceToSalesRatioTTM": "0.3173", "PriceToBookRatio": "1.3192", "EVToRevenue": "0.7765", "EVToEBITDA": "13.8626", "Beta": "1.8484", "52WeekHigh": "36.78", "52WeekLow": "11.665", "50DayMovingAverage": "30.2714", "200DayMovingAverage": "25.219", "SharesOutstanding": "68877600", "SharesFloat": "51024500", "SharesShort": "3986774", "SharesShortPriorMonth": "4023962", "ShortRatio": "6.92", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0626", "PercentInsiders": "0.691", "PercentInstitutions": "106", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:2", "LastSplitDate": "2006-06-13"}