{"Symbol": "BIIB", "AssetType": "Common Stock", "Name": "Biogen Inc", "Description": "Biogen Inc. discovers, develops, manufactures, and delivers therapies for treating neurological and neurodegenerative diseases worldwide. The company offers TECFIDERA, AVONEX, PLEGRIDY, TYSABRI, and FAMPYRA for multiple sclerosis (MS); SPINRAZA for the treatment of spinal muscular atrophy; and FUMADERM to treat plaque psoriasis. It also provides BENEPALI, an etanercept biosimilar referencing ENBREL; IMRALDI, an adalimumab biosimilar referencing HUMIRA; and FLIXABI, an infliximab biosimilar referencing REMICADE. In addition, the company offers RITUXAN for the treatment of non-Hodgkin's lymphoma, chronic lymphocytic leukemia (CLL), rheumatoid arthritis, two forms of ANCA-associated vasculitis, and pemphigus vulgaris; RITUXAN HYCELA for non-Hodgkin's lymphoma and CLL; GAZYVA to treat CLL and follicular lymphoma; and OCREVUS for the treatment of relapsing MS and primary progressive MS; and other anti-CD20 therapies. Further, it is involved in developing Opicinumab, BIIB061, and BIIB091 for MS and neuroimmunology; Aducanumab, BAN2401, BIIB092, BIIB076, and BIIB080 to treat Alzheimer's disease and dementia; BIIB067, BIIB078, BIIB110, and BIIB100 to treat neuromuscular disorders; BIIB054 and BIIB094 for treating movement disorders; BIIB111 and BIIB112 for ophthalmology; Dapirolizumab pegol and BIIB059 to treat immunology and others; BIIB104 for neurocognitive disorders; BIIB093, TMS-007, and Natalizumab to treat acute neurology; BIIB074 and BIIB095 for pain; and SB11 biosimilar, which are under various stages of development. The company offers products through its sales force and marketing groups. Biogen Inc. has collaboration agreements with Genentech, Inc.; Ionis Pharmaceuticals, Inc.; Eisai Co., Ltd.; Alkermes Pharma Ireland Limited; Bristol-Myers Squibb Company; Acorda Therapeutics, Inc.; AbbVie Inc.; Skyhawk Therapeutics, Inc.; Neurimmune SubOne AG; and Sangamo Therapeutics Inc. The company was founded in 1978 and is headquartered in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "225 Binney Street, Cambridge, MA, United States, 02142", "FullTimeEmployees": "7400", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "44558774272", "EBITDA": "8045700096", "PERatio": "8.2039", "PEGRatio": "6.2424", "BookValue": "71.438", "DividendPerShare": "None", "DividendYield": "0", "EPS": "34.044", "RevenuePerShareTTM": "83.38", "ProfitMargin": "0.4091", "OperatingMarginTTM": "0.5237", "ReturnOnAssetsTTM": "0.1831", "ReturnOnEquityTTM": "0.4938", "RevenueTTM": "14487300096", "GrossProfitTTM": "12422500000", "DilutedEPSTTM": "34.044", "QuarterlyEarningsGrowthYOY": "0.222", "QuarterlyRevenueGrowthYOY": "0.018", "AnalystTargetPrice": "305.39", "TrailingPE": "8.2039", "ForwardPE": "8.2919", "PriceToSalesRatioTTM": "3.355", "PriceToBookRatio": "3.9094", "EVToRevenue": "3.294", "EVToEBITDA": "5.8759", "Beta": "0.5374", "52WeekHigh": "374.99", "52WeekLow": "215.775", "50DayMovingAverage": "282.0283", "200DayMovingAverage": "297.0868", "SharesOutstanding": "158312992", "SharesFloat": "314635359", "SharesShort": "3261515", "SharesShortPriorMonth": "4653837", "ShortRatio": "2.01", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0151", "PercentInsiders": "0.657", "PercentInstitutions": "93.155", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:1", "LastSplitDate": "2001-01-18"}