{"Symbol": "BIOC", "AssetType": "Common Stock", "Name": "Biocept, Inc", "Description": "Biocept, Inc., an early stage molecular oncology diagnostics company, develops and commercializes proprietary circulating tumor cell and circulating tumor DNA assays utilizing a standard blood sample. The company's cancer assays provide information to healthcare providers to identify oncogenic alterations that qualify a subset of cancer patients for targeted therapy at diagnosis, progression, and monitoring in order to identify resistance mechanisms. It offers assays for solid tumor indications, such as breast cancer, non-small cell lung cancer, small cell lung cancer, gastric cancer, colorectal cancer, prostate cancer, melanoma, pancreaticobiliary cancer, and ovarian cancer. The company's Target-Selector molecular technology enables detection of mutations and genome alterations with enhanced sensitivity and specificity, as well as is applicable to nucleic acid from ctDNA. In addition, it offers laboratory services to medical oncologists, surgical oncologists, urologists, pulmonologists, pathologists, and other physicians to determine the treatment plan for their patients, as well as to pharmaceutical and biopharmaceutical companies developing drug candidate therapies to treat cancer. The company sells its cancer diagnostic assays directly to oncologists and other physicians at private and group practices, hospitals, laboratories, and cancer centers in the United States, as well as markets its clinical trial and research services to pharmaceutical and biopharmaceutical companies, and clinical research organizations. Biocept, Inc. was founded in 1997 and is headquartered in San Diego, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "5810 Nancy Ridge Drive, San Diego, CA, United States, 92121", "FullTimeEmployees": "88", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "89267008", "EBITDA": "-22827566", "PERatio": "None", "PEGRatio": "-0.04", "BookValue": "0.199", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-2.631", "RevenuePerShareTTM": "0.089", "ProfitMargin": "0", "OperatingMarginTTM": "-4.2094", "ReturnOnAssetsTTM": "-0.5644", "ReturnOnEquityTTM": "-1.3391", "RevenueTTM": "5677024", "GrossProfitTTM": "-5448954", "DilutedEPSTTM": "-0.411", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.23", "AnalystTargetPrice": "2.03", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "7.5266", "PriceToBookRatio": "3.435", "EVToRevenue": "12.0974", "EVToEBITDA": "0", "Beta": "0.7462", "52WeekHigh": "1.3", "52WeekLow": "0.2112", "50DayMovingAverage": "0.7919", "200DayMovingAverage": "0.5364", "SharesOutstanding": "133934000", "SharesFloat": "124913838", "SharesShort": "4929099", "SharesShortPriorMonth": "2870076", "ShortRatio": "0.16", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.033", "PercentInsiders": "0.033", "PercentInstitutions": "7.985", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:30", "LastSplitDate": "2018-07-10"}