{"Symbol": "BKEPP", "AssetType": "Common Stock", "Name": "Blueknight Energy Partners, L.P", "Description": "Blueknight Energy Partners, L.P. provides integrated terminalling, gathering, and transportation services for companies engaged in the production, distribution, and marketing of liquid asphalt and crude oil products in the United States. The company operates through four segments: Asphalt Terminalling Services, Crude Oil Terminalling Services, Crude Oil Pipeline Services, and Crude Oil Trucking Services. The company's Asphalt Terminalling Services segment offers asphalt terminalling services, including storage, blending, processing, and throughput services for liquid asphalt product and residual fuel oil. As of March 23, 2020, this segment had 53 terminals located in 26 states. Its Crude Oil Terminalling Services segment provides terminalling services, including storage, blending, processing, and throughput services for crude oil. This segment owns and operates 34 crude oil storage tanks with approximately 6.6 million barrels of storage capacity. The company's Crude Oil Pipeline Services segment owns and operates crude oil transportation system with a combined length of approximately 611 miles; and purchases crude oil from production leases in Oklahoma and markets those barrels at the Cushing Interchange. Its Crude Oil Trucking Services segment owns and leases tanker trucks for gathering crude oil for its customers at remote wellhead locations. This segment owns or leases approximately 63 tanker trucks. Blueknight Energy Partners G.P., L.L.C. operates as a general partner of the company. The company was formerly known as SemGroup Energy Partners, L.P. and changed its name to Blueknight Energy Partners, L.P. in December 2009. Blueknight Energy Partners, L.P. was founded in 2007 and is headquartered in Tulsa, Oklahoma.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Midstream", "Address": "6060 American Plaza, Tulsa, OK, United States, 74135", "FullTimeEmployees": "270", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "248705968", "EBITDA": "58693000", "PERatio": "None", "PEGRatio": "0", "BookValue": "8.35", "DividendPerShare": "0.71", "DividendYield": "0.1224", "EPS": "-1.579", "RevenuePerShareTTM": "7.718", "ProfitMargin": "0.0394", "OperatingMarginTTM": "0.1073", "ReturnOnAssetsTTM": "0.0702", "ReturnOnEquityTTM": "-2.0839", "RevenueTTM": "315812992", "GrossProfitTTM": "54124000", "DilutedEPSTTM": "-0.31", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.432", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "2.2209", "52WeekHigh": "5.99", "52WeekLow": "3.54", "50DayMovingAverage": "5.7886", "200DayMovingAverage": "5.2992", "SharesOutstanding": "0", "SharesFloat": "35259524", "SharesShort": "4710", "SharesShortPriorMonth": "4553", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "10.422", "ForwardAnnualDividendRate": "0.71", "ForwardAnnualDividendYield": "0.1224", "PayoutRatio": "0", "DividendDate": "2020-08-14", "ExDividendDate": "2020-08-03", "LastSplitFactor": "None", "LastSplitDate": "None"}