{"Symbol": "BLIN", "AssetType": "Common Stock", "Name": "Bridgeline Digital, Inc", "Description": "Bridgeline Digital, Inc. operates as a digital engagement company in the United States. The company's Bridgeline's Unbound platform enables companies and developers to create Websites, Web applications, and online stores. It offers Bridgeline Unbound Experience Manager, a marketing automation engine and content management system; Bridgeline Unbound Content Manager that enables non-technical users to create, edit, and publish content via a browser-based interface; and Bridgeline Unbound Commerce, an online B2B and B2C commerce solution that allows users to manage domestic and international commerce initiatives. The company also provides Bridgeline Unbound Marketing, an online marketing management solution that helps marketers drive to their sites through personalized and targeted marketing automation flows; and Bridgeline Unbound Insights to manage, measure, and optimize Web properties by recording detailed events and mining data for statistical analysis. In addition, it offers Bridgeline Unbound Social, a social media management solution that empowers customers to set up customized watch lists; and Bridgeline Unbound Franchises, a Web content management and e-commerce platform to multi-unit organizations and franchises. Further, the company provides digital strategy, Web design and development, usability engineering, information architecture, and search engine optimization services; application monitoring, emergency response, version control, load balancing, managed firewall security, and virus protection services; and shared, dedicated, and Software as a Service hosting services. It serves vertical markets, such as financial services, retail brand names, health services and life sciences, technology, credit unions and regional banks, and associations and foundations through its direct sales force. The company was formerly known as Bridgeline Software, Inc. Bridgeline Digital, Inc. was founded in 2000 and is based in Burlington, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "100 Summit Drive, Burlington, MA, United States, 01803", "FullTimeEmployees": "72", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "8840340", "EBITDA": "-4713000", "PERatio": "0.6123", "PEGRatio": "0", "BookValue": "0.735", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.451", "RevenuePerShareTTM": "3.608", "ProfitMargin": "-0.0046", "OperatingMarginTTM": "-0.2891", "ReturnOnAssetsTTM": "-0.1606", "ReturnOnEquityTTM": "-0.0069", "RevenueTTM": "10890000", "GrossProfitTTM": "4592000", "DilutedEPSTTM": "-0.846", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.023", "AnalystTargetPrice": "4.2", "TrailingPE": "0.6123", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5515", "PriceToBookRatio": "2.709", "EVToRevenue": "0.8268", "EVToEBITDA": "9.6095", "Beta": "2.9709", "52WeekHigh": "3.62", "52WeekLow": "0.5323", "50DayMovingAverage": "2.2747", "200DayMovingAverage": "1.5235", "SharesOutstanding": "4420170", "SharesFloat": "4360100", "SharesShort": "56305", "SharesShortPriorMonth": "57630", "ShortRatio": "0.09", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0203", "PercentInsiders": "9.399", "PercentInstitutions": "4.109", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:50", "LastSplitDate": "2019-05-02"}