{"Symbol": "BLKB", "AssetType": "Common Stock", "Name": "Blackbaud, Inc", "Description": "Blackbaud, Inc. provides cloud software solutions to nonprofits, foundations, companies, education institutions, healthcare organizations, and individual change agents in the United States and internationally. The company offers fundraising and relationship management solutions and services, including Blackbaud Raiser's Edge NXT, Blackbaud CRM, Blackbaud eTapestry, Blackbaud TeamRaiser, everydayhero, Blackbaud Peer-to-Peer Fundraising, and Blackbaud Guided Fundraising and Blackbaud Volunteer Network Fundraising; and marketing and engagement solutions, such as Blackbaud Luminate Online, Blackbaud Online Express, Blackbaud Attentive.ly, and Blackbaud School Website System. It also provides Blackbaud Financial Edge NXT, Blackbaud Tuition Management, and Blackbaud Financial Aid Management Aid financial management solutions and services; and Blackbaud Grantmaking and Blackbaud Award Management grant and award management solutions. In addition, the company offers organizational and program management solutions and services comprising Blackbaud Student Information System, Blackbaud Learning Management System, Blackbaud Enrollment Management System, Blackbaud Altru, and Blackbaud Church Management; and YourCause social responsibility solutions. Further, it provides Blackbaud Merchant Services and Blackbaud Purchase Cards payment services; and Blackbaud's Intelligence for Good solutions, as well as donor acquisition, prospect research, data enrichment, and benchmarking and performance management solutions and services. Additionally, the company offers customer support and maintenance, professional and managed, and training services. It sells its solutions and related services through its direct sales force. The company was founded in 1981 and is headquartered in Charleston, South Carolina.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "65 Fairchild Street, Charleston, SC, United States, 29492", "FullTimeEmployees": "3611", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3261050112", "EBITDA": "117542000", "PERatio": "139.6957", "PEGRatio": "2.0809", "BookValue": "8.514", "DividendPerShare": "0.48", "DividendYield": "0.0097", "EPS": "0.46", "RevenuePerShareTTM": "19.072", "ProfitMargin": "0.0244", "OperatingMarginTTM": "0.0545", "ReturnOnAssetsTTM": "0.0165", "ReturnOnEquityTTM": "0.0571", "RevenueTTM": "914571008", "GrossProfitTTM": "483199000", "DilutedEPSTTM": "0.46", "QuarterlyEarningsGrowthYOY": "0.604", "QuarterlyRevenueGrowthYOY": "0.028", "AnalystTargetPrice": "65.83", "TrailingPE": "139.6957", "ForwardPE": "24.7525", "PriceToSalesRatioTTM": "3.4073", "PriceToBookRatio": "7.7548", "EVToRevenue": "4.0994", "EVToEBITDA": "28.5027", "Beta": "1.1484", "52WeekHigh": "95.59", "52WeekLow": "38.22", "50DayMovingAverage": "61.0242", "200DayMovingAverage": "58.8717", "SharesOutstanding": "49575100", "SharesFloat": "47565289", "SharesShort": "3556685", "SharesShortPriorMonth": "3087702", "ShortRatio": "6.36", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.0775", "PercentInsiders": "1.627", "PercentInstitutions": "106.328", "ForwardAnnualDividendRate": "0.48", "ForwardAnnualDividendYield": "0.0097", "PayoutRatio": "0.7826", "DividendDate": "2020-03-13", "ExDividendDate": "2020-02-27", "LastSplitFactor": "None", "LastSplitDate": "None"}