{"Symbol": "BMRN", "AssetType": "Common Stock", "Name": "BioMarin Pharmaceutical Inc", "Description": "BioMarin Pharmaceutical Inc., a biotechnology company, develops and commercializes therapies for people with serious and life-threatening rare diseases and medical conditions. Its commercial products include Aldurazyme to treat mucopolysaccharidosis I, a genetic disease; Brineura for the treatment of late infantile neuronal ceroid lipofuscinosis type 2, a form of Batten disease; and Kuvan, a proprietary synthetic oral form of 6R-BH4 that is used to treat patients with phenylketonuria (PKU), an inherited metabolic disease. The company's commercial products also comprise Naglazyme, a recombinant form of N-acetylgalactosamine 4-sulfatase for patients with mucopolysaccharidosis VI; Palynziq, a PEGylated recombinant phenylalanine ammonia lyase enzyme for adult patients with PKU; and Vimizim, an enzyme replacement therapy for the treatment of mucopolysaccharidosis IV Type A, a lysosomal storage disorder. Its clinical and pre-clinical product pipeline includes valoctocogene roxaparvovec, an adeno associated virus vector, which is in Phase III clinical trial for the treatment of patients with severe hemophilia A; vosoritide, a peptide therapeutic that is in Phase III clinical trial for the treatment of achondroplasia, a form of disproportionate short stature in humans; and BMN 307, an AAV5 mediated gene therapy to normalize blood phenylalanine concentration levels in patients with phenylketonuria. The company serves specialty pharmacies; and end-users, such as hospitals and foreign government agencies, as well as distributors and pharmaceutical wholesalers in the United States, Europe, Latin America, and internationally. BioMarin Pharmaceutical Inc. has collaboration and license agreements with Sarepta Therapeutics and Asubio Pharma Co., Ltd.; and a preclinical collaboration and license agreement with DiNAQOR AG for the development of gene therapies to treat rare genetic cardiomyopathies. The company was founded in 1996 and is headquartered in San Rafael, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "770 Lindaro Street, San Rafael, CA, United States, 94901", "FullTimeEmployees": "3001", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13851512832", "EBITDA": "97906000", "PERatio": "110.9265", "PEGRatio": "0.9875", "BookValue": "17.868", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.676", "RevenuePerShareTTM": "10.269", "ProfitMargin": "0.0662", "OperatingMarginTTM": "-0.0053", "ReturnOnAssetsTTM": "-0.0013", "ReturnOnEquityTTM": "0.0395", "RevenueTTM": "1847094016", "GrossProfitTTM": "629575000", "DilutedEPSTTM": "0.676", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.108", "AnalystTargetPrice": "111.27", "TrailingPE": "110.9265", "ForwardPE": "60.6061", "PriceToSalesRatioTTM": "7.4275", "PriceToBookRatio": "4.2263", "EVToRevenue": "7.446", "EVToEBITDA": "72.5347", "Beta": "1.0467", "52WeekHigh": "131.945", "52WeekLow": "62.88", "50DayMovingAverage": "111.9814", "200DayMovingAverage": "100.4163", "SharesOutstanding": "181350000", "SharesFloat": "180103725", "SharesShort": "10539174", "SharesShortPriorMonth": "9852953", "ShortRatio": "10.26", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0646", "PercentInsiders": "0.495", "PercentInstitutions": "99.303", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}