{"Symbol": "BNFT", "AssetType": "Common Stock", "Name": "Benefitfocus, Inc", "Description": "Benefitfocus, Inc. provides cloud-based benefits management platform for consumers, employers, insurance carriers, suppliers, and brokers in the United States. The company's products for insurance carriers include MarketPlace Enroll for carriers to automate enrollment to various commercial group business; MarketPlace Bill, an electronic invoice presentment and payment solution; MarketPlace Exchange, a solution that bridges the integration gap between carrier and employer systems; and MarketPlace Quote for carriers and brokers tools to organize and manage accounts, track leads, generate quotes, and create proposals for various products. Its products for employers include Benefitfocus Marketplace that streamlines online enrollment, employee communication, and benefit administration; Insights, a data analytics solution; ACA Management and Reporting, a solution for employers to manage ACA compliance; MarketPlace Billing & Payments, an application that synchronizes enrollment and billing information to streamline the monthly billing process, automate adjustments, and enhance accuracy of payments; and COBRA Administration, a solution that simplifies management of Consolidated Omnibus Budget Reconciliation Act, benefits. The company also provides BenefitSAIGE Analytics that aggregates benefit cost and claims data from relevant sources, identifies cost drivers, recognizes trends, and predicts future risks and costs; and BenefitsPlace, a transaction-oriented, marketplace solution which connects employers, brokers, insurance carriers, suppliers, and consumers on a single platform. In addition, it provides professional services, such as discovery, configuration and deployment, integration, testing, training, and technical support; and fulfillment, dependent verification, and HR administration services. The company was founded in 2000 and is headquartered in Charleston, South Carolina.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "100 Benefitfocus Way, Charleston, SC, United States, 29492", "FullTimeEmployees": "1560", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "333574624", "EBITDA": "-22147000", "PERatio": "None", "PEGRatio": "-5.06", "BookValue": "-0.584", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.671", "RevenuePerShareTTM": "8.823", "ProfitMargin": "-0.1371", "OperatingMarginTTM": "-0.0396", "ReturnOnAssetsTTM": "-0.0201", "ReturnOnEquityTTM": "-9.2528", "RevenueTTM": "287136000", "GrossProfitTTM": "151596000", "DilutedEPSTTM": "-1.224", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.093", "AnalystTargetPrice": "19", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.1244", "PriceToBookRatio": "0", "EVToRevenue": "1.7357", "EVToEBITDA": "63.9297", "Beta": "1.6451", "52WeekHigh": "26.78", "52WeekLow": "6.09", "50DayMovingAverage": "11.0572", "200DayMovingAverage": "11.1722", "SharesOutstanding": "32260600", "SharesFloat": "25881429", "SharesShort": "3039519", "SharesShortPriorMonth": "3186456", "ShortRatio": "6.74", "ShortPercentOutstanding": "0.08", "ShortPercentFloat": "0.1102", "PercentInsiders": "11.202", "PercentInstitutions": "81.417", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}