{"Symbol": "BOKF", "AssetType": "Common Stock", "Name": "BOK Financial Corporation", "Description": "BOK Financial Corporation operates as the financial holding company for BOKF, NA that provides various financial products and services in Oklahoma, Texas, New Mexico, Northwest Arkansas, Colorado, Arizona, and Kansas/Missouri. It operates through three segments: Commercial Banking, Consumer Banking, and Wealth Management. The Commercial Banking segment offers lending, treasury, and cash management services, as well as customer risk management products for small businesses, middle market, and larger commercial customers. This segment also operates TransFund electronic funds transfer network. The Consumer Banking segment provides lending and deposit services to small business customers through the retail branch network; and mortgage banking services. The Wealth Management segment offers fiduciary, private banking, and investment advisory services; insurance services; and brokerage and trading services, as well as underwrites state and municipal securities. The company also provides commercial loans, such as loans for working capital, facilities acquisition or expansion, purchases of equipment, and other needs of commercial customers; and service, healthcare, manufacturing, wholesale/retail, energy, and other sector loans. In addition, it offers commercial real estate loans for the construction of buildings or other enhancements to real estate and property held by borrowers for investment purposes; and residential mortgage, personal, and home equity loans. Further, the company provides automated teller machine (ATM), call center, and Internet and mobile banking services. As of December 31, 2019, it operated 2,463 TransFund ATM locations. BOK Financial Corporation was founded in 1910 and is headquartered in Tulsa, Oklahoma.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "Bank of Oklahoma Tower, Tulsa, OK, United States, 74172", "FullTimeEmployees": "5037", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4028574208", "EBITDA": "None", "PERatio": "10.6642", "PEGRatio": "2.09", "BookValue": "72.497", "DividendPerShare": "2.04", "DividendYield": "0.0357", "EPS": "5.37", "RevenuePerShareTTM": "22.882", "ProfitMargin": "0.2361", "OperatingMarginTTM": "0.3283", "ReturnOnAssetsTTM": "0.0086", "ReturnOnEquityTTM": "0.0772", "RevenueTTM": "1606764032", "GrossProfitTTM": "1763249000", "DilutedEPSTTM": "5.37", "QuarterlyEarningsGrowthYOY": "-0.523", "QuarterlyRevenueGrowthYOY": "-0.17", "AnalystTargetPrice": "60.83", "TrailingPE": "10.6642", "ForwardPE": "11.6686", "PriceToSalesRatioTTM": "2.2226", "PriceToBookRatio": "0.7885", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.6082", "52WeekHigh": "88.2765", "52WeekLow": "34.57", "50DayMovingAverage": "56.4217", "200DayMovingAverage": "54.9393", "SharesOutstanding": "70306704", "SharesFloat": "28276648", "SharesShort": "2100027", "SharesShortPriorMonth": "2103835", "ShortRatio": "7.72", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0612", "PercentInsiders": "55.634", "PercentInstitutions": "43.266", "ForwardAnnualDividendRate": "2.04", "ForwardAnnualDividendYield": "0.0357", "PayoutRatio": "0.2836", "DividendDate": "2020-08-26", "ExDividendDate": "2020-02-11", "LastSplitFactor": "103:100", "LastSplitDate": "2004-05-06"}