{"Symbol": "BRCD", "AssetType": "Common Stock", "Name": "Brocade Communications Systems, Inc", "Description": "Brocade Communications Systems, Inc. provides storage area networking (SAN) and Internet protocol (IP) networking solutions for businesses and organizations worldwide. It operates through three segments: SAN Products, IP Networking Products, and Global Services. The SAN Products segment offers infrastructure products and solutions, such as fiber channel SAN backbones, directors, and fabric/embedded switches that assist customers in the development and deployment of storage and server consolidation, disaster recovery, and data security, as well as to meet compliance requirements regarding data management; and FC fabric extension, analytics, switching, and routing solutions. The IP Networking Products segment provides Layer 2 and Layer 3 Ethernet switches and routers to connect users over private and public networks, including local area, metro, and within and across data centers. This segment also provides converged network products; a portfolio of related software and hardware-based data networking offerings; Layer 4-7 products that are designed for application traffic management and server load balancing; and a range of wireless products for the network edge. The Global Services segment offers break/fix maintenance, installation, consulting, network management and software maintenance, and customer support services. The company serves various enterprises and service providers, such as telecommunication firms, cable operators, and mobile carriers. The company markets and sells its products and services to end-user customers directly, as well as through various distribution partners, including original equipment manufacturers, distributors, systems integrators, and value-added resellers. Brocade Communications Systems, Inc. was founded in 1995 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "130 Holger Way\n95134,San Jose,USA\n", "FullTimeEmployees": "5960", "FiscalYearEnd": "October", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "3.86", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "0.07", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "12.79", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}