{"Symbol": "BRKS", "AssetType": "Common Stock", "Name": "Brooks Automation, Inc", "Description": "Brooks Automation, Inc. provides automation and cryogenic solutions worldwide. The company operates in two segments, Brooks Semiconductor Solutions Group and Brooks Life Science Systems. The Brooks Semiconductor Solutions Group segment offers wafer automation and contamination controls solutions and services. Its products include atmospheric and vacuum robots, robotic modules, and tool automation systems that offer precision handling and clean wafer environments; and automated cleaning and inspection systems for wafer carriers, reticle pod cleaners, and stockers. This segment also offers repair, diagnostic, and installation services, as well as spare parts and productivity enhancement upgrade services. The Brooks Life Science Systems segment provides automated cold storage systems; consumables, including various formats of racks, tubes, caps, plates, and foils; and instruments used for labeling, bar coding, capping, de-capping, auditing, sealing, peeling, and piercing tubes and plates. It also provides sample management services, such as on-site and off-site sample storage, cold chain logistics, sample transport and collection relocation, bio-processing solutions, disaster recovery, and business continuity, as well as project management and consulting. In addition, this segment offers sample intelligence software solutions and customer technology integration; laboratory work flow scheduling for life science tools and instrument work cells, sample inventory and logistics, environmental and temperature monitoring, and clinical trial and consent management, as well as planning, data management, virtualization, and visualization services; and gene sequencing analysis and synthesis services. The company serves the semiconductor capital equipment and life sciences sample management markets in approximately 50 countries. Brooks Automation, Inc. was founded in 1978 and is headquartered in Chelmsford, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductor Equipment & Materials", "Address": "15 Elizabeth Drive, Chelmsford, MA, United States, 01824", "FullTimeEmployees": "3000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3859133696", "EBITDA": "122148000", "PERatio": "91.3571", "PEGRatio": "2.24", "BookValue": "16.189", "DividendPerShare": "0.4", "DividendYield": "0.0078", "EPS": "6.1", "RevenuePerShareTTM": "11.621", "ProfitMargin": "0.5271", "OperatingMarginTTM": "0.0686", "ReturnOnAssetsTTM": "0.0243", "ReturnOnEquityTTM": "0.0431", "RevenueTTM": "850288000", "GrossProfitTTM": "316729000", "DilutedEPSTTM": "6.1", "QuarterlyEarningsGrowthYOY": "0.907", "QuarterlyRevenueGrowthYOY": "0.081", "AnalystTargetPrice": "56", "TrailingPE": "91.3571", "ForwardPE": "31.746", "PriceToSalesRatioTTM": "4.4209", "PriceToBookRatio": "3.212", "EVToRevenue": "4.2297", "EVToEBITDA": "31.7556", "Beta": "1.5571", "52WeekHigh": "57.56", "52WeekLow": "21.19", "50DayMovingAverage": "50.3819", "200DayMovingAverage": "40.2716", "SharesOutstanding": "73760200", "SharesFloat": "70857278", "SharesShort": "3838256", "SharesShortPriorMonth": "3243024", "ShortRatio": "7.03", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0552", "PercentInsiders": "2.077", "PercentInstitutions": "99.932", "ForwardAnnualDividendRate": "0.4", "ForwardAnnualDividendYield": "0.0078", "PayoutRatio": "0.7143", "DividendDate": "2020-09-25", "ExDividendDate": "2020-09-03", "LastSplitFactor": "None", "LastSplitDate": "None"}