{"Symbol": "BSF", "AssetType": "Common Stock", "Name": "Bear State Financial, Inc", "Description": "Bear State Financial, Inc. operates as the bank holding company for Bear State Bank, N.A that provides various financial products to individuals and business customers. The company offers a range of retail and business deposit accounts, including noninterest and interest bearing checking, savings and money market, and individual retirement accounts, as well as certificates of deposit. It also provides loans comprising one-to four-family residential real estate, multifamily residential real estate, nonfarm nonresidential, farmland, construction and land development, and secured and unsecured commercial loans; and consumer loans, such as automobile, deposit account secured, and unsecured loans, as well as lines of credit. In addition, the company offers other financial services, such as automated teller machine services; telephone banking services; online banking services, including account access, bill payment, and e-statement services; mobile banking comprising remote deposit capture and funds transfer services; overdraft services; debit cards; and safe deposit boxes. As of January 18, 2018, it operated 42 branches, 3 personalized technology centers equipped with interactive teller machines, and 3 loan production offices in Arkansas, Missouri, and Southeast Oklahoma. The company was formerly known as First Federal Bancshares of Arkansas, Inc. and changed its name to Bear State Financial, Inc. in June 2014. Bear State Financial, Inc. incorporated in 1996 and is headquartered in Little Rock, Arkansas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "900 South Shackleford Road, Suite 401\n72211,Little Rock,USA\n", "FullTimeEmployees": "380", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "390216736", "EBITDA": "None", "PERatio": "18.4286", "PEGRatio": "0", "BookValue": "6.703", "DividendPerShare": "0.12", "DividendYield": "0.0116", "EPS": "0.56", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "20.43", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}