{"Symbol": "BSFT", "AssetType": "Common Stock", "Name": "BroadSoft Inc", "Description": "BroadSoft, Inc. provides software and services that enable telecommunications service providers to deliver hosted cloud-based unified communications (UC) to their enterprise customers in North America, Europe, the Middle East, and Africa. Its products include UC-One, a cloud communication and collaboration solution that offers integrated business, such as phone services, messaging and presence, audio and video conferencing, screen sharing, file sharing, and virtual meeting rooms. The company also provides Team-One, a collaboration solution that allows users to chat, track notes, share files, and organize projects into shareable workspaces; and CC-One, a contact center solution that enables enterprises to have omni-channel interactions over Web, email, chat, and social media with customers, as well as provides integrated collaboration between call center agents and the back office through voice, chat, and video. It offers its enterprise and consumer communications services through BroadWorks application server software and BroadCloud software-as-a-service platform. In addition, the company provides a range of professional support services, such as pre-sales support; installation, network integration, project management, and remote upgrade services, as well as consulting services; product life-cycle services; and training services. It markets and sells its products directly, as well as through distribution partners comprising telecommunications equipment vendors, value-added resellers, and other distributors. BroadSoft, Inc. was founded in 1998 and is headquartered in Gaithersburg, Maryland. As of February 1, 2018, BroadSoft, Inc. operates as a subsidiary of Cisco Systems, Inc.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "1733", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "1744502400", "EBITDA": "23756000", "PERatio": "None", "PEGRatio": "-6.68", "BookValue": "11.269", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-0.27", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "46.88", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}