{"Symbol": "BSQR", "AssetType": "Common Stock", "Name": "BSQUARE Corporation", "Description": "BSQUARE Corporation provides software solutions and related engineering services to businesses that develop, market, and sell standalone intelligent systems in North America, Europe, and Asia. It operates through two segments, Partner Solutions and Edge to Cloud. The company offers B2IQ Imaging and Recovery Tool, a turnkey utility for managing the operating system image of a Windows-based device; and B2IQ Field Upgrade Tool, a streamlined utility for remote and cloud-based upgrades of Windows original equipment manufacturers (OEM) appliances and devices. It also provides B2IQ Edge and Cloud Suite, a collection of software components that securely connects edge devices and non-connected assets to the cloud; B2IQ Cloud Base that offers automatic registration of B2IQ Edge devices with the cloud; B2IQ Edge, a compact and edge client that supports bi-directional communication between devices, sensors, and cloud components; B2IQ Gateway, which supports bi-directional communication between constrained devices and the cloud; and B2IQ Edge Modules that includes B2IQ Modbus connector for industrial assets, the B2IQ Canbus connector for automotive assets, and the B2IQ SAE 1939 Canbus connector for diesel assets. In addition, the company offers various professional services, such as operating system (OS) upgrade and porting, embedded OS support, field upgrade consulting, OS lockdown, and Microsoft Azure Sphere engineering services, as well as Windows 10 Internet of Things (IoT) enterprise training services. Further, it develops, deploys, and operates IoT systems for various businesses. The company serves OEMs, original design manufacturers, corporate enterprises, silicon vendors, and peripheral vendors. BSQUARE Corporation was founded in 1994 and is headquartered in Bellevue, Washington.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "110 110th Avenue NE, Bellevue, WA, United States, 98004", "FullTimeEmployees": "75", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "19206446", "EBITDA": "-8615000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.641", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.119", "RevenuePerShareTTM": "4.287", "ProfitMargin": "-0.0721", "OperatingMarginTTM": "-0.0549", "ReturnOnAssetsTTM": "-0.0811", "ReturnOnEquityTTM": "-0.3961", "RevenueTTM": "55660000", "GrossProfitTTM": "10096000", "DilutedEPSTTM": "-0.31", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.371", "AnalystTargetPrice": "1.47", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.3242", "PriceToBookRatio": "2.1686", "EVToRevenue": "0.1672", "EVToEBITDA": "0", "Beta": "1.7154", "52WeekHigh": "1.76", "52WeekLow": "0.83", "50DayMovingAverage": "1.4394", "200DayMovingAverage": "1.3104", "SharesOutstanding": "13155100", "SharesFloat": "9900689", "SharesShort": "17910", "SharesShortPriorMonth": "20745", "ShortRatio": "0.35", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0009", "PercentInsiders": "10.482", "PercentInstitutions": "30.382", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:4", "LastSplitDate": "2005-10-07"}