{"Symbol": "BUSE", "AssetType": "Common Stock", "Name": "First Busey Corporation", "Description": "First Busey Corporation operates as the bank holding company for Busey Bank that provides retail and commercial banking products and services to individual, corporate, institutional, and governmental customers in the United States. The company operates in three segments: Banking, Remittance Processing, and Wealth Management. It offers customary types of demand and savings deposits; and commercial, agricultural, real estate construction, commercial and residential real estate, and consumer loans, as well as home equity lines of credit. The company also provides money transfer, safe deposit, IRA, and other fiduciary services through banking center, ATM and technology-based networks. In addition, it offers investment management, trust, estate advisory, and financial planning services, as well as business succession planning, and employee retirement planning services; investment strategy consulting and fiduciary services; and security brokerage services. Further, the company provides pay processing solutions, such as walk-in payment processing for payments delivered by customers to retail pay agents; online bill payment solutions for payments made by customers on a billing company's Website; customer service payments for payments accepted over the telephone; mobile bill pay; direct debit services; electronic concentration of payments delivered by the automated clearing house network; money management software and credit card networks; and lockbox remittance processing of payments delivered by mail. It has 61 banking centers in Illinois; 13 in Missouri; five in southwest Florida; and one in Indianapolis, Indiana. The company was founded in 1868 and is headquartered in Champaign, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "100 West University Avenue, Champaign, IL, United States, 61820", "FullTimeEmployees": "1480", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "983470464", "EBITDA": "None", "PERatio": "10.4826", "PEGRatio": "3.05", "BookValue": "22.674", "DividendPerShare": "0.88", "DividendYield": "0.0488", "EPS": "1.721", "RevenuePerShareTTM": "6.699", "ProfitMargin": "0.2571", "OperatingMarginTTM": "0.3881", "ReturnOnAssetsTTM": "0.0093", "ReturnOnEquityTTM": "0.0775", "RevenueTTM": "367828000", "GrossProfitTTM": "393232000", "DilutedEPSTTM": "1.721", "QuarterlyEarningsGrowthYOY": "0.093", "QuarterlyRevenueGrowthYOY": "-0.131", "AnalystTargetPrice": "21.33", "TrailingPE": "10.4826", "ForwardPE": "10.7296", "PriceToSalesRatioTTM": "2.4632", "PriceToBookRatio": "0.7952", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.0516", "52WeekHigh": "28", "52WeekLow": "13.1", "50DayMovingAverage": "17.7314", "200DayMovingAverage": "18.1714", "SharesOutstanding": "54516100", "SharesFloat": "49783023", "SharesShort": "783642", "SharesShortPriorMonth": "555819", "ShortRatio": "4.08", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0121", "PercentInsiders": "10.125", "PercentInstitutions": "48.715", "ForwardAnnualDividendRate": "0.88", "ForwardAnnualDividendYield": "0.0488", "PayoutRatio": "0.5", "DividendDate": "2020-07-31", "ExDividendDate": "2020-07-23", "LastSplitFactor": "1:3", "LastSplitDate": "2015-09-08"}