{"Symbol": "BVSN", "AssetType": "Common Stock", "Name": "BroadVision, Inc", "Description": "BroadVision, Inc. develops, markets, and supports enterprise portal applications that enable companies to unify their e-business infrastructure and conduct interactions and transactions with employees, partners, and customers through a personalized self-service model. It offers Business Agility Suite, a portal that provides personalized views of information and processes; Commerce Agility Suite, an e-commerce system for transacting business on the Web; Clearvale, an enterprise social network solution; Clear, a human resources management system; QuickSilver, a publishing system for large and complex documents; and Vmoso, a cloud application for conducting virtual enterprise communications, mobile workgroup collaborations, and social business engagements. The company also provides frameworks that offer portal services for organizing and presenting information; commerce services for transacting business on the Web; process services for transforming people-intensive processes and collaborations into Web-based self-service applications; content services for managing Web content throughout its lifecycle; staging services for moving content from development environment to production environment; search for full-text and field searching of online content and referenced external files with relevance ranking; unified stream services for unification and integration of information; notification/push services to deliver notifications through various messaging platforms; and migration services for data moving across platforms. In addition, it offers business consulting, implementation, integration and package, upgrade and migration, and performance tuning services; education, and support and maintenance services; and Vmoso and Kukini developer toolkits, and Kona framework, as well as Vmoso Enterprise Transformation, a proprietary implementation approach for the Vmoso collaborative solution. The company was founded in 1993 and is headquartered in Redwood City, California. On March 30, 2020, BroadVision, Inc. filed a voluntary p", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "460 Seaport Court, Redwood City, CA, United States, 94063", "FullTimeEmployees": "44", "FiscalYearEnd": "December", "LatestQuarter": "2019-09-30", "MarketCapitalization": "22729098", "EBITDA": "-5066000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.54", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.784", "RevenuePerShareTTM": "0.886", "ProfitMargin": "-0.1223", "OperatingMarginTTM": "-1.3045", "ReturnOnAssetsTTM": "-0.6317", "ReturnOnEquityTTM": "-2.0885", "RevenueTTM": "4440000", "GrossProfitTTM": "3093000", "DilutedEPSTTM": "-0.108", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.047", "AnalystTargetPrice": "0", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "4.9985", "PriceToBookRatio": "8.3037", "EVToRevenue": "4.6377", "EVToEBITDA": "0", "Beta": "0.079", "52WeekHigh": "4.44", "52WeekLow": "1.3", "50DayMovingAverage": "4.3881", "200DayMovingAverage": "3.2931", "SharesOutstanding": "5142330", "SharesFloat": "2066616", "SharesShort": "13727", "SharesShortPriorMonth": "10615", "ShortRatio": "0.23", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0058", "PercentInsiders": "67.078", "PercentInstitutions": "5.452", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:25", "LastSplitDate": "2008-10-27"}