{"Symbol": "CA", "AssetType": "Common Stock", "Name": "CA, Inc", "Description": "CA, Inc., doing business as CA technologies, develops, markets, delivers, and licenses software products and services in the United States and internationally. It operates through three segments: Mainframe Solutions, Enterprise Solutions, and Services. The Mainframe Solutions segment offers solutions for the IBM z Systems platform, which runs various mission critical business applications. Its mainframe solutions enable customers enhance economics by increasing throughput and lowering cost per transaction; increasing business agility through DevOps tooling and processes; increasing reliability and availability of operations through machine intelligence and automation solutions; and protecting enterprise data with security and compliance. The Enterprise Solutions segment provides a range of software planning, development, and management tools for mobile, cloud, and distributed computing environments. It primarily provides customers secure application development, infrastructure management, automation, and identity-centric security solutions. The Services segment offers various services, such as consulting, implementation, application management, education, and support services to commercial and government customers for implementation and adoption of its software solutions. The company serves banks, insurance companies, other financial services providers, government agencies, information technology service providers, telecommunication providers, transportation companies, manufacturers, technology companies, retailers, educational organizations, and health care institutions. It sells its products through direct sales force, as well as through various partner channels comprising resellers, service providers, system integrators, managed service providers, and technology partners. The company was formerly known as Computer Associates International, Inc. and changed its name to CA, Inc. in 2006. CA, Inc. was founded in 1974 and is headquartered in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "520 Madison Avenue, 22nd Floor\n10022,New York,USA\n", "FullTimeEmployees": "11300", "FiscalYearEnd": "March", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "22.85", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "33.14", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}