{"Symbol": "CALD", "AssetType": "Common Stock", "Name": "Callidus Software Inc", "Description": "Callidus Software Inc. provides cloud-based sales, marketing, learning, and customer experience solutions worldwide. The company enables its customers to sell Lead to Money suite of solutions that identify leads, train personnel, implement territory and quota plans, enable sales forces, automate configuration pricing and quoting, manage contracts, streamline sales compensation, capture customer feedback, and provide predictive analytics for competitive advantage. It offers Lead to Money suite and technology solutions, which include sales performance management solutions, such as Commissions, Territory and Quota, and SalesMotivate; Sales Execution solutions, including Configure Price Quote, Contract Lifecycle Management, Datahug, and Revsym; and Customer Engagement solutions comprising Marketing Automation, Voice of the Customer, and ServiceMotivate. The company also provides Sales Enablement and Learning solutions consisting of Enablement, Litmos Learning Management System, Litmos Heroes, and Coaching; Technology solutions, including Database Management System, Thunderbridge Advanced Analytics, Thunderbridge Augmented Intelligence, Workflow, and Connect Enterprise; and Vertical Solutions, such as Producer Pro, Telco Dealer Pro, Incentive Compensation Management, and DS Pro. In addition, it offers a range of services comprising professional, business process outsourcing, maintenance and technical support, and education services Callidus Software Inc. was founded in 1996 and is headquartered in Dublin, California. As of April 5, 2018, Callidus Software Inc. operates as a subsidiary of SAP America, Inc.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "4140 Dublin Boulevard, Suite 400\n94568,Dublin,USA\n", "FullTimeEmployees": "1300", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "2392574464", "EBITDA": "-5561000", "PERatio": "None", "PEGRatio": "3.85", "BookValue": "3.71", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-0.37", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "28.56", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}