{"Symbol": "CAR", "AssetType": "Common Stock", "Name": "Avis Budget Group, Inc", "Description": "Avis Budget Group, Inc., together with its subsidiaries, provides car and truck rentals, car sharing, and ancillary services to businesses and consumers. It operates the Avis brand, a vehicle rental system that supply rental cars to the premium commercial and leisure segments of the travel industry; the Budget Truck brand, a local and one-way truck rental businesses with a fleet of approximately 20,000 vehicles, which are rented through a network of approximately 575 dealer-operated and 420 company-operated locations that serve the consumer and light commercial sectors in the continental United States; and the Zipcar brand, a car sharing network. The company also operates various other car rental brands, such as Payless, Apex, Maggiore, Morini Rent, FranceCars, and Turiscar. In addition, it offers optional insurance products and coverages, such as supplemental liability, personal accident, personal effects protection, emergency sickness protection, and cargo insurance products; fuel service options, chauffeur drive services, roadside assistance services, electronic toll collection services, curbside delivery, tablet rentals, access to satellite radio, portable navigation units, and child safety seat rentals; automobile towing equipment and other moving accessories, such as hand trucks, furniture pads, and moving supplies; and Business Intelligence solution, an online portal for corporate travel. Avis Budget Group, Inc. operates in approximately 5,500 locations worldwide. The company was formerly known as Cendant Corporation and changed its name to Avis Budget Group, Inc. in September 2006. Avis Budget Group, Inc. was founded in 1946 and is headquartered in Parsippany, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Rental & Leasing Services", "Address": "6 Sylvan Way, Parsippany, NJ, United States, 07054", "FullTimeEmployees": "21200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2459991296", "EBITDA": "373000000", "PERatio": "9.9238", "PEGRatio": "1.76", "BookValue": "4.195", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.131", "RevenuePerShareTTM": "101.893", "ProfitMargin": "-0.0415", "OperatingMarginTTM": "0.0285", "ReturnOnAssetsTTM": "0.0057", "ReturnOnEquityTTM": "-2.7623", "RevenueTTM": "7427999744", "GrossProfitTTM": "2666000000", "DilutedEPSTTM": "-4.225", "QuarterlyEarningsGrowthYOY": "-0.067", "QuarterlyRevenueGrowthYOY": "-0.675", "AnalystTargetPrice": "39", "TrailingPE": "9.9238", "ForwardPE": "3.3887", "PriceToSalesRatioTTM": "0.3375", "PriceToBookRatio": "7.139", "EVToRevenue": "2.4641", "EVToEBITDA": "6.3289", "Beta": "2.3154", "52WeekHigh": "52.98", "52WeekLow": "6.35", "50DayMovingAverage": "29.9697", "200DayMovingAverage": "23.7041", "SharesOutstanding": "69668400", "SharesFloat": "95059695", "SharesShort": "16164610", "SharesShortPriorMonth": "18485237", "ShortRatio": "4.44", "ShortPercentOutstanding": "0.2", "ShortPercentFloat": "0.2699", "PercentInsiders": "1.789", "PercentInstitutions": "113.405", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "2006-02-23", "LastSplitFactor": "1:10", "LastSplitDate": "2006-09-05"}