{"Symbol": "CASI", "AssetType": "Common Stock", "Name": "CASI Pharmaceuticals, Inc", "Description": "CASI Pharmaceuticals, Inc., a biopharmaceutical company, develops and commercializes pharmaceutical products and various therapeutics in China, the United States, and internationally. The company's product pipeline includes EVOMELA, a melphalan hydrochloride for injection primarily for use as a high-dose conditioning treatment prior to hematopoietic progenitor cell transplantation in patients with multiple myeloma. Its product pipeline also comprise CNCT19, an autologous CD19 CAR-T investigative product for the treatment of patients with B-cell acute lymphoblastic leukemia (B-ALL) and B-cell non-Hodgkin lymphoma; CID-103, an anti-CD38 monoclonal antibody being for the treatment of patients with multiple myeloma; ZEVALIN, a CD20-directed radiotherapeutic antibody, to treat patients with NHL; and Thiotepa, a chemotherapeutic agent, which has multiple indications including use as a conditioning treatment for use prior to hematopoietic stem cell transplantation. In addition, the company offers MARQIBO, a microtubule inhibitor, approved by the FDA for the treatment of adult patients with Philadelphia chromosome-negative ALL; and Octreotide LAI formulations for the treatment of acromegaly and for the control of symptoms associated with various neuroendocrine tumours, as well as developing a portfolio of 25 FDA-approved abbreviated new drug applications. It has licensing agreements with Black Belt Therapeutics Limited, Juventas Cell Therapy Ltd., and Pharmathen Global BV. The company was formerly known as EntreMed, Inc. and changed its name to CASI Pharmaceuticals, Inc. in June 2014. CASI Pharmaceuticals, Inc. was founded in 1991 and is based in Rockville, Maryland.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "9620 Medical Center Drive, Rockville, MD, United States, 20850", "FullTimeEmployees": "125", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "215662560", "EBITDA": "-33686892", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.628", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.444", "RevenuePerShareTTM": "0.104", "ProfitMargin": "0", "OperatingMarginTTM": "-3.6484", "ReturnOnAssetsTTM": "-0.2231", "ReturnOnEquityTTM": "-0.3994", "RevenueTTM": "10208000", "GrossProfitTTM": "196000", "DilutedEPSTTM": "-0.403", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "3.2", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "16.4215", "PriceToBookRatio": "3.3462", "EVToRevenue": "16.2737", "EVToEBITDA": "0", "Beta": "0.9187", "52WeekHigh": "3.82", "52WeekLow": "1.15", "50DayMovingAverage": "1.96", "200DayMovingAverage": "2.0676", "SharesOutstanding": "123944000", "SharesFloat": "77806978", "SharesShort": "1721763", "SharesShortPriorMonth": "1575967", "ShortRatio": "1.82", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0165", "PercentInsiders": "46.525", "PercentInstitutions": "20.387", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:11", "LastSplitDate": "2010-07-01"}