{"Symbol": "CBFV", "AssetType": "Common Stock", "Name": "CB Financial Services, Inc", "Description": "CB Financial Services, Inc. operates as the bank holding company for Community Bank that provides various banking products and services for individuals and businesses southwestern Pennsylvania, West Virginia, and Ohio. The company's primary deposit products include demand deposits, NOW accounts, money market accounts, and savings accounts. Its loan products comprise residential real estate loans, such as one-to four-family mortgage loans, multifamily mortgage loans, home equity installment loans, and home equity lines of credit; commercial real estate loans that are secured primarily by improved properties, such as retail facilities, office buildings, and other non-residential buildings; construction loans to individuals to finance the construction of residential dwellings, as well as for the construction of commercial properties, including hotels, apartment buildings, housing developments, and owner-occupied properties used for businesses; commercial and industrial loans, and lines of credit; consumer loans consisting of indirect auto loans, secured and unsecured loans, and lines of credit; and other loans. In addition, the company provides sweep and insured money sweep, remote electronic deposit, online banking with bill pay, mobile banking, and automated clearing house services; and conducts insurance agency activities by offering property and casualty, commercial liability, surety, and other insurance products. As of December 31, 2019, it operated its main office and 23 branches in Greene, Allegheny, Washington, Fayette, and Westmoreland counties in southwestern Pennsylvania; Brooke, Marshall, Ohio, Upshur, and Wetzel counties in West Virginia; and Belmont County in Ohio. The company was founded in 1901 and is headquartered in Carmichaels, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "100 North Market Street, Carmichaels, PA, United States, 15320", "FullTimeEmployees": "266", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "101347816", "EBITDA": "None", "PERatio": "8.3677", "PEGRatio": "1.75", "BookValue": "28.254", "DividendPerShare": "0.96", "DividendYield": "0.0514", "EPS": "2.231", "RevenuePerShareTTM": "9.15", "ProfitMargin": "0.2438", "OperatingMarginTTM": "0.3218", "ReturnOnAssetsTTM": "0.0089", "ReturnOnEquityTTM": "0.0812", "RevenueTTM": "49634000", "GrossProfitTTM": "51847000", "DilutedEPSTTM": "2.231", "QuarterlyEarningsGrowthYOY": "-0.018", "QuarterlyRevenueGrowthYOY": "0.033", "AnalystTargetPrice": "23.5", "TrailingPE": "8.3677", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.0099", "PriceToBookRatio": "0.6604", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.7049", "52WeekHigh": "30.95", "52WeekLow": "16.25", "50DayMovingAverage": "18.4219", "200DayMovingAverage": "21.9287", "SharesOutstanding": "5393710", "SharesFloat": "4881471", "SharesShort": "43443", "SharesShortPriorMonth": "7484", "ShortRatio": "3.33", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0089", "PercentInsiders": "10.037", "PercentInstitutions": "27.323", "ForwardAnnualDividendRate": "0.96", "ForwardAnnualDividendYield": "0.0514", "PayoutRatio": "0.4305", "DividendDate": "2020-09-17", "ExDividendDate": "2020-09-03", "LastSplitFactor": "3:1", "LastSplitDate": "1999-05-11"}