{"Symbol": "CBMG", "AssetType": "Common Stock", "Name": "Cellular Biomedicine Group, Inc", "Description": "Cellular Biomedicine Group, Inc., a clinical stage biopharmaceutical company, develops immunotherapies for cancer and stem cell therapies for degenerative diseases in Greater China. The company develops treatments utilizing proprietary cell based technologies, including immune cell therapy for treating a range of cancer indications comprising technologies in chimeric antigen receptor modified T cells (CAR-T), T-cells with genetically modified, tumor antigen-specific T-cell receptors, and next generation neoantigen-reactive bio-markers based tumor infiltrating lymphocytes; and human adipose-derived mesenchymal progenitor cells for the treatment of joint diseases The company's CAR-T products include CD20 for use in anti-tumor activities; CD22, a surface maker highly expressed in B cell malignancies in hairy cell leukemia; and B-cell maturation antigen therapies for treating refractory multiple myeloma in patients. It also develops NKG2D CAR therapies for use in NK cell signaling; alpha fetoprotein TCR-T therapies for treating hepatocellular carcinoma; tumor infiltrating lymphocyte therapies for treating immunogenic cancers; and knee osteoarthritis therapies, including AlloJoin therapy, which is in a Phase II clinical trial, as well as Re-Join that has completed the Phase IIb clinical trial. In addition, it engages in biopharmaceutical businesses, including research and development, technical support, technical service, and technology transfer activities in biomedical technology field; manufacturing non-food, pharmaceutical polypeptides, and medical devices; and the wholesale of cosmetics, sanitary products, and biological agents. The company has a collaboration agreement with Novartis Pharma AG to manufacture and supply their CAR-T cell therapy Kymriah in China. Cellular Biomedicine Group, Inc. was incorporated in 2001 and is headquartered in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "1345 Avenue of Americas, New York, NY, United States, 10105", "FullTimeEmployees": "217", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "365146080", "EBITDA": "-36203524", "PERatio": "None", "PEGRatio": "0", "BookValue": "1.675", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-2.315", "RevenuePerShareTTM": "0.015", "ProfitMargin": "0", "OperatingMarginTTM": "-185.2651", "ReturnOnAssetsTTM": "-0.3447", "ReturnOnEquityTTM": "-0.9351", "RevenueTTM": "290655", "GrossProfitTTM": "277542", "DilutedEPSTTM": "-2.776", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "10.31", "AnalystTargetPrice": "19", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1223.1786", "PriceToBookRatio": "10.991", "EVToRevenue": "1250.4849", "EVToEBITDA": "0", "Beta": "1.544", "52WeekHigh": "19.5", "52WeekLow": "11.02", "50DayMovingAverage": "15.9336", "200DayMovingAverage": "15.1027", "SharesOutstanding": "19433000", "SharesFloat": "8952579", "SharesShort": "532675", "SharesShortPriorMonth": "328237", "ShortRatio": "2", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0263", "PercentInsiders": "35.514", "PercentInstitutions": "29.5", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:100", "LastSplitDate": "2013-01-31"}