{"Symbol": "CBPO", "AssetType": "Common Stock", "Name": "China Biologic Products Holdings, Inc", "Description": "China Biologic Products Holdings, Inc. engages in the research, development, manufacture, and sale of human plasma-based biopharmaceutical products to hospitals and inoculation centers in the People's Republic of China. It offers human albumin for treating shock caused by blood loss trauma or burn; raised intracranial pressure caused by hydrocephalus or trauma; oedema or ascites caused by hepatocirrhosis and nephropathy; and neonatal hyperbilirubinemia, as well as for the prevention and treatment of low-density-lipoproteinemia. The company also provides human immunoglobulin and IVIG for original and secondary immunoglobulin deficiency, and immunoglobulin G secondary deficiency; human hepatitis B immunoglobulin for the prevention of measles and contagious hepatitis; human rabies immunoglobulin primarily for passive immunity from bites or claws by rabies or other infected animals; and human tetanus immunoglobulin for the prevention and therapy of tetanus. In addition, it offers placenta polypeptide for the treatment of cell immunity deficiency diseases, viral infection, and leucopenia, as well as assists in postoperative healing; factor VIII for treating coagulopathies; human fibrinogen; and human prothrombin complex concentrate for treating congenital and acquired clotting factor II, VII, IX, X deficiency, as well as excessive anticoagulant, vitamin K deficiency, etc. Further, the company is developing Human fibrinogen for the treatment for lack of fibrinogen and increase human fibrinogen concentration; and artificial dura and spinal dura mater products for use in brain and spinal surgeries. The company sells its products directly, as well as through distributors. The company was formerly known as China Biologic Products, Inc. and changed its name to China Biologic Products Holdings, Inc. in July 2017. China Biologic Products Holdings, Inc. is headquartered in Beijing, the People's Republic of China.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "Jialong International Tower, Beijing, China, 100125", "FullTimeEmployees": "2246", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4082562304", "EBITDA": "209240800", "PERatio": "27.9446", "PEGRatio": "1.53", "BookValue": "46.125", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.79", "RevenuePerShareTTM": "13.312", "ProfitMargin": "0.2901", "OperatingMarginTTM": "0.3561", "ReturnOnAssetsTTM": "0.0567", "ReturnOnEquityTTM": "0.0938", "RevenueTTM": "511968416", "GrossProfitTTM": "329078378", "DilutedEPSTTM": "3.79", "QuarterlyEarningsGrowthYOY": "-0.142", "QuarterlyRevenueGrowthYOY": "-0.181", "AnalystTargetPrice": "101.78", "TrailingPE": "27.9446", "ForwardPE": "22.5734", "PriceToSalesRatioTTM": "8.0428", "PriceToBookRatio": "2.2962", "EVToRevenue": "5.9485", "EVToEBITDA": "13.2039", "Beta": "0.8165", "52WeekHigh": "118.3", "52WeekLow": "97.91", "50DayMovingAverage": "106.6894", "200DayMovingAverage": "108.5498", "SharesOutstanding": "38583900", "SharesFloat": "14282208", "SharesShort": "448267", "SharesShortPriorMonth": "454329", "ShortRatio": "5.67", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0225", "PercentInsiders": "54.17", "PercentInstitutions": "40.495", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}