{"Symbol": "CCMP", "AssetType": "Common Stock", "Name": "Cabot Microelectronics Corporation", "Description": "Cabot Microelectronics Corporation, together with its subsidiaries, provides consumable materials to semiconductor manufacturers, and pipeline and adjacent industry customers worldwide. The Electronic Materials segment provides CMP slurries, which are liquid solutions composed of high-purity deionized water, proprietary chemical additives, and engineered abrasives that chemically and mechanically interact with the surface material of the IC device at an atomic level; and CMP pads that are engineered polymeric materials designed to distribute and transport the slurry to the surface of the wafer and distribute it evenly across the wafer. The company's CMP slurries are used for polishing various materials that conduct electrical signals, including tungsten, copper, tantalum, and aluminum; and various materials that are used in the production of rigid disks and magnetic heads for hard disk drives, as well as used in the dielectric insulating materials that separate conductive layers within logic and memory IC devices. This segment also designs and produces precision polishing and metrology systems to attain near-perfect shape and surface finish on various optical components, such as mirrors, lenses, and prisms. In addition, this segment offers sulfuric, phosphoric, nitric, and hydrofluoric acids, as well as ammonium hydroxide, hydrogen peroxide, isopropyl alcohol, other specialty organic solvents, and various blends of chemicals. The Performance Materials segment provides polymer-based drag-reducing agents for light, medium, and heavy crude oil transmission; wood treatment products, such as solid blocks and concentrated solutions; and precision polishing and metrology systems for advanced optics applications. This segment also provides MR polishing fluids, consumables, and spare and replacement parts, as well as optical polishing services and other customer support services. Cabot Microelectronics Corporation was founded in 1999 and is headquartered in Aurora, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductor Equipment & Materials", "Address": "870 North Commons Drive, Aurora, IL, United States, 60504", "FullTimeEmployees": "2000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4516937216", "EBITDA": "378908992", "PERatio": "53.4146", "PEGRatio": "1.78", "BookValue": "35.305", "DividendPerShare": "1.76", "DividendYield": "0.0112", "EPS": "2.894", "RevenuePerShareTTM": "38.46", "ProfitMargin": "0.0765", "OperatingMarginTTM": "0.2269", "ReturnOnAssetsTTM": "0.0665", "ReturnOnEquityTTM": "0.0836", "RevenueTTM": "1120707968", "GrossProfitTTM": "467022000", "DilutedEPSTTM": "2.894", "QuarterlyEarningsGrowthYOY": "0.828", "QuarterlyRevenueGrowthYOY": "0.01", "AnalystTargetPrice": "164.25", "TrailingPE": "53.4146", "ForwardPE": "20.0401", "PriceToSalesRatioTTM": "4.0494", "PriceToBookRatio": "4.3454", "EVToRevenue": "4.6237", "EVToEBITDA": "18.8421", "Beta": "1.2802", "52WeekHigh": "174.87", "52WeekLow": "85.262", "50DayMovingAverage": "153.8147", "200DayMovingAverage": "136.0326", "SharesOutstanding": "29055300", "SharesFloat": "28741471", "SharesShort": "739212", "SharesShortPriorMonth": "657024", "ShortRatio": "3.85", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0304", "PercentInsiders": "1.046", "PercentInstitutions": "104.993", "ForwardAnnualDividendRate": "1.76", "ForwardAnnualDividendYield": "0.0112", "PayoutRatio": "0.5993", "DividendDate": "2020-07-31", "ExDividendDate": "2020-06-23", "LastSplitFactor": "None", "LastSplitDate": "None"}