{"Symbol": "CDNA", "AssetType": "Common Stock", "Name": "CareDx, Inc", "Description": "CareDx, Inc., a precision medicine company, discovers, develops, and commercializes healthcare solutions for transplant patients and caregivers worldwide. It offers AlloSure Kidney, a donor-derived cell-free DNA (dd-cfDNA) solution for kidney transplant patients; and AlloMap Heart, a gene expression solution for heart transplant patients. The company also develops, manufactures, markets, and sells products that increase the chance of successful transplants by facilitating a match between a donor and a recipient of stem cells and solid organs. In addition, it offers Olerup SSP, which is used to type human leukocyte antigen (HLA) alleles based on sequence specific primer technology; Olerup SBT, a product range for sequence-based typing of HLA alleles; QTYPE that enables precision in HLA typing at a low to intermediate resolution for samples that uses real-time polymerase chain reaction methodology; and TruSight HLA, a solution for use in transplantation diagnostic testing. Further, the company provides AlloSeq Tx, a high-resolution HLA typing solution; AlloSeq cfDNA, a surveillance solution to measure dd-cfDNA in blood; AlloSeq HCT, a solution for chimerism testing for stem cell transplant recipients; Ottr, a transplant patient tracking software; and XynQAPI and Waitlist Management solutions. It offers its products directly to customers, as well as through third-party distributors. The company has a license agreement with Illumina, Inc. for the development, commercialization, and distribution of next generation sequencing product line for use in transplantation diagnostic testing; and Cibiltech SAS to commercialize KidneyCare iBox, a software for the predictive analysis of post-transplantation kidney allograft loss. The company was formerly known as XDx, Inc. and changed its name to CareDx, Inc. in March 2014. CareDx, Inc. was incorporated in 1998 and is headquartered in South San Francisco, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "1 Tower Place, South San Francisco, CA, United States, 94080", "FullTimeEmployees": "306", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1665262208", "EBITDA": "-12204000", "PERatio": "None", "PEGRatio": "-0.12", "BookValue": "5.337", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.971", "RevenuePerShareTTM": "3.476", "ProfitMargin": "-0.1266", "OperatingMarginTTM": "-0.1925", "ReturnOnAssetsTTM": "-0.0739", "ReturnOnEquityTTM": "-0.1072", "RevenueTTM": "149812992", "GrossProfitTTM": "81613000", "DilutedEPSTTM": "-0.44", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.329", "AnalystTargetPrice": "44.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "9.8098", "PriceToBookRatio": "6.4029", "EVToRevenue": "9.8591", "EVToEBITDA": "0", "Beta": "0.9841", "52WeekHigh": "36.42", "52WeekLow": "13.04", "50DayMovingAverage": "33.6892", "200DayMovingAverage": "28.5079", "SharesOutstanding": "48963900", "SharesFloat": "48051654", "SharesShort": "5177488", "SharesShortPriorMonth": "5726804", "ShortRatio": "9.4", "ShortPercentOutstanding": "0.11", "ShortPercentFloat": "0.1199", "PercentInsiders": "2.495", "PercentInstitutions": "97.01", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}