{"Symbol": "CELG", "AssetType": "Common Stock", "Name": "Celgene Corporation", "Description": "Celgene Corporation, a biopharmaceutical company, discovers, develops, and commercializes therapies for the treatment of cancer and inflammatory diseases worldwide. It offers REVLIMID, an oral immunomodulatory drug for multiple myeloma (MM), myelodysplastic syndromes (MDS), and mantle cell lymphoma; POMALYST/IMNOVID to treat multiple myeloma; OTEZLA, a small-molecule inhibitor of phosphodiesterase 4 for psoriatic arthritis and psoriasis; and ABRAXANE to treat breast, non-small cell lung, pancreatic, and gastric cancers. The company's products also include IDHIFA for the treatment of adult patients with relapsed or refractory acute myeloid leukemia (rrAML) with an isocitrate dehydrogenase-2 mutation; VIDAZA, a pyrimidine nucleoside analog for intermediate-2 and high-risk MDS, chronic myelomonocytic leukemia, and AML; THALOMID to treat patients with MM; and ISTODAX, an epigenetic modifier. Its preclinical and clinical-stage product candidates include small molecules, biologics, and cell therapies for immune-inflammatory diseases, myeloid diseases, epigenetics, protein homeostasis, and immuno-oncology. The company has agreements with BeiGene, Ltd; Acceleron Pharma, Inc.; Agios Pharmaceuticals, Inc.; bluebird bio, Inc.; Lycera Corp.; Juno Therapeutics, Inc.; EXSCIENTIA LTD.; and IMIDomics SL, as well as immuno-oncology collaboration with Sutro Biopharma. The company also has strategic collaboration with Skyhawk Therapeutics, Inc. to discover and develop novel small molecules that modulate RNA splicing. Celgene Corporation was founded in 1980 and is headquartered in Summit, New Jersey. As of November 20, 2019, Celgene Corporation operates as a subsidiary of Bristol-Myers Squibb Company.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "86 Morris Avenue, Summit, NJ, United States, 07901", "FullTimeEmployees": "8852", "FiscalYearEnd": "December", "LatestQuarter": "2019-09-30", "MarketCapitalization": "77035921408", "EBITDA": "8935000064", "PERatio": "13.33", "PEGRatio": "0.86", "BookValue": "16.99", "DividendPerShare": "None", "DividendYield": "0", "EPS": "8.133", "RevenuePerShareTTM": "24.107", "ProfitMargin": "0.3463", "OperatingMarginTTM": "0.4875", "ReturnOnAssetsTTM": "0.1369", "ReturnOnEquityTTM": "0.6939", "RevenueTTM": "16981999616", "GrossProfitTTM": "14062000000", "DilutedEPSTTM": "8.133", "QuarterlyEarningsGrowthYOY": "0.547", "QuarterlyRevenueGrowthYOY": "0.161", "AnalystTargetPrice": "103.4", "TrailingPE": "13.33", "ForwardPE": "8.8028", "PriceToSalesRatioTTM": "4.6059", "PriceToBookRatio": "6.3735", "EVToRevenue": "5.0598", "EVToEBITDA": "10.6226", "Beta": "1.4131", "52WeekHigh": "110.7", "52WeekLow": "96.16", "50DayMovingAverage": "108.24", "200DayMovingAverage": "104.3553", "SharesOutstanding": "711713984", "SharesFloat": "709394291", "SharesShort": "11966568", "SharesShortPriorMonth": "12564140", "ShortRatio": "3.45", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0185", "PercentInsiders": "0", "PercentInstitutions": "78", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2014-06-26"}