{"Symbol": "CEMI", "AssetType": "Common Stock", "Name": "Chembio Diagnostics, Inc", "Description": "Chembio Diagnostics, Inc., together with its subsidiaries, develops, manufactures, and commercializes point-of-care (POC) diagnostic tests that are used to detect or diagnose diseases. The company offers tests for HIV and Syphilis, and Zika virus. It also develops tests for malaria, Dengue virus, chikungunya virus, ebola, lassa, marburg, leptospirosis, Rickettsia typhi, Burkholderia pseudomallei, and Orientia tsutsugamushi. In addition, the company develops tests for a specific form of cancer, concussion, and bovine tuberculosis; and handheld optical analyzers for rapid diagnostic tests. It sells its products under the STAT-PAK, SURE CHECK, STAT VIEW, or DPP trademarks, as well as under the private labels of its marketing partners to medical laboratories and hospitals, governmental and public health entities, non-governmental organizations, medical professionals, and retail establishments in the United States and internationally. The company has collaboration agreements with Concussion Science Group Division of Perseus Science Group LLC to develop a POC diagnostic test for traumatic brain injury; Foundation for Innovative New Diagnostics to develop a POC fever panel assay for life-threatening acute febrile illnesses; AstraZeneca to develop a POC test for eosinophilic respiratory disease; and Shire Human Genetic Therapies, Inc. to develop a novel POC diagnostic test. It also has a strategic partnership with LumiraDx Limited to develop point-of-care diagnostic tests for the detection of the COVID-19 virus, and IgM and IgG antibodies on the LumiraDx and Chembio DPP platforms. Chembio Diagnostics, Inc. was founded in 1985 and is headquartered in Hauppauge, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "555 Wireless Boulevard, Hauppauge, NY, United States, 11788", "FullTimeEmployees": "324", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "82662152", "EBITDA": "-10184776", "PERatio": "None", "PEGRatio": "-0.48", "BookValue": "1.921", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.73", "RevenuePerShareTTM": "1.599", "ProfitMargin": "-0.7326", "OperatingMarginTTM": "-0.6112", "ReturnOnAssetsTTM": "-0.1783", "ReturnOnEquityTTM": "-0.6154", "RevenueTTM": "28004386", "GrossProfitTTM": "3531299", "DilutedEPSTTM": "-1.171", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.483", "AnalystTargetPrice": "5", "TrailingPE": "0", "ForwardPE": "6.7159", "PriceToSalesRatioTTM": "2.3613", "PriceToBookRatio": "1.9648", "EVToRevenue": "2.3307", "EVToEBITDA": "0", "Beta": "2.5159", "52WeekHigh": "15.89", "52WeekLow": "2.25", "50DayMovingAverage": "5.1458", "200DayMovingAverage": "6.7386", "SharesOutstanding": "20161500", "SharesFloat": "17510299", "SharesShort": "3072771", "SharesShortPriorMonth": "2068862", "ShortRatio": "0.75", "ShortPercentOutstanding": "0.26", "ShortPercentFloat": "0.2677", "PercentInsiders": "19.103", "PercentInstitutions": "42.041", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:8", "LastSplitDate": "2012-05-30"}