{"Symbol": "CENTA", "AssetType": "Common Stock", "Name": "Central Garden & Pet Company", "Description": "Central Garden & Pet Company, together with its subsidiaries, produces and distributes products for the lawn and garden, and pet supplies markets in the United States. It operates through two segments, Pet and Garden. The Pet segment supplies products for dogs and cats, including edible bones, edible and non-edible chews, rawhides, dog and cat food and treats, toys, pet carriers, grooming supplies, and other accessories; and products for birds, small animals, and specialty pets, such as cages and habitats, toys, chews, and related accessories. It also provides animal and household health and insect control products; live fishes; and products for fish, reptiles, and other aquarium-based pets comprising aquariums, furniture and lighting fixtures, pumps, filters, water conditioners, food and supplements, and information and knowledge resources; and products for horses and livestock. This segment sells its products to independent pet distributors, retail chains, grocery stores, mass merchants, and bookstores under the Adams, Aqueon, Avoderm, C&S Products, Cadet, Farnam, Four Paws, Kaytee, K&H Pet Products, Nylabone, Pinnacle, TFH, Zilla, Altosid, Comfort Zone, Coralife, Interpet, Pet Select, and Zodiac brands. The Garden segment provides grass seed; wild bird feed, bird feeders, bird houses, and other birding accessories; weed, grass, and other herbicides, as well as insecticide and pesticide products; fertilizers; and decorative outdoor lifestyle products that include pottery as well as live plants and outdoor cushions and pillows. This segment sells its products to retail chains, independent garden distributors, grocery stores, nurseries, and garden supply retailers under the AMDRO, Arden Companies, Ironite, Pennington, Sevin, Lilly Miller, Over-N-Out, Smart Seed, and The Rebels brands. The company also engages in the distribution of third party products. Central Garden & Pet Company was founded in 1955 and is based in Walnut Creek, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Packaged Foods", "Address": "1340 Treat Boulevard, Walnut Creek, CA, United States, 94597", "FullTimeEmployees": "6000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2117237248", "EBITDA": "236788000", "PERatio": "19.075", "PEGRatio": "2.54", "BookValue": "19.369", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.978", "RevenuePerShareTTM": "46.806", "ProfitMargin": "0.0428", "OperatingMarginTTM": "0.0717", "ReturnOnAssetsTTM": "0.053", "ReturnOnEquityTTM": "0.1049", "RevenueTTM": "2560283904", "GrossProfitTTM": "704041000", "DilutedEPSTTM": "1.978", "QuarterlyEarningsGrowthYOY": "0.588", "QuarterlyRevenueGrowthYOY": "0.18", "AnalystTargetPrice": "41.33", "TrailingPE": "19.075", "ForwardPE": "22.4215", "PriceToSalesRatioTTM": "0.8254", "PriceToBookRatio": "1.9697", "EVToRevenue": "0.9512", "EVToEBITDA": "10.2025", "Beta": "0.3709", "52WeekHigh": "41.1", "52WeekLow": "22.13", "50DayMovingAverage": "36.3358", "200DayMovingAverage": "31.4573", "SharesOutstanding": "41748800", "SharesFloat": "48627155", "SharesShort": "736625", "SharesShortPriorMonth": "804837", "ShortRatio": "2.47", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0217", "PercentInsiders": "6.478", "PercentInstitutions": "93.254", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}