{"Symbol": "CEVA", "AssetType": "Common Stock", "Name": "CEVA, Inc", "Description": "CEVA, Inc. operates as a licensor of wireless connectivity and smart sensing platforms to semiconductor and original equipment manufacturer (OEM) companies worldwide. It designs and licenses various digital signal processors, AI processors, wireless platforms, and complementary software for sensor fusion, image enhancement, computer vision, voice input, and artificial intelligence (AI). The company licenses a family of signal processing intellectual properties (IPs), including DSP-based platforms for 5G baseband processing in mobile and infrastructure; imaging and computer vision for any camera-enabled device; audio/voice/speech and ultra-low power always-on/sensing applications for multiple IoT markets; sensor fusion software and IMU solutions for AR/VR, robotics, remote controls, and IoT; AI processors capable of handling the gamut of neural network workload and on-device; IPs for Bluetooth, Wi-Fi 4/5/6, and NB-IoT. Its technologies are licensed to companies, which design, manufacture, market, and sell application-specific integrated circuits and application-specific standard products to wireless, consumer electronics, and automotive companies for incorporation into various end products. The company delivers its DSP cores, platforms, and AI processors in the form of a hardware description language definition; and offers development platforms, software development kits, and software debug tools that facilitate system design, debug, and software development. CEVA, Inc. licenses its technology through a direct sales force. The company was formerly known as ParthusCeva, Inc. and changed its name to CEVA, Inc. in December 2003. CEVA, Inc. was founded in 1999 and is headquartered in Mountain View, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductors", "Address": "1174 Castro Street, Mountain View, CA, United States, 94040", "FullTimeEmployees": "382", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "953936320", "EBITDA": "6654000", "PERatio": "582.2831", "PEGRatio": "3.5767", "BookValue": "11.453", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.07", "RevenuePerShareTTM": "4.506", "ProfitMargin": "0.0158", "OperatingMarginTTM": "0.0049", "ReturnOnAssetsTTM": "0.001", "ReturnOnEquityTTM": "0.0063", "RevenueTTM": "99004000", "GrossProfitTTM": "77046000", "DilutedEPSTTM": "0.07", "QuarterlyEarningsGrowthYOY": "-0.727", "QuarterlyRevenueGrowthYOY": "0.283", "AnalystTargetPrice": "47", "TrailingPE": "582.2831", "ForwardPE": "71.4286", "PriceToSalesRatioTTM": "9.3715", "PriceToBookRatio": "3.6428", "EVToRevenue": "7.8082", "EVToEBITDA": "124.8447", "Beta": "1.3791", "52WeekHigh": "46.5", "52WeekLow": "20.45", "50DayMovingAverage": "40.7517", "200DayMovingAverage": "33.2716", "SharesOutstanding": "22158800", "SharesFloat": "21613708", "SharesShort": "552633", "SharesShortPriorMonth": "343290", "ShortRatio": "4.88", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0425", "PercentInsiders": "1.247", "PercentInstitutions": "83.191", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}