{"Symbol": "CFFI", "AssetType": "Common Stock", "Name": "C&F Financial Corporation", "Description": "C&F Financial Corporation operates as the bank holding company for Citizens and Farmers Bank that provides banking services to individuals and businesses. The company's Retail Banking segment offers various banking services, including checking and savings deposit accounts, as well as business, real estate, development, mortgage, home equity, and installment loans. It also provides debit and credit cards; and safe deposit box rentals, notary public, electronic transfer, ATMs, internet and mobile banking, and other customary bank services. This segment provides its services through its main office in West Point, Virginia, as well as through 29 Virginia branches located one each in Cartersville, Charlottesville, Chester, Cumberland, Fredericksburg, Hampton, Mechanicsville, Montross, Newport News, Norge, Powhatan, Providence Forge, Quinton, Saluda, Sandston, Warsaw, West Point, and Yorktown; two each in King George and Williamsburg; three in Midlothian; and four in Richmond. The company's Mortgage Banking segment provides various residential mortgage loans; originates conventional mortgage loans, mortgage loans insured by the Federal Housing Administration, and mortgage loans guaranteed by the United States Department of Agriculture and the Veterans Administration; and ancillary mortgage loan origination services for residential appraisals, as well as various mortgage origination functions to third parties. It provides mortgage loan origination services through 12 offices in Virginia, two offices in Maryland, and two offices in North Carolina, as well as through one each in South Carolina and West Virginia. The company's Consumer Finance segment provides automobile loans through its offices in Richmond and Hampton, Virginia. Its Other segment offers brokerage and wealth management services. The company also provides title and settlement agency, and insurance services. C&F Financial Corporation was founded in 1927 and is headquartered in West Point, Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "802 Main Street, West Point, VA, United States, 23181", "FullTimeEmployees": "643", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "120294016", "EBITDA": "None", "PERatio": "6.828", "PEGRatio": "0", "BookValue": "50.097", "DividendPerShare": "1.52", "DividendYield": "0.0473", "EPS": "4.685", "RevenuePerShareTTM": "29.987", "ProfitMargin": "0.1562", "OperatingMarginTTM": "0.2188", "ReturnOnAssetsTTM": "0.0094", "ReturnOnEquityTTM": "0.097", "RevenueTTM": "106060000", "GrossProfitTTM": "103951000", "DilutedEPSTTM": "4.685", "QuarterlyEarningsGrowthYOY": "-0.391", "QuarterlyRevenueGrowthYOY": "0.054", "AnalystTargetPrice": "34", "TrailingPE": "6.828", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.9828", "PriceToBookRatio": "0.6422", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.417", "52WeekHigh": "57.61", "52WeekLow": "28", "50DayMovingAverage": "31.3133", "200DayMovingAverage": "35.4366", "SharesOutstanding": "3648590", "SharesFloat": "3436640", "SharesShort": "26182", "SharesShortPriorMonth": "16057", "ShortRatio": "5.71", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0083", "PercentInsiders": "5.863", "PercentInstitutions": "34.628", "ForwardAnnualDividendRate": "1.52", "ForwardAnnualDividendYield": "0.0473", "PayoutRatio": "0.3206", "DividendDate": "2020-10-01", "ExDividendDate": "2020-09-14", "LastSplitFactor": "2:1", "LastSplitDate": "1998-07-21"}