{"Symbol": "CG", "AssetType": "Common Stock", "Name": "The Carlyle Group Inc", "Description": "The Carlyle Group Inc. is an investment firm specializing in direct and fund of fund investments. Within direct investments, it specializes in management-led/ Leveraged buyouts, privatizations, divestitures, strategic minority equity investments, structured credit, global distressed and corporate opportunities, small and middle market, equity private placements, consolidations and buildups, senior debt, mezzanine and leveraged finance, and venture and growth capital financings, seed/startup, early venture, emerging growth, turnaround, mid venture, late venture, PIPES. The firm invests across four segments which include Corporate Private Equity, Real Assets, Global Market Strategies, and Solutions. The firm typically invests in industrial, agribusiness, ecological sector, fintech, airports, parking, Plastics, Rubber, diversified natural resources, minerals, farming, aerospace, defense, automotive, consumer, retail, industrial, infrastructure, energy, power, healthcare, software, software enabled services, semiconductors, communications infrastructure, financial technology, utilities, gaming, systems and related supply chain, electronic systems, systems, oil and gas, processing facilities, power generation assets, technology, systems, real estate, financial services, transportation, business services, telecommunications, media, and logistics sectors. Within the industrial sector, the firm invests in manufacturing, building products, packaging, chemicals, metals and mining, forestry and paper products, and industrial consumables and services. In consumer and retail sectors, it invests in food and beverage, retail, restaurants, consumer products, domestic consumption, consumer services, personal care products, direct marketing, and education. Within aerospace, defense, business services, and government services sectors, it seeks to invest in defense electronics, manufacturing and services, government contracting and services, information technology, distribution companies. In telecommunication and media sectors, it i", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Asset Management", "Address": "1001 Pennsylvania Avenue, NW, Washington, DC, United States, 20004-2505", "FullTimeEmployees": "1800", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "9090452480", "EBITDA": "48600000", "PERatio": "8.0887", "PEGRatio": "0.14", "BookValue": "5.616", "DividendPerShare": "1", "DividendYield": "0.0376", "EPS": "2.835", "RevenuePerShareTTM": "6.947", "ProfitMargin": "-0.2368", "OperatingMarginTTM": "-0.0088", "ReturnOnAssetsTTM": "-0.0007", "ReturnOnEquityTTM": "-0.1017", "RevenueTTM": "1614200064", "GrossProfitTTM": "1966900000", "DilutedEPSTTM": "-1.749", "QuarterlyEarningsGrowthYOY": "-0.667", "QuarterlyRevenueGrowthYOY": "0.066", "AnalystTargetPrice": "30.93", "TrailingPE": "8.0887", "ForwardPE": "15.361", "PriceToSalesRatioTTM": "6.0519", "PriceToBookRatio": "4.7969", "EVToRevenue": "8.1808", "EVToEBITDA": "8.596", "Beta": "1.6626", "52WeekHigh": "34.98", "52WeekLow": "15.21", "50DayMovingAverage": "27.9217", "200DayMovingAverage": "26.4178", "SharesOutstanding": "348694016", "SharesFloat": "183709373", "SharesShort": "14041414", "SharesShortPriorMonth": "10182320", "ShortRatio": "9.45", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0508", "PercentInsiders": "0", "PercentInstitutions": "17.653", "ForwardAnnualDividendRate": "1", "ForwardAnnualDividendYield": "0.0376", "PayoutRatio": "0.4823", "DividendDate": "2020-08-18", "ExDividendDate": "2020-08-10", "LastSplitFactor": "None", "LastSplitDate": "None"}