{"Symbol": "CHCO", "AssetType": "Common Stock", "Name": "City Holding Company", "Description": "City Holding Company operates as a holding company for City National Bank of West Virginia that provides various banking, trust and investment management, and other financial solutions in the United States. The company accepts various deposit products, such as checking, savings, and money market accounts, as well as certificates of deposit and individual retirement accounts. It also provides commercial and industrial loans that consist of loans to corporate and other legal entity borrowers primarily in small to mid-size industrial and commercial companies; commercial real estate loans comprising commercial mortgages, which are secured by nonresidential and multi-family residential properties; residential real estate loans to consumers for the purchase or refinance of residence; first-priority home equity loans; consumer loans that are secured and unsecured by automobiles, boats, recreational vehicles, certificates of deposit, and other personal property; and demand deposit account overdrafts. In addition, the company offers mortgage banking services, including fixed and adjustable-rate mortgages, construction financing, land loans, production of conventional and government insured mortgages, secondary marketing, and mortgage servicing. Further, it provides deposit services for commercial customers comprising treasury management, lockbox, and other cash management services; merchant credit card services; wealth management, trust, investment, and custodial services for commercial and individual customers; and corporate trust and institutional custody, financial and estate planning, and retirement plan services, as well as automated-teller-machine, interactive-teller-machine, mobile banking, and debit card services. The company operates through a network of 95 branches in West Virginia, Virginia, Kentucky, and Ohio. City Holding Company was founded in 1957 and is headquartered in Charleston, West Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "25 Gatewater Road, Charleston, WV, United States, 25313", "FullTimeEmployees": "913", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1028657920", "EBITDA": "None", "PERatio": "11.3564", "PEGRatio": "1.88", "BookValue": "43.152", "DividendPerShare": "2.28", "DividendYield": "0.0353", "EPS": "5.64", "RevenuePerShareTTM": "14.348", "ProfitMargin": "0.3973", "OperatingMarginTTM": "0.5057", "ReturnOnAssetsTTM": "0.0176", "ReturnOnEquityTTM": "0.1386", "RevenueTTM": "232164000", "GrossProfitTTM": "231101000", "DilutedEPSTTM": "5.64", "QuarterlyEarningsGrowthYOY": "-0.187", "QuarterlyRevenueGrowthYOY": "-0.133", "AnalystTargetPrice": "64.2", "TrailingPE": "11.3564", "ForwardPE": "14.8588", "PriceToSalesRatioTTM": "4.4001", "PriceToBookRatio": "1.48", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.5643", "52WeekHigh": "83.07", "52WeekLow": "53.06", "50DayMovingAverage": "64.2561", "200DayMovingAverage": "64.9687", "SharesOutstanding": "16030200", "SharesFloat": "15648181", "SharesShort": "630144", "SharesShortPriorMonth": "621688", "ShortRatio": "8.95", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0492", "PercentInsiders": "5.099", "PercentInstitutions": "67.795", "ForwardAnnualDividendRate": "2.28", "ForwardAnnualDividendYield": "0.0353", "PayoutRatio": "0.3972", "DividendDate": "2020-07-31", "ExDividendDate": "2020-07-14", "LastSplitFactor": "11:10", "LastSplitDate": "1996-10-30"}