{"Symbol": "CHKP", "AssetType": "Common Stock", "Name": "Check Point Software Technologies Ltd", "Description": "Check Point Software Technologies Ltd. develops, markets, and supports a range of products and services for IT security worldwide. The company offers a portfolio of network security, endpoint security, data security, and management solutions. It provides Check Point Infinity Architecture, a cyber security architecture that protects against 5th and 6th generation cyber-attacks across various networks, endpoint, cloud, workloads, Internet of Things, and mobile; Check Point Network Security, security gateways and software platforms that support small business and large enterprise data center and telco-grade environment; and Check Point SandBlast family for threat prevention and zero-day protections. The company also offers Check Point CloudGuard cloud security product that delivers threat prevention security, cloud visibility, cloud security posture management, and workload protection solutions for enterprise cloud networks, data, and applications; Check Point SandBlast Mobile for mobile security in iOS and Android devices; and Check Point Security Management, which offers security management through a single console that streamlines security operations and provides visibility into policy administration and threat analysis. In addition, the company provides technical customer support programs and plans; professional services in implementing, upgrading, and optimizing Check Point products comprising design planning and security implementation; and certification and educational training services on Check Point products. It sells its products and services to enterprises, service providers, small and medium sized businesses, and consumers through a network of channel partners, such as distributors, resellers, system integrators, original equipment manufacturers, and managed security service providers. Check Point Software Technologies Ltd. was founded in 1993 and is headquartered in Tel Aviv, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "5 Shlomo Kaplan Street, Tel Aviv, Israel, 6789159", "FullTimeEmployees": "5258", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17789978624", "EBITDA": "904899968", "PERatio": "22.5894", "PEGRatio": "3.7259", "BookValue": "24.076", "DividendPerShare": "None", "DividendYield": "0", "EPS": "5.671", "RevenuePerShareTTM": "13.955", "ProfitMargin": "0.4121", "OperatingMarginTTM": "0.4365", "ReturnOnAssetsTTM": "0.0976", "ReturnOnEquityTTM": "0.2363", "RevenueTTM": "2026899968", "GrossProfitTTM": "1785000000", "DilutedEPSTTM": "5.671", "QuarterlyEarningsGrowthYOY": "0.14", "QuarterlyRevenueGrowthYOY": "0.036", "AnalystTargetPrice": "126.78", "TrailingPE": "22.5894", "ForwardPE": "19.4932", "PriceToSalesRatioTTM": "9.2658", "PriceToBookRatio": "5.2525", "EVToRevenue": "8.0429", "EVToEBITDA": "16.4038", "Beta": "0.6747", "52WeekHigh": "130.27", "52WeekLow": "82.41", "50DayMovingAverage": "124.1389", "200DayMovingAverage": "109.8535", "SharesOutstanding": "140200000", "SharesFloat": "110920435", "SharesShort": "11197805", "SharesShortPriorMonth": "10634390", "ShortRatio": "8.94", "ShortPercentOutstanding": "0.08", "ShortPercentFloat": "0.1058", "PercentInsiders": "21.986", "PercentInstitutions": "81.676", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:2", "LastSplitDate": "2001-02-13"}