{"Symbol": "CLFD", "AssetType": "Common Stock", "Name": "Clearfield, Inc", "Description": "Clearfield, Inc. manufactures, markets, and sells standard and custom passive connectivity products to the fiber-to-the-premises, enterprises, and original equipment manufacturers markets in the United States and internationally. The company offers FieldSmart, a series of panels, cabinets, wall boxes, and other enclosures. It also provides WaveSmart, which are optical components integrated for signal coupling, splitting, termination, multiplexing, demultiplexing, and attenuation for integration within its fiber management platform; and ODC outdoor active cabinet products. In addition, the company offers FieldShield, a fiber pathway and protection method for reducing the cost of broadband deployment; and YOURx platform that consists of hardened terminals, test access points, and various drop cable options for portions of the access network across various fiber drop cable media. Further, it provides CraftSmart, a line of optical protection field enclosures, including CraftSmart Fiber Protection Pedestals and CraftSmart Fiber Protection Vaults integrated solutions optimized to house FieldSmart products at the last mile access point of the network in above-grade or below-grade installations. Additionally, the company offers fiber and copper assemblies with an industry-standard or customer-specified configuration; and designs and manufactures custom solutions for in-the-box and network connectivity assemblies specific to that customer's product line. It provides its fiber to anywhere platform for various incumbent local exchange carriers, competitive local exchange carriers, and MSO/cable TV companies, as well as the utility/municipality, enterprise, data center, and military markets. The company was formerly known as APA Enterprises, Inc. and changed its name to Clearfield, Inc. in January 2008. Clearfield, Inc. was founded in 1979 and is headquartered in Minneapolis, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "7050 Winnetka Avenue North, Minneapolis, MN, United States, 55428", "FullTimeEmployees": "240", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "244554240", "EBITDA": "9271811", "PERatio": "40.3333", "PEGRatio": "0", "BookValue": "5.836", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.45", "RevenuePerShareTTM": "6.642", "ProfitMargin": "0.0683", "OperatingMarginTTM": "0.0767", "ReturnOnAssetsTTM": "0.0511", "ReturnOnEquityTTM": "0.0804", "RevenueTTM": "89724968", "GrossProfitTTM": "32689123", "DilutedEPSTTM": "0.45", "QuarterlyEarningsGrowthYOY": "1.275", "QuarterlyRevenueGrowthYOY": "0.186", "AnalystTargetPrice": "17.5", "TrailingPE": "40.3333", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.7381", "PriceToBookRatio": "3.11", "EVToRevenue": "2.5667", "EVToEBITDA": "24.838", "Beta": "1.1896", "52WeekHigh": "19.27", "52WeekLow": "8.32", "50DayMovingAverage": "17.07", "200DayMovingAverage": "13.5164", "SharesOutstanding": "13647000", "SharesFloat": "11078093", "SharesShort": "113307", "SharesShortPriorMonth": "52324", "ShortRatio": "1.33", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0094", "PercentInsiders": "18.885", "PercentInstitutions": "30.584", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "1989-04-03"}