{"Symbol": "CLNE", "AssetType": "Common Stock", "Name": "Clean Energy Fuels Corp", "Description": "Clean Energy Fuels Corp. provides natural gas as an alternative fuel for vehicle fleets, primarily in the United States and Canada. The company supplies renewable natural gas (RNG), compressed natural gas (CNG), and liquefied natural gas (LNG) for light, medium, and heavy-duty vehicles; and offers operation and maintenance services for public and private vehicle fleet customer stations. It also designs, builds, operates, and maintains fueling stations; sells and services natural gas fueling compressors and other equipment that are used in CNG and LNG stations; and provides assessment, design, and modification solutions to offer operators with code-compliant service and maintenance facilities for natural gas vehicle fleets. In addition, the company transports and sells CNG and LNG through virtual natural gas pipelines and interconnects; procures and sells RNG; sells tradable credits, such as RNG and conventional natural gas as a vehicle fuel comprising Renewable Identification Numbers and Low Carbon Fuel Standards credits; enables its customers to acquire and finance natural gas vehicles; and obtains federal, state and local credits, grants, and incentives. It serves heavy-duty trucking, airports, refuse, public transit, industrial, and institutional energy users, as well as government fleets. As of December 31, 2019, the company served approximately 1,000 fleet customers operating approximately 48,000 natural gas vehicles; and owned, operated, or supplied approximately 550 natural gas fueling stations in 41 states in the United States and four provinces in Canada. Clean Energy Fuels Corp. was incorporated in 2001 and is headquartered in Newport Beach, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Refining & Marketing", "Address": "4675 MacArthur Court, Newport Beach, CA, United States, 92660", "FullTimeEmployees": "412", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "546400256", "EBITDA": "67448000", "PERatio": "17", "PEGRatio": "2.42", "BookValue": "2.594", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.156", "RevenuePerShareTTM": "1.668", "ProfitMargin": "0.0933", "OperatingMarginTTM": "0.0648", "ReturnOnAssetsTTM": "0.0202", "ReturnOnEquityTTM": "0.0522", "RevenueTTM": "339928992", "GrossProfitTTM": "131958000", "DilutedEPSTTM": "0.156", "QuarterlyEarningsGrowthYOY": "5.12", "QuarterlyRevenueGrowthYOY": "-0.172", "AnalystTargetPrice": "5.5", "TrailingPE": "17", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.6419", "PriceToBookRatio": "1.0444", "EVToRevenue": "1.5089", "EVToEBITDA": "5.8572", "Beta": "1.4637", "52WeekHigh": "3.14", "52WeekLow": "1.05", "50DayMovingAverage": "2.6456", "200DayMovingAverage": "2.2114", "SharesOutstanding": "198691008", "SharesFloat": "130476370", "SharesShort": "1535629", "SharesShortPriorMonth": "943176", "ShortRatio": "1.31", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0221", "PercentInsiders": "33.327", "PercentInstitutions": "29.01", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}