{"Symbol": "CLRO", "AssetType": "Common Stock", "Name": "ClearOne, Inc", "Description": "ClearOne, Inc., together with its subsidiaries, designs, develops, and sells conferencing, collaboration, and network streaming solutions for voice and visual communications in the United States and internationally. The company offers a range of audio conferencing products, including professional audio conferencing and sound-reinforcement products for use in enterprise, healthcare, education and distance learning, government, legal, and finance organizations; mid-tier premium conferencing products for smaller rooms, and small and medium businesses, which interface with video and Web conferencing systems; USB-based personal and group speakerphones that could be used with PCs, laptops, tablets, smartphones, and other portable devices; and traditional tabletop conferencing phones used in conference rooms and offices. It also provides video products, such as video conferencing and collaboration solutions; and AV networking, which deliver the IP A/V experience by streaming time sensitive high definition audio and video, and control over TCP/IP networks. In addition, the company offers professional microphones consisting of beamforming microphones, ceiling microphones, and wireless microphones. ClearOne, Inc. sells its commercial products to a network of independent professional audiovisual, information technology, and telecommunications distributors, as well as systems integrators, dealers, value-added resellers, and end-users. The company was founded in 1983 and is headquartered in Salt Lake City, Utah.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "Edgewater Corporate Park South Tower, Salt Lake City, UT, United States, 84116", "FullTimeEmployees": "127", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "43969728", "EBITDA": "-6893000", "PERatio": "None", "PEGRatio": "4.74", "BookValue": "2.445", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.314", "RevenuePerShareTTM": "1.466", "ProfitMargin": "-0.3173", "OperatingMarginTTM": "-0.2652", "ReturnOnAssetsTTM": "-0.0746", "ReturnOnEquityTTM": "-0.1745", "RevenueTTM": "24408000", "GrossProfitTTM": "12084000", "DilutedEPSTTM": "-0.47", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.01", "AnalystTargetPrice": "4.05", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.8007", "PriceToBookRatio": "1.0798", "EVToRevenue": "1.8276", "EVToEBITDA": "0", "Beta": "0.9126", "52WeekHigh": "3.45", "52WeekLow": "1.32", "50DayMovingAverage": "2.4931", "200DayMovingAverage": "2.0511", "SharesOutstanding": "16655200", "SharesFloat": "3438467", "SharesShort": "2420", "SharesShortPriorMonth": "7607", "ShortRatio": "0.07", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0007", "PercentInsiders": "75.64", "PercentInstitutions": "5.377", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2018-03-21", "ExDividendDate": "2018-03-06", "LastSplitFactor": "None", "LastSplitDate": "None"}