{"Symbol": "CNIT", "AssetType": "Common Stock", "Name": "China Information Technology, Inc", "Description": "China Information Technology, Inc. provides cloud-based platform, resource sharing, and big data solutions to the Chinese new media, education residential community management, and elevator Internet of Things (IoT) industries primarily in the People's Republic of China. The company operates in two segments, Cloud-based Technology and Traditional Information Technology. It offers cloud-based software as a service to automate the interactive workflow between advertising agencies and their customers, including establishing new projects, submitting advertisement proposals, revising and approving advertising proposals, processing payment online, remotely uploading advertisement content, and tracking and analyzing performance data. The company also provides project-based technology products and services for the public sector; and software and hardware with fully integrated solutions, including information technology infrastructure, Internet-enabled display technologies, and IoT platforms to customers in government, education, residential community management, media, transportation, and other private sectors, as well as related maintenance and support services. The company was formerly known as China Information Security Technology, Inc. and changed its name to China Information Technology, Inc. in August 2010. China Information Technology, Inc. was founded in 1993 and is headquartered in Shenzhen, the People's Republic of China.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "96", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "71737952", "EBITDA": "1604728", "PERatio": "88", "PEGRatio": "0", "BookValue": "0.134", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-0.28", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "9", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}