{"Symbol": "CNMD", "AssetType": "Common Stock", "Name": "CONMED Corporation", "Description": "CONMED Corporation, a medical technology company, develops, manufactures, and sells surgical devices and related equipment for minimally invasive procedures worldwide. The company offers orthopedic surgery products, including sports medicine products comprising powered resection instruments, arthroscopes, reconstructive systems, tissue repair sets, and metal and bioabsorbable implants, as well as related disposable products and fluid management systems; powered surgical instruments for use in bone orthopedic, arthroscopic, oral/maxillofacial, podiatric, spinal, and cardiothoracic surgeries; sports biologics and tissue products; and surgical visualization products. It offers orthopedic surgery products under Hall, CONMED Linvatec, Concept, and Shutt brands. The company also offers general surgery product in the areas of advanced surgical comprising clinical insufflation system; electrosurgical products; and endomechanical products comprising instruments, such as tissue retrieval bags, trocars, suction irrigation devices, graspers, scissors, and dissectors. In addition, it offers endoscopic technologies offering, including diagnostic and therapeutic products for use in gastroenterology procedures; cardiology and critical care products cover a line of vital signs, cardiac monitoring, and patient care products, including ECG electrodes and accessories, cardiac defibrillation and pacing pads, and suction instruments and tubing; and physician's office electrosurgical product used by dermatologists. The company markets its products directly to surgeons, hospitals, surgery centers, group purchasing organizations, integrated delivery networks, and other customers, as well as through medical specialty distributors. CONMED Corporation was founded in 1970 and is headquartered in Utica, New York.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "525 French Road, Utica, NY, United States, 13502", "FullTimeEmployees": "3300", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2490854656", "EBITDA": "136132000", "PERatio": "74.8496", "PEGRatio": "5.29", "BookValue": "23.627", "DividendPerShare": "0.8", "DividendYield": "0.0092", "EPS": "0.015", "RevenuePerShareTTM": "30.574", "ProfitMargin": "0.0005", "OperatingMarginTTM": "0.0763", "ReturnOnAssetsTTM": "0.0238", "ReturnOnEquityTTM": "0.0006", "RevenueTTM": "870252032", "GrossProfitTTM": "528908000", "DilutedEPSTTM": "0.015", "QuarterlyEarningsGrowthYOY": "4.519", "QuarterlyRevenueGrowthYOY": "-0.338", "AnalystTargetPrice": "95.5", "TrailingPE": "74.8496", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.9124", "PriceToBookRatio": "3.681", "EVToRevenue": "3.7402", "EVToEBITDA": "28.4404", "Beta": "1.2462", "52WeekHigh": "115.73", "52WeekLow": "37.66", "50DayMovingAverage": "82.8667", "200DayMovingAverage": "75.7525", "SharesOutstanding": "28571400", "SharesFloat": "28249101", "SharesShort": "846967", "SharesShortPriorMonth": "1023312", "ShortRatio": "6", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0878", "PercentInsiders": "2.738", "PercentInstitutions": "103.104", "ForwardAnnualDividendRate": "0.8", "ForwardAnnualDividendYield": "0.0092", "PayoutRatio": "0.708", "DividendDate": "2020-10-05", "ExDividendDate": "2020-09-14", "LastSplitFactor": "3:2", "LastSplitDate": "2001-09-10"}