{"Symbol": "CNOB", "AssetType": "Common Stock", "Name": "ConnectOne Bancorp, Inc", "Description": "ConnectOne Bancorp, Inc. operates as the bank holding company for ConnectOne Bank, a state chartered bank that provides various commercial banking products and services. The company offers a range of deposit products, including personal and business checking accounts, retirement accounts, money market accounts, and time and savings accounts. It also provides personal and commercial business loans on a secured and unsecured basis; revolving lines of credit; commercial mortgage loans; residential mortgages on primary and secondary residences; home equity loans; bridge loans; and other personal purpose loans. In addition, the company offers insurance and annuities, credit cards, wire transfers, access to automated teller services, Internet banking, treasury direct, ACH origination, mobile banking by phone, safe deposit box, and remote deposit capture services. It operates through 16 banking offices in Bergen County, 5 banking offices in Union County, 2 banking offices in Morris County, 1 office in Newark in Essex County, 1 office in West New York in Hudson County, 1 office in Princeton in Mercer County, one office in Holmdel in Monmouth County, 1 office in the borough of Manhattan in New York City, 1 office in Melville, Nassau County, and 1 office in Astoria, Queens, as well as 7 branches in the Hudson Valley. ConnectOne Bancorp, Inc. serves small-to-medium sized businesses, high net worth individuals, professional practices, and consumer and retail customers. The company was formerly known as Center Bancorp, Inc. and changed its name to ConnectOne Bancorp, Inc. in July 2014. ConnectOne Bancorp, Inc. was incorporated in 1982 and is headquartered in Englewood Cliffs, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "301 Sylvan Avenue, Englewood Cliffs, NJ, United States, 07632", "FullTimeEmployees": "0", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "609408896", "EBITDA": "None", "PERatio": "8.6105", "PEGRatio": "1.83", "BookValue": "21.856", "DividendPerShare": "0.36", "DividendYield": "0.0237", "EPS": "1.681", "RevenuePerShareTTM": "5.101", "ProfitMargin": "0.333", "OperatingMarginTTM": "0.5236", "ReturnOnAssetsTTM": "0.0092", "ReturnOnEquityTTM": "0.0809", "RevenueTTM": "190238000", "GrossProfitTTM": "186254000", "DilutedEPSTTM": "1.681", "QuarterlyEarningsGrowthYOY": "-0.315", "QuarterlyRevenueGrowthYOY": "0.087", "AnalystTargetPrice": "21", "TrailingPE": "8.6105", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.2773", "PriceToBookRatio": "0.6785", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.2654", "52WeekHigh": "26.5", "52WeekLow": "8.855", "50DayMovingAverage": "14.4669", "200DayMovingAverage": "15.2859", "SharesOutstanding": "39752700", "SharesFloat": "34858904", "SharesShort": "847323", "SharesShortPriorMonth": "371448", "ShortRatio": "3.9", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0127", "PercentInsiders": "12.421", "PercentInstitutions": "58.146", "ForwardAnnualDividendRate": "0.36", "ForwardAnnualDividendYield": "0.0237", "PayoutRatio": "0.2093", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-14", "LastSplitFactor": "105:100", "LastSplitDate": "2007-04-27"}