{"Symbol": "COMM", "AssetType": "Common Stock", "Name": "CommScope Holding Company, Inc", "Description": "CommScope Holding Company, Inc. provides infrastructure solutions for communications and entertainment networks worldwide. The company's Connectivity segment offers fiber optic, copper cable, and connectivity solutions for use in data centers, business enterprises, telecommunications, cable television, and residential broadband networks. Its Mobility segment provides building blocks for cellular base station sites and related connectivity; indoor, small cell, and distributed antenna wireless systems; and wireless network backhaul planning and optimization solutions. The company's Customer Premises Equipment segment provides subscriber-based solutions that support broadband and video applications connecting cable, telecommunications, and satellite service providers. This segment offers devices that provide residential connectivity to service provider's network, such as digital subscriber line, cable modems, and telephony and data gateways that incorporate routing and Wi-Fi functionality. It also provides set top boxes that support cable, satellite, and IPTV content delivery, as well as digital video recorders, high definition set top boxes, and hybrid set top devices. Its Network & Cloud Segment offers cable modem termination systems, video infrastructure, distribution and transmission equipment, and cloud solutions that enable facility-based service providers to construct residential and metro distribution network. The company's Ruckus segment provides converged wired and wireless networks for enterprises and service providers. This segment offers indoor and outdoor Wi-Fi and LTE access points, access, and aggregation switches; IoT suite, and on-premises and cloud-based control and management systems; and software and software-as-a-service applications for security, location, reporting, and analytics. The company was formerly known as Cedar I Holding Company, Inc. CommScope Holding Company, Inc. was founded in 1976 and is headquartered in Hickory, North Carolina.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "1100 CommScope Place, SE, Hickory, NC, United States, 28602", "FullTimeEmployees": "30000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2056706304", "EBITDA": "1010499968", "PERatio": "None", "PEGRatio": "2.28", "BookValue": "1.53", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.618", "RevenuePerShareTTM": "45.251", "ProfitMargin": "-0.1219", "OperatingMarginTTM": "0.0149", "ReturnOnAssetsTTM": "0.0055", "ReturnOnEquityTTM": "-0.5725", "RevenueTTM": "8814799872", "GrossProfitTTM": "2622900000", "DilutedEPSTTM": "-5.798", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.181", "AnalystTargetPrice": "13.48", "TrailingPE": "0", "ForwardPE": "9.2937", "PriceToSalesRatioTTM": "0.2267", "PriceToBookRatio": "6.7355", "EVToRevenue": "1.3843", "EVToEBITDA": "47.9654", "Beta": "1.5764", "52WeekHigh": "15.79", "52WeekLow": "5.5", "50DayMovingAverage": "9.6071", "200DayMovingAverage": "9.8055", "SharesOutstanding": "196814000", "SharesFloat": "165642181", "SharesShort": "10463117", "SharesShortPriorMonth": "8808575", "ShortRatio": "1.64", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0517", "PercentInsiders": "1.811", "PercentInstitutions": "105.079", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}