{"Symbol": "CPAH", "AssetType": "Common Stock", "Name": "CounterPath Corporation", "Description": "CounterPath Corporation designs, develops, and sells software and services that enable enterprises and telecommunication service providers to deliver unified communications services over Internet protocol based networks in North America and internationally. Its products include Bria softphone suite that enables consumers and business users to make VoIP audio and video calls, send instant messages, manage their presence, share their screen, and collaborate with other users using desktop computers and laptops, smartphones, and tablets; and Bria Solo, which offers individual users to deploy their own softphones for use against SIP-based call sever. The company also offers software development kits that deliver voice, video, and messaging capabilities for desktop computers and mobile devices; Stretto Platform, a carrier-grade software platform for enterprises and service providers; Bria Teams, which delivers centralized provisioning, messaging, presence, screen sharing, video conferencing, and collaboration; and Bria Enterprise, an application for enterprises, service providers, and telecommunication channel partners to leverage the Stretto Platform to procure, distribute, provide, and manage Bria Enterprise clients from the cloud; and hosted messaging and collaboration solutions. In addition, it provides subscription, support, and maintenance services; and professional and other services, such as product configuration and customization, implementation, engineering, and training. The company sells its products and services through its own and third-party online stores; directly using its in-house sales team; and its channel partners. It serves small, medium, and large enterprises; telecommunications service providers and Internet telephony service providers; original equipment manufacturers, value added distributors, and value added resellers serving the telecommunication market; and end users. The company was founded in 2002 and is headquartered in Vancouver, Canada.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "One Bentall Centre, Vancouver, BC, Canada, V7X 1M3", "FullTimeEmployees": "72", "FiscalYearEnd": "April", "LatestQuarter": "2020-04-30", "MarketCapitalization": "24491586", "EBITDA": "-4799423", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.335", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.83", "RevenuePerShareTTM": "2.014", "ProfitMargin": "-0.0906", "OperatingMarginTTM": "-0.0661", "ReturnOnAssetsTTM": "-0.0403", "ReturnOnEquityTTM": "-0.4161", "RevenueTTM": "12101326", "GrossProfitTTM": "9976378", "DilutedEPSTTM": "-0.182", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.419", "AnalystTargetPrice": "3.38", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.9369", "PriceToBookRatio": "12.2312", "EVToRevenue": "2.3111", "EVToEBITDA": "0", "Beta": "1.901", "52WeekHigh": "6", "52WeekLow": "0.83", "50DayMovingAverage": "4.4467", "200DayMovingAverage": "3.3833", "SharesOutstanding": "6411410", "SharesFloat": "3126450", "SharesShort": "11171", "SharesShortPriorMonth": "6239", "ShortRatio": "0.07", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0012", "PercentInsiders": "50.323", "PercentInstitutions": "0.724", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:10", "LastSplitDate": "2015-11-02"}