{"Symbol": "CPIX", "AssetType": "Common Stock", "Name": "Cumberland Pharmaceuticals Inc", "Description": "Cumberland Pharmaceuticals Inc., a specialty pharmaceutical company, focuses on the acquisition, development, and commercialization of prescription products for hospital acute care, gastroenterology, and oncology markets in the United States and internationally. It offers Acetadote, an injection for the treatment of acetaminophen poisoning; Caldolor, an injection for the treatment of pain and fever; Kristalose, a prescription laxative, for the treatment of chronic and acute constipation; Omeclamox-Pak for the treatment of Helicobacter pylori infection and duodenal ulcer disease; Vaprisol injection for treating hyponatremia; Ethyol injection for the reduction of xerostomia; Totect injection, for emergency oncology intervention, to treat the toxic effects of anthracycline chemotherapy; and Vibativ injection, for the treatment of certain serious bacterial infections. The company's Phase II product candidates includes Hepatoren injection for the treatment of critically ill patients suffering from liver and kidney failure; Boxaban oral capsules for the treatment of asthma patients; Vasculan oral capsule for the treatment of systemic sclerosis; and Portaban for the treatment of portal hypertension. It also develops RediTrex injection for the treatment of active rheumatoid, juvenile idiopathic, and severe psoriatic arthritis, as well as severe disabling psoriasis. The company markets and sells its products through sales representatives and district managers. Cumberland Pharmaceuticals Inc. has a strategic alliance with Clinigen Group plc and Nordic Group B.V. The company was incorporated in 1999 and is headquartered in Nashville, Tennessee.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersSpecialty & Generic", "Address": "2525 West End Avenue, Nashville, TN, United States, 37203", "FullTimeEmployees": "94", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "48443520", "EBITDA": "211835", "PERatio": "None", "PEGRatio": "0", "BookValue": "3.193", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.291", "RevenuePerShareTTM": "3.099", "ProfitMargin": "-0.1033", "OperatingMarginTTM": "-0.092", "ReturnOnAssetsTTM": "-0.0265", "ReturnOnEquityTTM": "-0.0898", "RevenueTTM": "47315244", "GrossProfitTTM": "38781617", "DilutedEPSTTM": "-0.323", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.019", "AnalystTargetPrice": "9.75", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.0406", "PriceToBookRatio": "1.007", "EVToRevenue": "0.8664", "EVToEBITDA": "153.3588", "Beta": "0.4181", "52WeekHigh": "6.1", "52WeekLow": "3.1", "50DayMovingAverage": "3.2986", "200DayMovingAverage": "3.6345", "SharesOutstanding": "15138600", "SharesFloat": "8649149", "SharesShort": "80732", "SharesShortPriorMonth": "81261", "ShortRatio": "1.82", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0103", "PercentInsiders": "42.731", "PercentInstitutions": "29.492", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2007-07-06"}