{"Symbol": "CRNT", "AssetType": "Common Stock", "Name": "Ceragon Networks Ltd", "Description": "Ceragon Networks Ltd. provides wireless backhaul solutions that enable cellular operators and other wireless service providers to deliver voice and data services. Its wireless backhaul solutions use microwave and millimeter wave technology to transfer telecommunication traffic between base stations, small sells, and the core of the service provider's network. The company also offers wireless fronthaul solutions that use microwave technology for ultra-high speed, ultra-low latency communication for wireless 5G and 4G base stations. In addition, it provides IP-20 all-outdoor solutions, such as IP-20C, IP-20C-HP, IP-20S, IP-20E, and IP-20V; IP-20 split-mount/all-indoor solutions comprising IP-20N/IP-20A, IP-20GX, IP-20F, and IP-20G; and IP-50 disaggregated solutions, including IP-50E, IP-50C, and IP-50FX for various short-haul, long-haul, fronthaul, and enterprise access applications. Further, the company offers network management system; and network and radio planning, site survey, solutions development, installation, network auditing and optimization, maintenance, training, and other services. It provides its services to smart-phone applications, such as internet browsing, social networking, image sharing, music, and video applications; oil and gas companies; public safety organizations; business and public institutions; broadcasters; energy utilities; and private communications networks. The company sells its products through direct sales, original equipment manufacturers, resellers, distributors, and system integrators. It operates in North America, Europe, Africa, the Asia Pacific, the Middle East, India, and Latin America. The company was formerly known as Giganet Ltd. and changed its name to Ceragon Networks Ltd. in September 2000. Ceragon Networks Ltd. was founded in 1996 and is headquartered in Tel Aviv, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "24 Raoul Wallenberg Street, Tel Aviv, Israel, 69719", "FullTimeEmployees": "1042", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "185798000", "EBITDA": "2013000", "PERatio": "12.327", "PEGRatio": "11.8667", "BookValue": "1.819", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.159", "RevenuePerShareTTM": "3.245", "ProfitMargin": "-0.0622", "OperatingMarginTTM": "-0.033", "ReturnOnAssetsTTM": "-0.0186", "ReturnOnEquityTTM": "-0.1046", "RevenueTTM": "261716992", "GrossProfitTTM": "96842000", "DilutedEPSTTM": "-0.202", "QuarterlyEarningsGrowthYOY": "-0.971", "QuarterlyRevenueGrowthYOY": "-0.145", "AnalystTargetPrice": "3.25", "TrailingPE": "0", "ForwardPE": "178.5714", "PriceToSalesRatioTTM": "0.6996", "PriceToBookRatio": "1.2501", "EVToRevenue": "0.6445", "EVToEBITDA": "37.3299", "Beta": "2.033", "52WeekHigh": "3.19", "52WeekLow": "0.99", "50DayMovingAverage": "2.5072", "200DayMovingAverage": "2.0774", "SharesOutstanding": "81134496", "SharesFloat": "58065183", "SharesShort": "599469", "SharesShortPriorMonth": "617018", "ShortRatio": "0.77", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0076", "PercentInsiders": "24.255", "PercentInstitutions": "15.182", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}