{"Symbol": "CRTO", "AssetType": "Common Stock", "Name": "Criteo S.A", "Description": "Criteo S.A., a technology company, provides an advertising platform for the open Internet in France and internationally. The company's Criteo Shopper Graph, which collects clients' proprietary commerce data, such as transaction activity on their digital properties. Its Criteo AI Engine solutions include lookalike finder, recommendation, and predictive bidding algorithms; bidding engine that executes campaigns based on certain objectives set by its clients; dynamic creative optimization+, which assembles customized creative advertising content by optimizing each individual creative component in the advertisement; software systems and processes, which enable data synchronization, storage, and analysis of distributed computing infrastructure in various geographies; and experimentation platform, an offline/online platform to enhance the capabilities and effectiveness of prediction models. The company also provides real-time access to advertising inventory through its publisher partners. In addition, it offers consulting services to companies in distance sales; and business intelligence and analytics services. Further, the company offers Criteo Marketing Solutions that allow commerce companies to address various marketing goals by engaging their consumers with personalized ads across the web, mobile, and offline store environments; and Criteo Retail Media, which allows retailers to generate advertising revenues from consumer brands, and/or to drive sales for themselves, by monetizing their data and audiences through personalized ads, either on their own digital property or on the open Internet. It serves companies in digital retail, travel, and classifieds industries. The company was founded in 2005 and is headquartered in Paris, France.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Advertising Agencies", "Address": "32, rue Blanche, Paris, France, 75009", "FullTimeEmployees": "2685", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "819352128", "EBITDA": "232288992", "PERatio": "10.6299", "PEGRatio": "0.97", "BookValue": "16.542", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.288", "RevenuePerShareTTM": "33.67", "ProfitMargin": "0.0387", "OperatingMarginTTM": "0.0676", "ReturnOnAssetsTTM": "0.0503", "ReturnOnEquityTTM": "0.0822", "RevenueTTM": "2116236032", "GrossProfitTTM": "829036000", "DilutedEPSTTM": "1.288", "QuarterlyEarningsGrowthYOY": "-0.438", "QuarterlyRevenueGrowthYOY": "-0.171", "AnalystTargetPrice": "14.22", "TrailingPE": "10.6299", "ForwardPE": "11.8483", "PriceToSalesRatioTTM": "0.4061", "PriceToBookRatio": "0.8082", "EVToRevenue": "0.1896", "EVToEBITDA": "1.7141", "Beta": "1.2918", "52WeekHigh": "20.765", "52WeekLow": "5.89", "50DayMovingAverage": "13.2689", "200DayMovingAverage": "11.2665", "SharesOutstanding": "60025800", "SharesFloat": "57550963", "SharesShort": "474797", "SharesShortPriorMonth": "449732", "ShortRatio": "1.77", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0", "PercentInsiders": "3.687", "PercentInstitutions": "98.507", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}