{"Symbol": "CSGP", "AssetType": "Common Stock", "Name": "CoStar Group, Inc", "Description": "CoStar Group, Inc. provides information, analytics, and online marketplaces to the commercial real estate industry in the United States and the United Kingdom. The company offers CoStar Property Professional service that offers inventory of office, industrial, retail, and multifamily, and student housing properties and land. It also provides CoStar COMPS Professional that covers comparable commercial real estate sales information; CoStar Market Analytics to view and report on aggregated market and submarket trends; CoStar Tenant, an online business-to-business prospecting and analytical tool; CoStar Lease Comps, a solution to capture, manage, and maintain lease data; CoStar Lease Analysis, a workflow tool; and CoStar Public Record, a searchable database of commercially-zoned parcels. In addition, the company offers CoStar Real Estate Manager, a real estate and asset management, and lease accounting software; CoStar Risk Analytics, a commercial real estate risk management tool; and CoStar Investment Analysis that provides market research, consulting and analysis, portfolio and debt analysis, and management and reporting services, as well as STAR Report that offers benchmarking and analytics for the hospitality industry. Further, it provides apartment marketing sites, such as Apartments.com, ApartmentFinder.com, ForRent.com, ApartmentHomeLiving.com, Apartamentos.com, WestsideRentals.com, AFTER55.com, CorporateHousing.com and ForRentUniversity.com; LoopNet Premium Lister and LoopNet Signature Ads for commercial real estate professionals; Realla, a commercial property listings and data management platform; LandsofAmerica, LandAndFarm, and LandWatch online marketplaces for rural land for sale; and BizBuySell, BizQuest, FindaFranchise online marketplaces for operating businesses for sale. CoStar Group, Inc. was founded in 1987 and is headquartered in Washington, the District of Columbia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Real Estate", "Industry": "Real Estate Services", "Address": "1331 L Street, NW, Washington, DC, United States, 20005", "FullTimeEmployees": "4200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "33559664640", "EBITDA": "447424992", "PERatio": "103.7879", "PEGRatio": "11.2186", "BookValue": "132.654", "DividendPerShare": "None", "DividendYield": "0", "EPS": "8.102", "RevenuePerShareTTM": "41.354", "ProfitMargin": "0.1976", "OperatingMarginTTM": "0.2324", "ReturnOnAssetsTTM": "0.0436", "ReturnOnEquityTTM": "0.0711", "RevenueTTM": "1516540032", "GrossProfitTTM": "1110480000", "DilutedEPSTTM": "8.102", "QuarterlyEarningsGrowthYOY": "-0.075", "QuarterlyRevenueGrowthYOY": "0.155", "AnalystTargetPrice": "868.33", "TrailingPE": "103.7879", "ForwardPE": "212.766", "PriceToSalesRatioTTM": "20.5135", "PriceToBookRatio": "6.3427", "EVToRevenue": "20.1084", "EVToEBITDA": "63.8721", "Beta": "1.15", "52WeekHigh": "939", "52WeekLow": "500.24", "50DayMovingAverage": "787.7405", "200DayMovingAverage": "687.7592", "SharesOutstanding": "39367100", "SharesFloat": "38911621", "SharesShort": "1039834", "SharesShortPriorMonth": "1018206", "ShortRatio": "1.89", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.017", "PercentInsiders": "1.632", "PercentInstitutions": "96.957", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}