{"Symbol": "CSPI", "AssetType": "Common Stock", "Name": "CSP Inc", "Description": "CSP Inc. develops and markets IT integration solutions, security products, managed IT services, purpose built network adapters, and cluster computer systems for commercial and defense customers worldwide. The company's High Performance Products segment offers ARIA Software-Defined Security, a cybersecurity solution; Myricom network adapters comprising Ethernet adapters and specialized software of ARC Series and Secure Intelligent Adapters; ARIA security appliances for network security services; nVoy Series, including Packet Broker and Packet Recorder appliances; and multicomputer products for digital signal processing applications in the defense markets. Its Technology Solutions segment provides third-party computer hardware and software as a value added reseller to various customers in Web and infrastructure hosting, education, telecommunications, healthcare services, distribution, financial and professional services, and manufacturing industries. This segment also offers professional IT consulting services, such as implementation, integration, migration, configuration, installation, and project management; storage and virtualization solutions; enterprise security intrusion prevention, network access control, and unified threat management services; and IT security compliance services. In addition, this segment provides unified communications, wireless, and routing and switching solutions; custom software applications and solutions development and support services; maintenance and technical support services; and managed IT services, such as monitoring, reporting, and management of alerts for the resolution and preventive general IT, as well as IT security support tasks. Further, this segment offers managed and cloud services, such as proactive monitoring and remote management of IT infrastructure, managed and hosted unified communication services, security, and backup and replication. CSP Inc. was founded in 1968 and is headquartered in Lowell, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "175 Cabot Street, Lowell, MA, United States, 01854", "FullTimeEmployees": "114", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "40458624", "EBITDA": "-1200000", "PERatio": "3.2017", "PEGRatio": "0", "BookValue": "6.694", "DividendPerShare": "0.6", "DividendYield": "0.0588", "EPS": "4.001", "RevenuePerShareTTM": "17.088", "ProfitMargin": "-0.0266", "OperatingMarginTTM": "-0.0169", "ReturnOnAssetsTTM": "-0.013", "ReturnOnEquityTTM": "-0.0595", "RevenueTTM": "68360000", "GrossProfitTTM": "18026000", "DilutedEPSTTM": "-0.454", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.373", "AnalystTargetPrice": "65", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5706", "PriceToBookRatio": "1.4647", "EVToRevenue": "0.4181", "EVToEBITDA": "84.0586", "Beta": "1.7637", "52WeekHigh": "15.85", "52WeekLow": "4.51", "50DayMovingAverage": "8.2483", "200DayMovingAverage": "9.032", "SharesOutstanding": "4276810", "SharesFloat": "2630155", "SharesShort": "2366", "SharesShortPriorMonth": "1917", "ShortRatio": "0.31", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0003", "PercentInsiders": "22.467", "PercentInstitutions": "33.112", "ForwardAnnualDividendRate": "0.6", "ForwardAnnualDividendYield": "0.0588", "PayoutRatio": "0", "DividendDate": "2020-03-13", "ExDividendDate": "2020-02-27", "LastSplitFactor": "11:10", "LastSplitDate": "1999-04-19"}