{"Symbol": "CSWC", "AssetType": "Common Stock", "Name": "Capital Southwest Corporation", "Description": "Capital Southwest Corporation is a business development company specializing in credit and private equity and venture capital investments in middle market companies, mezzanine, later stage, mature, late venture, emerging growth, buyouts, recapitalizations and growth capital investments. It does not invest in startups, publicly traded companies, real estate developments, project finance opportunities, oil and gas exploration businesses, troubled companies, turnarounds, and companies in which significant senior management is departing. In lower middle market, the firm typically invests in growth financing, bolt-on acquisitions, new platform acquisitions, refinancing, dividend recapitalizations, sponsor-led buyouts, and management buyouts situations. The investment structures are Unitranche debt, subordinated debt, senior debt, first and second lien debt, and preferred and common equity. The firm makes equity co-investments alongside debt investments, up to 20% of total check and only makes non-control investments. It prefers to invest in Industrial manufacturing and services, value-added distribution, healthcare products and services, business services, specialty chemicals, food and beverage, tech-enabled services and SaaS models. The firm seeks to invest in energy services and products, industrial technologies, and specialty chemicals and products. Within energy services and products, the firm seeks to invest in each segment of the industry, including upstream, midstream and downstream, excluding exploration and production with a focus on differentiated products and services, equipment and tool rental, consumable products, and drilling and completion chemicals. Within industrial technologies, it seeks to invest in automation and process controls, handling and packaging equipment, industrial filtration and fluid handling, measurement, monitoring and testing, professional tools, and sensors and instrumentation. Within and specialty chemicals and products, the firm seeks to invest in businesses that develop and manuf", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Asset Management", "Address": "Lincoln Center Tower 1, Dallas, TX, United States, 75240", "FullTimeEmployees": "22", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "278449728", "EBITDA": "48495000", "PERatio": "17.8683", "PEGRatio": "0", "BookValue": "14.948", "DividendPerShare": "1.64", "DividendYield": "0.1129", "EPS": "1.392", "RevenuePerShareTTM": "3.383", "ProfitMargin": "-0.3288", "OperatingMarginTTM": "0.7514", "ReturnOnAssetsTTM": "0.0487", "ReturnOnEquityTTM": "-0.0666", "RevenueTTM": "61404000", "GrossProfitTTM": "62039000", "DilutedEPSTTM": "-1.112", "QuarterlyEarningsGrowthYOY": "0.287", "QuarterlyRevenueGrowthYOY": "-0.04", "AnalystTargetPrice": "15.57", "TrailingPE": "17.8683", "ForwardPE": "9.1324", "PriceToSalesRatioTTM": "159.455", "PriceToBookRatio": "0.9714", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.444", "52WeekHigh": "22.56", "52WeekLow": "7.39", "50DayMovingAverage": "14.06", "200DayMovingAverage": "13.9589", "SharesOutstanding": "17998100", "SharesFloat": "17735688", "SharesShort": "70190", "SharesShortPriorMonth": "114584", "ShortRatio": "0.47", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0021", "PercentInsiders": "6.881", "PercentInstitutions": "39.431", "ForwardAnnualDividendRate": "1.64", "ForwardAnnualDividendYield": "0.1129", "PayoutRatio": "2.0703", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-14", "LastSplitFactor": "4:1", "LastSplitDate": "2013-08-16"}