{"Symbol": "CTBI", "AssetType": "Common Stock", "Name": "Community Trust Bancorp, Inc", "Description": "Community Trust Bancorp, Inc. operates as the bank holding company for Community Trust Bank, Inc. that provides commercial and personal banking services to small and mid-sized communities. The company accepts time and demand deposits, Keogh plans, and savings certificates, as well as checking and savings, regular, individual retirement, NOW, and money market accounts. It also offers loan products, such as commercial and residential real estate loans; commercial, construction and development, mortgage, and personal loans, as well as consumer, and secured and unsecured loans; and lease-financing, lines of credit, revolving lines of credit, and term loans, as well as other specialized loans, including asset-based financing. In addition, the company provides cash management, safe deposit boxes rental, and funds transfer services; issues letters of credit; and acts as a trustee of personal trusts, executor of estates, trustee for employee benefit trusts, and paying agent for bond and stock issues, as well as an investment agent and depositor for securities. Further, it offers full service securities brokerage, and trust and wealth management services; debit cards; annuity and life insurance products; and repurchase agreements, as well as mobile, telephone, and Internet banking services. The company operates 79 banking locations in eastern, northeastern, central, south central Kentucky, southern West Virginia, and northeastern Tennessee; 4 trust offices in Kentucky; and 1 trust office in Tennessee. Community Trust Bancorp, Inc. was founded in 1903 and is headquartered in Pikeville, Kentucky.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "346 North Mayo Trail, Pikeville, KY, United States, 41501", "FullTimeEmployees": "979", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "579099008", "EBITDA": "None", "PERatio": "10", "PEGRatio": "3.55", "BookValue": "35.508", "DividendPerShare": "1.54", "DividendYield": "0.0475", "EPS": "3.24", "RevenuePerShareTTM": "10.076", "ProfitMargin": "0.3218", "OperatingMarginTTM": "0.4081", "ReturnOnAssetsTTM": "0.0122", "ReturnOnEquityTTM": "0.0938", "RevenueTTM": "178732000", "GrossProfitTTM": "186828000", "DilutedEPSTTM": "3.24", "QuarterlyEarningsGrowthYOY": "0.076", "QuarterlyRevenueGrowthYOY": "0.108", "AnalystTargetPrice": "35", "TrailingPE": "10", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.9087", "PriceToBookRatio": "0.9129", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.7555", "52WeekHigh": "47.54", "52WeekLow": "27.52", "50DayMovingAverage": "32.3075", "200DayMovingAverage": "33.2714", "SharesOutstanding": "17802000", "SharesFloat": "15090232", "SharesShort": "209568", "SharesShortPriorMonth": "117956", "ShortRatio": "2.78", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0082", "PercentInsiders": "5.04", "PercentInstitutions": "61.701", "ForwardAnnualDividendRate": "1.54", "ForwardAnnualDividendYield": "0.0475", "PayoutRatio": "0.4691", "DividendDate": "2020-10-01", "ExDividendDate": "2020-09-14", "LastSplitFactor": "11:10", "LastSplitDate": "2014-05-13"}