{"Symbol": "CTSO", "AssetType": "Common Stock", "Name": "Cytosorbents Corporation", "Description": "Cytosorbents Corporation, a critical care focused immunotherapy company, engages in the research, development, and commercialization of medical devices with its blood purification technology platform incorporating a proprietary adsorbent and porous polymer technology. The company's flagship product is CytoSorb device, an extracorporeal cytokine filter designed for the adjunctive therapy in the treatment of sepsis; adjunctive therapy in other critical care applications; prevention and treatment of post-operative complications of cardiopulmonary bypass surgery; prevention and treatment of organ dysfunction in brain-dead organ donors to increase the number and quality of viable organs harvested from donors; and VetResQ device for adjunctive therapy in the treatment of sepsis, pancreatitis, and other critical illnesses in animals. The company also develops CytoSorb-XL device for adjunctive therapy in the treatment of sepsis and other critical illnesses; HemoDefend blood purification technology platform to reduce contaminants in the blood supply that can cause transfusion reactions or disease when administering blood and blood products to patients; K+ontrol for treatment of severe hyperkalemia with life-threatening conditions; and ContrastSorb for the removal of IV contrast in blood administered during CT imaging, an angiogram, or during a vascular interventional radiology procedure to reduce the risk of contrast-induced nephropathy. In addition, it is involved in the development of BetaSorb device for the prevention and treatment of health complications caused by the accumulation of metabolic toxins in patients with chronic renal failure; and DrugSorb, a development-stage extracorporeal hemoperfusion cartridge designed to remove toxic chemicals from the blood. The company was formerly known as MedaSorb Technologies Corporation and changed its name to CytoSorbents Corporation in May 2010. The company was founded in 1997 and is based in Monmouth Junction, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "7 Deer Park Drive, Monmouth Junction, NJ, United States, 08852", "FullTimeEmployees": "156", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "355836896", "EBITDA": "-15662669", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.661", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.529", "RevenuePerShareTTM": "0.947", "ProfitMargin": "-0.5356", "OperatingMarginTTM": "-0.5256", "ReturnOnAssetsTTM": "-0.2707", "ReturnOnEquityTTM": "-0.9566", "RevenueTTM": "32027530", "GrossProfitTTM": "17585554", "DilutedEPSTTM": "-0.507", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.572", "AnalystTargetPrice": "14.67", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "8.9656", "PriceToBookRatio": "15.0647", "EVToRevenue": "10.8548", "EVToEBITDA": "0", "Beta": "0.5242", "52WeekHigh": "11.74", "52WeekLow": "3.49", "50DayMovingAverage": "9.4364", "200DayMovingAverage": "8.3477", "SharesOutstanding": "43157900", "SharesFloat": "39550743", "SharesShort": "3047323", "SharesShortPriorMonth": "2831732", "ShortRatio": "4.03", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.0689", "PercentInsiders": "10.274", "PercentInstitutions": "26.728", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:25", "LastSplitDate": "2014-12-05"}