{"Symbol": "CVBF", "AssetType": "Common Stock", "Name": "CVB Financial Corp", "Description": "CVB Financial Corp. operates as a bank holding company for Citizens Business Bank that provides banking and financial products and services. The company offers checking, savings, and money market accounts, as well as time certificates of deposit; and serves as a federal tax depository for business customers. It also provides commercial lending products comprising lines of credit and other working capital financing, accounts receivable lending, and letters of credit; loans to finance the operating needs of wholesale dairy farm operations, cattle feeders, livestock raisers, and farmers; lease financing services for municipal governments; commercial real estate and construction loans that are secured by owner-occupied and investor owned properties; and consumer financing products, including automobile leasing and financing, lines of credit, credit cards, home mortgages, and home equity loans and lines of credit. In addition, the company offers various specialized services, such as cash management systems for monitoring cash flow, a credit card program for merchants, courier pick-up and delivery, payroll services, remote deposit capture, electronic funds transfer, and online account access. Further, it provides trust and investment-related services to customers through its CitizensTrust Division, such as fiduciary services, mutual funds, annuities, 401(k) plans, and individual investment accounts. The company's customers consist primarily of small to mid-sized businesses and individuals. As of December 31, 2019, the company operated 58 banking centers located in the Inland Empire, Los Angeles County, Orange County, San Diego County, Ventura County, Santa Barbara County, and the Central Valley area of California; one loan production office located in Modesto, California; and three trust offices located in Ontario, Newport Beach, and Pasadena, California. CVB Financial Corp. was founded in 1974 and is headquartered in Ontario, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "701 North Haven Avenue, Ontario, CA, United States, 91764", "FullTimeEmployees": "0", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2496260096", "EBITDA": "None", "PERatio": "14.2692", "PEGRatio": "2.22", "BookValue": "14.457", "DividendPerShare": "0.72", "DividendYield": "0.0388", "EPS": "1.301", "RevenuePerShareTTM": "3.208", "ProfitMargin": "0.4082", "OperatingMarginTTM": "0.5926", "ReturnOnAssetsTTM": "0.0146", "ReturnOnEquityTTM": "0.0931", "RevenueTTM": "444180000", "GrossProfitTTM": "484129000", "DilutedEPSTTM": "1.301", "QuarterlyEarningsGrowthYOY": "-0.21", "QuarterlyRevenueGrowthYOY": "-0.138", "AnalystTargetPrice": "19.8", "TrailingPE": "14.2692", "ForwardPE": "15.5763", "PriceToSalesRatioTTM": "5.4692", "PriceToBookRatio": "1.2832", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.6286", "52WeekHigh": "22.22", "52WeekLow": "14.915", "50DayMovingAverage": "18.3575", "200DayMovingAverage": "18.8652", "SharesOutstanding": "135519008", "SharesFloat": "127726792", "SharesShort": "5449510", "SharesShortPriorMonth": "5551535", "ShortRatio": "8.46", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.048", "PercentInsiders": "5.856", "PercentInstitutions": "74.83", "ForwardAnnualDividendRate": "0.72", "ForwardAnnualDividendYield": "0.0388", "PayoutRatio": "0.4154", "DividendDate": "2020-07-23", "ExDividendDate": "2020-07-08", "LastSplitFactor": "11:10", "LastSplitDate": "2007-01-03"}