{"Symbol": "CVGI", "AssetType": "Common Stock", "Name": "Commercial Vehicle Group, Inc", "Description": "Commercial Vehicle Group, Inc., together with its subsidiaries, designs, engineers, produces, and sells a range of cab related products and systems in North America, Europe, and the Asia-Pacific regions. It operates in two segments, Electrical Systems and Global Seating. The Electrical Systems segment offers electrical wire harness assemblies that function as current carrying devices in providing electrical interconnections for gauges, lights, control functions, power circuits, powertrain and transmission sensors, emissions systems, and other electronic applications on commercial vehicles; and panel assemblies and cabinets. It also offers trim systems and components for the interior of cabs, including vinyl or cloth-covered appliqus, armrests, map pocket compartments, and sound-reducing insulations; instrument panels; headliners/wall panels; storage systems; floor covering systems; sleeper bunks; grab handles and armrests; privacy curtains; and plastics decorating and finishing products. In addition, this segment provides cab structures and sleeper boxes; mirrors, wipers, and controls; and electro-mechanical and cable assembly manufacturing services to customers, including box builds, complex rack and stack assemblies, and multi-cabinet control cabinets with power distribution and cabling. The Global Seating segment offers seats and seating systems, such as mechanical and air suspension, static, bus, and military seats, as well as seats for medium-and heavy-duty trucks (MD/HD trucks); office seating products; and seats, parts, and components for the aftermarket. The company supplies its products and systems for the commercial vehicle market comprising the MD/HD truck market; medium-and heavy-construction vehicle market; and military, bus, agriculture, specialty transportation, mining, industrial equipment, and off-road recreational markets. Commercial Vehicle Group, Inc. was founded in 2000 and is headquartered in New Albany, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Auto Parts", "Address": "7800 Walton Parkway, New Albany, OH, United States, 43054", "FullTimeEmployees": "7347", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "151146352", "EBITDA": "21592000", "PERatio": "4.1293", "PEGRatio": "1.83", "BookValue": "2.836", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.16", "RevenuePerShareTTM": "23.695", "ProfitMargin": "-0.0514", "OperatingMarginTTM": "0.0118", "ReturnOnAssetsTTM": "0.0125", "ReturnOnEquityTTM": "-0.3338", "RevenueTTM": "728884992", "GrossProfitTTM": "107337000", "DilutedEPSTTM": "-1.217", "QuarterlyEarningsGrowthYOY": "-0.32", "QuarterlyRevenueGrowthYOY": "-0.478", "AnalystTargetPrice": "6", "TrailingPE": "4.1293", "ForwardPE": "7.8555", "PriceToSalesRatioTTM": "0.1796", "PriceToBookRatio": "1.5754", "EVToRevenue": "0.3809", "EVToEBITDA": "24.7592", "Beta": "3.2538", "52WeekHigh": "8.02", "52WeekLow": "1.24", "50DayMovingAverage": "3.2614", "200DayMovingAverage": "2.7246", "SharesOutstanding": "32645000", "SharesFloat": "28967583", "SharesShort": "1725598", "SharesShortPriorMonth": "686324", "ShortRatio": "1.31", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0167", "PercentInsiders": "4.59", "PercentInstitutions": "75.633", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}