{"Symbol": "CVLT", "AssetType": "Common Stock", "Name": "Commvault Systems, Inc", "Description": "Commvault Systems, Inc. provides data protection and information management software applications and related services in the United States, Canada, Latin America, Europe, the Middle East, Africa, Australia, New Zealand, Southeast Asia, and China. It offers Commvault Complete Backup & Recovery, a backup and recovery solution for enterprises; and Commvault HyperScale Technology, an add-on for Commvault Complete that delivers an on-premises, cloud-like infrastructure to support scale-out secondary storage. The company also provides Commvault Orchestrate, an automated service delivery technology that enables users to provision, sync, and validate data in various environments for IT needs, such as disaster recovery testing, development testing operations, and workload migrations; Commvault Venture ? Hedvig, a storage platform provides multi-protocol support required across block, file, and object storage with native application, hypervisor, container, and cloud integration; and Commvault Venture ? Metallic offers software-as-a-service backup and recovery solutions; and Commvault Activate, a solution, which allow customers to comply with privacy regulations. In addition, it sells appliances that integrate the software with hardware for use in a range of business needs and use cases; and offers professional and customer support services. The company sells its software and related services directly through its sales force to large enterprises, small and medium sized businesses, and government agencies, as well as indirectly through its network of value-added resellers, systems integrators, corporate resellers, and original equipment manufacturers. It licenses its software applications to customers in the banking, insurance and financial services, government, healthcare, pharmaceuticals and medical services, technology, legal, manufacturing, utility, and energy industries. The company has strategic relationships with Atos, Cisco, Citrix, Fujitsu, Hewlett Packard Enterprise, Microsoft, Oracle, SAP, Netapp, Amazon Web Serv", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "1 Commvault Way, Tinton Falls, NJ, United States, 07724", "FullTimeEmployees": "2500", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2019903360", "EBITDA": "26284000", "PERatio": "544.125", "PEGRatio": "2.26", "BookValue": "9.374", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.076", "RevenuePerShareTTM": "14.826", "ProfitMargin": "0.0051", "OperatingMarginTTM": "0.0171", "ReturnOnAssetsTTM": "0.0088", "ReturnOnEquityTTM": "0.0088", "RevenueTTM": "681681984", "GrossProfitTTM": "553807000", "DilutedEPSTTM": "0.076", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.067", "AnalystTargetPrice": "50.5", "TrailingPE": "544.125", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.941", "PriceToBookRatio": "4.6506", "EVToRevenue": "2.4617", "EVToEBITDA": "53.8121", "Beta": "0.7786", "52WeekHigh": "51.9", "52WeekLow": "24.26", "50DayMovingAverage": "41.6311", "200DayMovingAverage": "40.4143", "SharesOutstanding": "46391900", "SharesFloat": "38832324", "SharesShort": "1835362", "SharesShortPriorMonth": "1938623", "ShortRatio": "5.01", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0467", "PercentInsiders": "7.982", "PercentInstitutions": "108.247", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}