{"Symbol": "CVV", "AssetType": "Common Stock", "Name": "CVD Equipment Corporation", "Description": "CVD Equipment Corporation develops, manufactures, and sells equipment and process solutions that are used to develop and manufacture materials and coatings for research and industrial applications in the United States and internationally. It operates through three segments: CVD, SDC, and CVD Materials. The company offers chemical vapor deposition systems for use in the research, development, and manufacture of aerospace and medical components, semiconductors, LEDs, carbon nanotubes, nanowires, solar cells, and other industrial applications; and rapid thermal processing systems for use in implant activation, oxidation, silicide formation, and other processes. It also provides annealing, diffusion, and low pressure chemical vapor deposition furnaces for use in diffusion, oxidation, implant anneal, solder reflow, solar cell manufacturing, and other processes; and gas and liquid control systems, such as gas cylinder storage cabinets, custom gas and chemical delivery systems, gas and liquid valve manifold boxes, and gas isolation boxes for semiconductor fabrication processes, solar cells, LEDs, carbon nanotubes, nanowires, and industrial applications. In addition, the company offers standard and custom fabricated quartz-ware used in its equipment and other customer tools, as well as repair and replacement services for existing quartz-ware. Further, it provides MesoPlasma direct write printing, a materials deposition process that provides traces, patterns, and coatings onto conformal components; and Tantaline corrosion resistant coating for valves, fittings, fasteners, vessels, bellows, and custom designed items, as well as offers carbon composites and electronic materials. The company sells its products primarily to electronic component manufacturers, universities, and government and industrial laboratories, as well as to the aerospace and medical industries. CVD Equipment Corporation was founded in 1982 and is headquartered in Central Islip, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "355 South Technology Drive, Central Islip, NY, United States, 11722", "FullTimeEmployees": "172", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "20383818", "EBITDA": "-7886828", "PERatio": "None", "PEGRatio": "0", "BookValue": "4.612", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.228", "RevenuePerShareTTM": "3.181", "ProfitMargin": "-0.1063", "OperatingMarginTTM": "-0.0905", "ReturnOnAssetsTTM": "-0.0243", "ReturnOnEquityTTM": "-0.07", "RevenueTTM": "21006518", "GrossProfitTTM": "2796575", "DilutedEPSTTM": "-0.338", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.244", "AnalystTargetPrice": "16", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.9924", "PriceToBookRatio": "0.6844", "EVToRevenue": "1.2243", "EVToEBITDA": "0", "Beta": "1.7588", "52WeekHigh": "5.59", "52WeekLow": "1.95", "50DayMovingAverage": "3.3339", "200DayMovingAverage": "3.3179", "SharesOutstanding": "6639680", "SharesFloat": "5216933", "SharesShort": "2464", "SharesShortPriorMonth": "1440", "ShortRatio": "0.25", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0023", "PercentInsiders": "19.893", "PercentInstitutions": "14.301", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}