{"Symbol": "CYBE", "AssetType": "Common Stock", "Name": "CyberOptics Corporation", "Description": "CyberOptics Corporation develops and manufactures high precision sensing technology solutions worldwide. Its sensors are being used in surface mount technology (SMT), semiconductor, and metrology markets to improve yields and productivity. The company offers multi-reflection suppression sensors for application in the SMT, semiconductor, and metrology markets; and strobe inspection modules for use in 2D automated optical inspection (AOI) systems. It also provides SMT electronic assembly alignment sensor products, including LaserAlign sensors for incorporation into pick-and-place machines; and InPrinter Inspection Camera, which identifies fiducial markings on a circuit board to ensure accurate board registration prior to placement of solder paste. In addition, the company offers 3D solder paste inspection sensors; inspection system products primarily used in the semiconductor and SMT electronic assembly industries for process control, inspection, and metrology; AOI products to inspect circuit boards after component placement; and 3D solder paste measurement machines. Further, it provides general industrial metrology products and services, such as CyberGage 360, which are used as in-line or offline metrology tools; and sells 3D scanning and metrology equipment manufactured by other suppliers and provides 3D scanning and metrology services, as well as provides WaferSense family of products that provide measurements of critical factors in the semiconductor fabrication process. The company sells its products to SMT electronic assembly circuit board manufacturers, end-user customers manufacturing their own circuit boards, semiconductor manufacturers, and outsourced semiconductor assembly and test companies through independent sales representatives and distributors. CyberOptics Corporation was founded in 1984 and is headquartered in Minneapolis, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "5900 Golden Hills Drive, Minneapolis, MN, United States, 55416", "FullTimeEmployees": "173", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "235141600", "EBITDA": "4738000", "PERatio": "116.8387", "PEGRatio": "25.1", "BookValue": "8.429", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.314", "RevenuePerShareTTM": "8.625", "ProfitMargin": "0.0372", "OperatingMarginTTM": "0.0323", "ReturnOnAssetsTTM": "0.0163", "ReturnOnEquityTTM": "0.0386", "RevenueTTM": "61668000", "GrossProfitTTM": "26302000", "DilutedEPSTTM": "0.314", "QuarterlyEarningsGrowthYOY": "2.667", "QuarterlyRevenueGrowthYOY": "0.063", "AnalystTargetPrice": "46", "TrailingPE": "116.8387", "ForwardPE": "0", "PriceToSalesRatioTTM": "4.294", "PriceToBookRatio": "4.3098", "EVToRevenue": "4.0944", "EVToEBITDA": "52.9665", "Beta": "1.2747", "52WeekHigh": "43.48", "52WeekLow": "12.77", "50DayMovingAverage": "37.5258", "200DayMovingAverage": "28.4567", "SharesOutstanding": "7252980", "SharesFloat": "6996156", "SharesShort": "244861", "SharesShortPriorMonth": "81069", "ShortRatio": "1.76", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0288", "PercentInsiders": "3.473", "PercentInstitutions": "55.291", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:2", "LastSplitDate": "2000-06-16"}