{"Symbol": "CYCC", "AssetType": "Common Stock", "Name": "Cyclacel Pharmaceuticals, Inc", "Description": "Cyclacel Pharmaceuticals, Inc., a clinical-stage biopharmaceutical company, develops medicines for the treatment of cancer and other proliferative diseases. The company's oncology development programs include CYC065, a cyclin dependent kinase Inhibitors (CDK) that is in Phase I clinical trial for the treatment of solid tumors, as well as in combination with venetoclax to treat relapsed or refractory chronic lymphocytic leukemia; and CYC140, a polo-like kinase inhibitor program, which is in Phase I clinical trial for the treatment of advanced leukemias. Its oncology development programs also comprise sapacitabine, an oral nucleoside analogue prodrug that is in Phase 1/2 combination study with seliciclib, a CDK inhibitor in patients with BRCA mutations; with olaparib, a poly ADP-ribose polymerase inhibitor in BRCA mutation positive patients with breast cancer; and Phase III clinical trial for the treatment of acute myeloid leukemia. In addition, the company's oncology development programs include seliciclib, a CDK inhibitor that is in all-oral Phase 1/2 combination study with sapacitabine for BRCA mutations. It has a clinical collaboration agreement with the University of Texas MD Anderson Cancer Center to clinically evaluate the safety and efficacy of three cyclacel medicines in patients with hematological malignancies, including chronic lymphocytic leukemias, acute myeloid leukemias, myelodysplastic syndromes, and other advanced leukemias; and collaboration, licensing, and supply agreement with ManRos Therapeutics SA for the development and commercialization of oral seliciclib capsules for the treatment of cystic fibrosis. Cyclacel Pharmaceuticals, Inc. was founded in 1992 and is headquartered in Berkeley Heights, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "200 Connell Drive, Berkeley Heights, NJ, United States, 07922", "FullTimeEmployees": "12", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "18920882", "EBITDA": "-9438000", "PERatio": "0.2731", "PEGRatio": "0", "BookValue": "5.464", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.573", "RevenuePerShareTTM": "0.01", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "-0.258", "ReturnOnEquityTTM": "-0.3588", "RevenueTTM": "150000", "GrossProfitTTM": "-4658000", "DilutedEPSTTM": "-4.846", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "21.33", "TrailingPE": "0.2731", "ForwardPE": "0", "PriceToSalesRatioTTM": "74.5692", "PriceToBookRatio": "0.7119", "EVToRevenue": "6.0999", "EVToEBITDA": "0.5331", "Beta": "1.3033", "52WeekHigh": "11.44", "52WeekLow": "0.29", "50DayMovingAverage": "4.4869", "200DayMovingAverage": "6.3099", "SharesOutstanding": "4863980", "SharesFloat": "4462949", "SharesShort": "233803", "SharesShortPriorMonth": "220363", "ShortRatio": "0.58", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0403", "PercentInsiders": "5.325", "PercentInstitutions": "14.237", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2016-08-01", "ExDividendDate": "None", "LastSplitFactor": "1:20", "LastSplitDate": "2020-04-15"}