{"Symbol": "CYRN", "AssetType": "Common Stock", "Name": "CYREN Ltd", "Description": "CYREN Ltd., together with its subsidiaries, provides information security solutions for protecting Web, email, and mobile transactions in the United States, Europe, the Asia Pacific, Israel, and internationally. The company operates Cyren Cloud Security, a SaaS security platform, which provides Internet security services, including Web Security that provides the enforcement of Web policy and state-of-the-art threat protection for business users; DNS Security, which allows businesses to protect employees at headquarters, visitors in remote offices, customers at retail stores, or students on a campus; Email Security, a cloud-based secure email gateway; and Cloud Sandboxing that protects businesses against breaches and data loss from threats. It also operates Cyren Threat Intelligence Services, a platform that offers cloud-based cyber threat detection APIs and SDKs to technology and security vendors. The company's threat intelligence services comprise embedded email and Web security services; Endpoint Security, which detects malware on various endpoints, including mobile devices and embedded operating system devices; and advanced threat protection services, such as tools for combating mobile malware, ransomware, and other Web-borne threats. CYREN Ltd. sells its products through direct and indirect channels, including value added resellers and managed service providers to enterprise customers and original equipment manufacturers. The company was formerly known as Commtouch Software Ltd. and changed its name to CYREN Ltd. in January 2014. CYREN Ltd. was founded in 1991 and is headquartered in McLean, Virginia. CYREN Ltd. is a subsidiary of WP XII Investments B.V.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "1430 Spring Hill Road, McLean, VA, United States, 22102", "FullTimeEmployees": "229", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "67663232", "EBITDA": "-13365000", "PERatio": "None", "PEGRatio": "-0.39", "BookValue": "0.31", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.354", "RevenuePerShareTTM": "0.653", "ProfitMargin": "-0.4289", "OperatingMarginTTM": "-0.3721", "ReturnOnAssetsTTM": "-0.1323", "ReturnOnEquityTTM": "-0.7646", "RevenueTTM": "37855000", "GrossProfitTTM": "23058000", "DilutedEPSTTM": "-0.28", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.055", "AnalystTargetPrice": "2", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.6226", "PriceToBookRatio": "3.4273", "EVToRevenue": "2.0931", "EVToEBITDA": "0", "Beta": "1.1275", "52WeekHigh": "1.97", "52WeekLow": "0.31", "50DayMovingAverage": "1.3531", "200DayMovingAverage": "1.1194", "SharesOutstanding": "60413600", "SharesFloat": "27191538", "SharesShort": "60068", "SharesShortPriorMonth": "89342", "ShortRatio": "0.21", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0022", "PercentInsiders": "5.862", "PercentInstitutions": "67.837", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:3", "LastSplitDate": "2008-01-02"}