{"Symbol": "CZFC", "AssetType": "Common Stock", "Name": "Citizens First Corporation", "Description": "As of July 1, 2019, Citizens First Corporation was acquired by German American Bancorp, Inc. Citizens First Corporation operates as the bank holding company for Citizens First Bank, Inc. that provides various banking products and services primarily to small and medium-sized businesses, and retail consumers. The company offers a range of deposit products and services, including checking accounts, savings accounts, NOW accounts, money market accounts, sweep accounts, fixed and variable rate IRA accounts, Christmas Club accounts, and certificate of deposit accounts. It provides various loan products, including secured and unsecured commercial loans; commercial real estate loans, such as loans secured by multi-family residential units, income-producing properties, and owner-occupied commercial properties; construction loans; and consumer loans comprising personal loans and lines of credit to consumers for various purposes, including the purchase of automobiles, boats, and other recreational vehicles, as well as for home improvements and personal investments. In addition, the company offers residential real estate mortgage loans for borrowers to purchase and refinance one-to-four family properties; and home equity loans and home equity lines of credit. Further, it provides debit and credit cards, safekeeping and safe deposit boxes, ACH and other direct deposit services, savings bond redemptions, cashier's checks, travelers' checks, and letters of credit, as well as cash management services, wire transfer services, and loan participations. The company conducts full-service community banking operations from eight locations in Barren, Hart, Simpson, and Warren Counties in Kentucky; and a loan production office in Williamson County, Tennessee. Citizens First Corporation was founded in 1975 and is headquartered in Bowling Green, Kentucky.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "1065 Ashley Street\n42103,Bowling Green,USA\n", "FullTimeEmployees": "93", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "65407988", "EBITDA": "None", "PERatio": "13.5158", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0.0109", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}