{"Symbol": "DEPO", "AssetType": "Common Stock", "Name": "Depomed, Inc", "Description": "Depomed, Inc., a specialty pharmaceutical company, engages in the development, sale, and licensing of products for pain and other central nervous system conditions in the United States. It offers Gralise (gabapentin), an once-daily product for the management of postherpetic neuralgia; CAMBIA (diclofenac potassium for oral solution), a non-steroidal anti-inflammatory drug indicated for acute treatment of migraine attacks in adults; and Zipsor (diclofenac potassium) liquid filled capsule, a non-steroidal anti-inflammatory drug for the treatment of mild to moderate acute pain in adults. The company also provides NUCYNTA ER (tapentadol extended release tablet), a product for the management of pain severe enough to long term opioid treatment, including neuropathic pain associated with diabetic peripheral neuropathy (DPN) in adults; and NUCYNTA IR (tapentadol), a product for the management of moderate to severe acute pain in adults. In addition, it is involved in the clinical development of Cebranopadol for the treatment of chronic nociceptive and neuropathic pain. Depomed, Inc. has a collaboration and license agreement with Ironwood Pharmaceuticals, Inc.; and a license agreement with Janssen Pharmaceuticals, Inc. based on its proprietary Acuform gastroretentive drug delivery technology. The company sells its products to wholesalers and retail pharmacies. Depomed, Inc. was founded in 1995 and is headquartered in Newark, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "434", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "464188032", "EBITDA": "166108000", "PERatio": "None", "PEGRatio": "0.45", "BookValue": "3.241", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-1.79", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "9.88", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}