{"Symbol": "DGII", "AssetType": "Common Stock", "Name": "Digi International Inc", "Description": "Digi International Inc. provides Internet of Things connectivity products, services, and solutions in North America, Europe, the Middle East, Africa, and internationally. The company operates in two segments, IoT Products & Services and IoT Solutions. It offers cellular routers that provide connectivity for devices over a cellular data network; cellular gateway products that enable devices or groups of devices to be networked in locations where there is no existing network or where access to a network is prohibited; radio frequency products that utilize a range of wireless protocols for PC-to-device or device-to-device connectivity; and Connect, Rabbit, and ARM-based embedded systems on module and single board computers for medical, transportation, and industrial device manufacturers. The company also provides console and serial servers, as well as universal serial bus (USB)-to-serial converters, USB over Internet protocol products, and multiport USB hubs. In addition, it offers cellular remote management products that provide cellular router technology and device management solutions; Digi Remote Manager, a centralized remote device management solution to meet service level commitments and stay compliant with payment card industry data security standards, as well as to monitor, diagnose, and fix remote devices; turn-key wireless networking product development, testing, and certification for wireless technology platforms and applications; and implementation planning, application development, on-site support, installation, and customer training services. Further, it provides SmartSense by Digi, a system that enables customers in food service, healthcare, transportation/logistics, and education to monitor the temperature of food and other perishable goods; and to track the completion of operating tasks by employees, as well as to have visibility in the supply chain to product temperature. The company was founded in 1985 and is headquartered in Hopkins, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "9350 Excelsior Boulevard, Hopkins, MN, United States, 55343", "FullTimeEmployees": "543", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "397791840", "EBITDA": "31074000", "PERatio": "64.6667", "PEGRatio": "0.7644", "BookValue": "12.514", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.21", "RevenuePerShareTTM": "9.47", "ProfitMargin": "0.0231", "OperatingMarginTTM": "0.0499", "ReturnOnAssetsTTM": "0.0185", "ReturnOnEquityTTM": "0.0177", "RevenueTTM": "271062016", "GrossProfitTTM": "121998000", "DilutedEPSTTM": "0.21", "QuarterlyEarningsGrowthYOY": "0.022", "QuarterlyRevenueGrowthYOY": "0.15", "AnalystTargetPrice": "19.5", "TrailingPE": "64.6667", "ForwardPE": "12.987", "PriceToSalesRatioTTM": "1.4705", "PriceToBookRatio": "1.0853", "EVToRevenue": "1.6048", "EVToEBITDA": "16.5259", "Beta": "1.7533", "52WeekHigh": "18.99", "52WeekLow": "6.18", "50DayMovingAverage": "12.6042", "200DayMovingAverage": "11.4748", "SharesOutstanding": "29035900", "SharesFloat": "28234190", "SharesShort": "1009890", "SharesShortPriorMonth": "965273", "ShortRatio": "5.76", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.032", "PercentInsiders": "2.347", "PercentInstitutions": "85.461", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:2", "LastSplitDate": "1992-04-01"}