{"Symbol": "DJCO", "AssetType": "Common Stock", "Name": "Daily Journal Corporation", "Description": "Daily Journal Corporation publishes newspapers and Websites covering in California, Arizona, Colorado, and Utah. It operates in two segments, Traditional Business and Journal Technologies. The company publishes 10 newspapers of general circulation, including Los Angeles Daily Journal, San Francisco Daily Journal, Daily Commerce, The Daily Recorder, The Inter-City Express, San Jose Post-Record, Orange County Reporter, The Daily Transcript, Business Journal, and The Record Reporter. It also provides specialized information services; and serves as an advertising and newspaper representative for commercial and public notice advertising. In addition, the company offers case management software systems and related products, including eCourt, eProsecutor, eDefender, and eProbation, which are browser-based case processing systems; eFile, a browser-based interface that allows attorneys and the general public to electronically file documents with the court using the Internet; and ePayIt, a service primarily for the online payment of traffic citations. It provides its software systems and related products for courts; prosecutor and public defender offices; probation departments; and other justice agencies, including administrative law organizations, city and county governments, and bar associations to manage cases and information electronically, to interface with other justice partners, and to extend electronic services to bar members and the public in 42 states and internationally. The company was incorporated in 1987 and is based in Los Angeles, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Publishing", "Address": "915 East First Street, Los Angeles, CA, United States, 90012", "FullTimeEmployees": "375", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "392063968", "EBITDA": "-6257000", "PERatio": "34.502", "PEGRatio": "0", "BookValue": "79.564", "DividendPerShare": "None", "DividendYield": "0", "EPS": "7.624", "RevenuePerShareTTM": "36.143", "ProfitMargin": "-0.8089", "OperatingMarginTTM": "-0.0274", "ReturnOnAssetsTTM": "-0.0038", "ReturnOnEquityTTM": "-0.3104", "RevenueTTM": "49904000", "GrossProfitTTM": "11398000", "DilutedEPSTTM": "-29.235", "QuarterlyEarningsGrowthYOY": "2.734", "QuarterlyRevenueGrowthYOY": "-0.113", "AnalystTargetPrice": "None", "TrailingPE": "34.502", "ForwardPE": "0", "PriceToSalesRatioTTM": "7.8301", "PriceToBookRatio": "3.5569", "EVToRevenue": "5.2046", "EVToEBITDA": "9.0758", "Beta": "0.7709", "52WeekHigh": "298", "52WeekLow": "187.53", "50DayMovingAverage": "285.9533", "200DayMovingAverage": "266.5726", "SharesOutstanding": "1380750", "SharesFloat": "1004230", "SharesShort": "74265", "SharesShortPriorMonth": "71332", "ShortRatio": "32.52", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0895", "PercentInsiders": "28.299", "PercentInstitutions": "44.182", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}