{"Symbol": "DTV", "AssetType": "Common Stock", "Name": "DTE Energy Company CORPORATE UNIT", "Description": "DTE Energy Company engages in the utility operations. The company's Electric segment generates, purchases, distributes, and sells electricity to approximately 2.2 million residential, commercial, and industrial customers in southeastern Michigan. It generates electricity through fossil-fuel, hydroelectric pumped storage, and nuclear plants, as well as wind and other renewable assets. This segment owns and operates approximately 692 distribution substations and 440,500 line transformers. Its Gas segment purchases, stores, transports, distributes, and sells natural gas to approximately 1.3 million residential, commercial, and industrial customers in Michigan, as well as the sells storage and transportation capacity. This segment has approximately 19,500 miles of distribution mains; 1,216,000 service pipelines; and 1,262,000 active meters, as well as owns approximately 2,000 miles of transmission pipelines. The company's Gas Storage and Pipelines segment owns natural gas storage fields, lateral and gathering pipeline systems, and compression and surface facilities, as well as has ownership interests in interstate pipelines serving the Midwest, Ontario, and northeast markets. Its Power and Industrial Projects segment provides metallurgical coke; pulverized coal and petroleum coke to the steel, pulp and paper, and other industries; and power, steam and chilled water production, and wastewater treatment services, as well as supplies compressed air to industrial customers. It also owns and operates 5 renewable generating plants with a capacity of 217 MWs; 21 landfill gas recovery sites; and 11 reduced emissions fuel facilities. The company's Energy Trading segment is involved in power and gas marketing and trading; structured transactions; and the optimization of contracted natural gas pipeline transportation and storage positions. DTE Energy Company was founded in 1903 and is headquartered in Detroit, Michigan.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "10200", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "10406645760", "EBITDA": "None", "PERatio": "9.5208", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0.0561", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "93.46", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}