{"Symbol": "DXPE", "AssetType": "Common Stock", "Name": "DXP Enterprises, Inc", "Description": "DXP Enterprises, Inc., together with its subsidiaries, engages in distributing maintenance, repair, and operating (MRO) products, equipment, and services to energy and industrial customers primarily in the United States and Canada. It operates through three segments: Service Centers (SC), Supply Chain Services (SCS), and Innovative Pumping Solutions (IPS). The SC segment offers MRO products, equipment, and integrated services, including technical expertise and logistics services. It offers MRO products in the rotating equipment, bearing, power transmission, hose, fluid power, metal working, fastener, industrial supply, safety products, and safety services categories. This segment serves customers in the oil and gas, food and beverage, petrochemical, transportation, other general industrial, mining, construction, chemical, municipal, agriculture, and pulp and paper industries. The SCS segment manages procurement and inventory management solutions; and offers outsourced MRO solutions for sourcing MRO products, including inventory optimization and management, store room management, transaction consolidation and control, vendor oversight and procurement cost optimization, productivity improvement services, and customized reporting. Its programs include SmartAgreement, a procurement solution for various MRO categories; SmartBuy, an on-site or centralized MRO procurement solution; SmartSource, an on-site procurement and storeroom management solution; SmartStore, an e-Catalog solution; SmartVend, an industrial dispensing solution; and SmartServ, an integrated service pump solution. The IPS segment fabricates and assembles custom-made pump packages, remanufactures pumps, and manufactures branded private label pumps. The company was founded in 1908 and is based in Houston, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Industrial Distribution", "Address": "5301 Hollister Street, Houston, TX, United States, 77040", "FullTimeEmployees": "2747", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "352020224", "EBITDA": "71020000", "PERatio": "15.256", "PEGRatio": "2.1", "BookValue": "20.076", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.251", "RevenuePerShareTTM": "66.532", "ProfitMargin": "0.0197", "OperatingMarginTTM": "0.0393", "ReturnOnAssetsTTM": "0.0367", "ReturnOnEquityTTM": "0.0668", "RevenueTTM": "1175030016", "GrossProfitTTM": "347224000", "DilutedEPSTTM": "1.251", "QuarterlyEarningsGrowthYOY": "-0.842", "QuarterlyRevenueGrowthYOY": "-0.246", "AnalystTargetPrice": "28", "TrailingPE": "15.256", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.3003", "PriceToBookRatio": "0.9502", "EVToRevenue": "0.4621", "EVToEBITDA": "7.5506", "Beta": "2.7511", "52WeekHigh": "43.94", "52WeekLow": "10.44", "50DayMovingAverage": "18.9233", "200DayMovingAverage": "18.504", "SharesOutstanding": "17778800", "SharesFloat": "14695091", "SharesShort": "654952", "SharesShortPriorMonth": "589758", "ShortRatio": "5.47", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0455", "PercentInsiders": "8.293", "PercentInstitutions": "78.195", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2008-10-01"}