{"Symbol": "DYNT", "AssetType": "Common Stock", "Name": "Dynatronics Corporation", "Description": "Dynatronics Corporation designs, manufactures, and sells orthopedics, physical therapy, rehabilitation, pain management, and athletic training products in the United States and internationally. The company offers orthopedic soft bracing and support products, which include cervical collars, shoulder immobilizers, arm slings, wrist and elbow supports, abdominal and lumbosacral supports, maternity supports, knee immobilizers and supports, ankle walkers and supports, plantar fasciitis splints, and cold therapy products. It also provides power and manually operated treatment tables, mat platforms, work tables, parallel bars, training stairs, weight racks, treadmills, recumbent bikes, and other equipment. In addition, the company offers therapeutic modality devices, such as electrotherapy, ultrasound, phototherapy, therapeutic lasers, shortwave diathermy, radial pulse therapy, hot and cold therapy, compression therapy, and electrodes. Further, it provides clinical supplies, including exercise bands and tubing, topical analgesics, lotions and gels, orthopedic bracing, paper products, athletic tape, and other products. Dynatronics Corporation distributes its products under the Bird & Cronin, Dynatron Solaris, Hausmann, and PROTEAM brands. The company sells its products to orthopedists, physical therapists, chiropractors, and athletic trainers, sports medicine practitioners, hospitals, clinics, and consumers. It also exports its products to approximately 30 countries. The company was founded in 1979 and is headquartered in Cottonwood Heights, Utah.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "7030 Park Centre Drive, Cottonwood Heights, UT, United States, 84121", "FullTimeEmployees": "269", "FiscalYearEnd": "June", "LatestQuarter": "2020-03-31", "MarketCapitalization": "9933287", "EBITDA": "1231896", "PERatio": "None", "PEGRatio": "0", "BookValue": "1.065", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.208", "RevenuePerShareTTM": "6.744", "ProfitMargin": "-0.0224", "OperatingMarginTTM": "-0.0087", "ReturnOnAssetsTTM": "-0.0081", "ReturnOnEquityTTM": "-0.0669", "RevenueTTM": "60800656", "GrossProfitTTM": "19173599", "DilutedEPSTTM": "-0.253", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.058", "AnalystTargetPrice": "2.06", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.1083", "PriceToBookRatio": "0.9095", "EVToRevenue": "0.4935", "EVToEBITDA": "46.7551", "Beta": "-0.1703", "52WeekHigh": "3.7", "52WeekLow": "0.6302", "50DayMovingAverage": "0.8617", "200DayMovingAverage": "0.9191", "SharesOutstanding": "13803900", "SharesFloat": "8682487", "SharesShort": "291670", "SharesShortPriorMonth": "133950", "ShortRatio": "0.06", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0036", "PercentInsiders": "29.033", "PercentInstitutions": "6.205", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:5", "LastSplitDate": "2012-12-19"}