{"Symbol": "EBIX", "AssetType": "Common Stock", "Name": "Ebix, Inc", "Description": "Ebix, Inc. provides on-demand software and e-commerce services and solutions to insurance, financial, healthcare, and e-learning industries in the United States and internationally. It develops and deploys insurance and reinsurance exchanges; provides Software-as-a-Service (SaaS) enterprise solutions in the area of customer relationship management, and front-end and back-end systems; and offers outsourced administrative and risk compliance solutions. The company operates P&C exchanges primarily in Australia, New Zealand, the United Kingdom, and the United States, which facilitates the exchange of insurance data between brokers and insurance carriers with a focus on the areas of personal and commercial lines. Its exchange related products and services include travel exchanges and money transfer services; foreign exchange and outward remittance services; consumer bill payment services; gift cards for consumers that can be redeemed at various merchants; and technology services for various providers in the areas of lending, wealth and asset management, travel, and logistics. The company's insurance exchanges related products and services include SaaS platform and related services; licensing of software; and professional services comprising setting up, customization, training, or consulting. Its risk compliance solutions cover and certificates of insurance creation and tracking; consulting services comprising project management and development; and business process outsourcing services, including domain intensive project management, time, and material based consulting engagements. The company was formerly known as Delphi Systems, Inc. and changed its name to Ebix, Inc. in December 2003. Ebix, Inc. was founded in 1976 and is headquartered in Johns Creek, Georgia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "1 Ebix Way, Johns Creek, GA, United States, 30097", "FullTimeEmployees": "7975", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "765086848", "EBITDA": "137574000", "PERatio": "7.8576", "PEGRatio": "2.16", "BookValue": "17.723", "DividendPerShare": "0.3", "DividendYield": "0.0129", "EPS": "2.95", "RevenuePerShareTTM": "17.794", "ProfitMargin": "0.1665", "OperatingMarginTTM": "0.228", "ReturnOnAssetsTTM": "0.0493", "ReturnOnEquityTTM": "0.1442", "RevenueTTM": "542604032", "GrossProfitTTM": "375450000", "DilutedEPSTTM": "2.95", "QuarterlyEarningsGrowthYOY": "-0.191", "QuarterlyRevenueGrowthYOY": "-0.228", "AnalystTargetPrice": "54", "TrailingPE": "7.8576", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.3083", "PriceToBookRatio": "1.3253", "EVToRevenue": "2.4643", "EVToEBITDA": "8.9638", "Beta": "2.0802", "52WeekHigh": "46.12", "52WeekLow": "8.75", "50DayMovingAverage": "23.4122", "200DayMovingAverage": "22.1345", "SharesOutstanding": "30912600", "SharesFloat": "23020114", "SharesShort": "8378084", "SharesShortPriorMonth": "7167000", "ShortRatio": "30.56", "ShortPercentOutstanding": "0.25", "ShortPercentFloat": "0.3481", "PercentInsiders": "23.975", "PercentInstitutions": "75.676", "ForwardAnnualDividendRate": "0.3", "ForwardAnnualDividendYield": "0.0129", "PayoutRatio": "0.1017", "DividendDate": "2020-09-16", "ExDividendDate": "2020-09-01", "LastSplitFactor": "3:1", "LastSplitDate": "2016-08-01"}