{"Symbol": "EBTC", "AssetType": "Common Stock", "Name": "Enterprise Bancorp, Inc", "Description": "Enterprise Bancorp, Inc. operates as the holding company for Enterprise Bank and Trust Company that provides banking products and services primarily in the Greater Merrimack Valley, Nashoba Valley, and North Central regions of Massachusetts and Southern New Hampshire. The company offers commercial and retail deposit products, including transactional checking accounts, non-transactional savings and money market accounts, commercial sweep products, and term certificates of deposit. It also provides commercial real estate mortgage loans, construction and land development loans, secured and unsecured commercial loans and lines of credit, and letters of credit, as well as equipment financing services; and conventional residential mortgage loans, home equity loans and lines, residential construction loans on primary and secondary residences, and secured and unsecured personal loans and lines of credit. In addition, the company offers cash management services; customized investment management and trust services to individuals, family groups, commercial businesses, trusts, foundations, non-profit organizations, and endowments; brokerage and management services to individual investors; and insurance products. Further, it provides card, online, and mobile banking services. As of April 20, 2020, it had 25 full-service branches located in the Massachusetts communities of Lowell, Acton, Andover, Billerica, Chelmsford, Dracut, Fitchburg, Lawrence, Leominster, Lexington, Methuen, Tewksbury, Tyngsborough, and Westford; and the New Hampshire communities of Derry, Hudson, Nashua, Pelham, Salem, and Windham. The company primarily serves business entities, non-profit organizations, professional practices, and individuals. Enterprise Bancorp, Inc. was founded in 1989 and is headquartered in Lowell, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "222 Merrimack Street, Lowell, MA, United States, 01852", "FullTimeEmployees": "538", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "265520720", "EBITDA": "None", "PERatio": "8.7755", "PEGRatio": "0", "BookValue": "26.868", "DividendPerShare": "0.7", "DividendYield": "0.0326", "EPS": "2.449", "RevenuePerShareTTM": "10.86", "ProfitMargin": "0.2256", "OperatingMarginTTM": "0.3025", "ReturnOnAssetsTTM": "0.0081", "ReturnOnEquityTTM": "0.0972", "RevenueTTM": "128621000", "GrossProfitTTM": "130996000", "DilutedEPSTTM": "2.449", "QuarterlyEarningsGrowthYOY": "-0.073", "QuarterlyRevenueGrowthYOY": "0.063", "AnalystTargetPrice": "None", "TrailingPE": "8.7755", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.8491", "PriceToBookRatio": "0.8087", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.4632", "52WeekHigh": "34.75", "52WeekLow": "19.49", "50DayMovingAverage": "21.9756", "200DayMovingAverage": "23.8889", "SharesOutstanding": "11912100", "SharesFloat": "8534833", "SharesShort": "61131", "SharesShortPriorMonth": "43595", "ShortRatio": "5.17", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0059", "PercentInsiders": "25.133", "PercentInstitutions": "22.504", "ForwardAnnualDividendRate": "0.7", "ForwardAnnualDividendYield": "0.0326", "PayoutRatio": "0.2735", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-10", "LastSplitFactor": "2:1", "LastSplitDate": "2006-07-03"}