{"Symbol": "EDAP", "AssetType": "Common Stock", "Name": "EDAP TMS S.A", "Description": "EDAP TMS S.A., together with its subsidiaries, develops, produces, markets, distributes, and maintains a portfolio of minimally-invasive medical devices for the treatment of urological diseases worldwide. It operates in two divisions, High Intensity Focused Ultrasound (HIFU) and Urological Devices and Services (UDS). The HIFU division develops, manufactures, and markets medical devices based on HIFU technology for the minimally invasive treatment of urological and other clinical indications. This segment offers Ablatherm, an ultrasound guided robotic HIFU device for the treatment of organ-confined prostate cancer; Ablatherm Fusion that incorporates the company's proprietary fusion software, which merges MRI and ultrasound images; and the Focal One, a HIFU robotic device dedicated to the focal therapy of prostate cancer. It also provides disposables, and leasing and treatment related services; and maintenance services. The UDS division develops, markets, manufactures, and services medical devices for the minimally invasive diagnosis or treatment of urological disorders primarily urinary stones and other clinical indications. This segment offers Sonolith i-move, an extracorporeal shockwave lithotripter to small and mid-size hospitals; and Endo-UP platform, manages urinary stones, as well as Sonolith i-sys. It also leases lithotripters; sells disposables and spare parts; maintenance services; and distributes urodynamic products and urology lasers. The company markets and sells its products through its direct marketing, sales organization, and service platform, as well as through third-party distributors and agents. Its customers include public and private hospitals, urology clinics, and research institutions. The company was founded in 1979 and is headquartered in Lyon, France.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "Parc dActivites la Poudrette-Lamartine, Lyon, France, 69120", "FullTimeEmployees": "216", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "109281000", "EBITDA": "None", "PERatio": "27.5921", "PEGRatio": "90.47", "BookValue": "0.986", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.059", "RevenuePerShareTTM": "0", "ProfitMargin": "-0.0429", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0.0264", "ReturnOnEquityTTM": "0.0578", "RevenueTTM": "0", "GrossProfitTTM": "20951000", "DilutedEPSTTM": "-0.059", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.26", "AnalystTargetPrice": "5.33", "TrailingPE": "27.5921", "ForwardPE": "34.6021", "PriceToSalesRatioTTM": "2.364", "PriceToBookRatio": "3.5509", "EVToRevenue": "2.3012", "EVToEBITDA": "108.4449", "Beta": "1.6797", "52WeekHigh": "5.39", "52WeekLow": "1.46", "50DayMovingAverage": "3.2031", "200DayMovingAverage": "2.7864", "SharesOutstanding": "29141600", "SharesFloat": "27194035", "SharesShort": "36860", "SharesShortPriorMonth": "50425", "ShortRatio": "0.44", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "17.636", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}