{"Symbol": "EEFT", "AssetType": "Common Stock", "Name": "Euronet Worldwide, Inc", "Description": "Euronet Worldwide, Inc. provides payment and transaction processing and distribution solutions to financial institutions, retailers, service providers, and individual consumers worldwide. The company's Electronic Fund Transfer (EFT) Processing segment provides electronic payment solutions, including automated teller machine (ATM) cash withdrawal and deposit services, ATM network participation, outsourced ATM and point-of-sale (POS) management solutions, credit and debit card outsourcing, card issuing, and merchant acquiring services. This segment also offers ATM and POS currency conversion, surcharge, advertising, customer relationship management, mobile top-up, bill payment, fraud management, foreign remittance and cardless payout, banknote recycling solutions, and tax-refund services; and integrated electronic financial transaction software solutions. As of December 31, 2019, it operated a network of 46,070 ATMs; and approximately 330,000 POS terminals. Its epay segment provides distribution and processing of prepaid mobile airtime and other electronic content and payment processing services for various prepaid products, cards, and services; and vouchers and physical gift fulfillment, and gift card distribution and processing services. This segment operated a network of approximately 728,000 POS terminals. The company's Money Transfer segment offers consumer-to-consumer money transfer services primarily under the Ria, AFEX, and IME brands; account-to-account money transfer services under the xe brand; customers bill payment services; payment alternatives, such as money orders; check cashing services; foreign currency exchange and mobile top-up services; and cash management and foreign currency risk management services. The company was formerly known as Euronet Services, Inc. and changed its name to Euronet Worldwide, Inc. in August 2001. Euronet Worldwide, Inc. was founded in 1994 and is headquartered in Leawood, Kansas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "3500 College Boulevard, Leawood, KS, United States, 66211", "FullTimeEmployees": "8000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "5558843392", "EBITDA": "454483008", "PERatio": "46.0265", "PEGRatio": "1.27", "BookValue": "23.193", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.394", "RevenuePerShareTTM": "48.333", "ProfitMargin": "0.0502", "OperatingMarginTTM": "0.1296", "ReturnOnAssetsTTM": "0.0507", "ReturnOnEquityTTM": "0.0997", "RevenueTTM": "2592442880", "GrossProfitTTM": "1193626000", "DilutedEPSTTM": "2.394", "QuarterlyEarningsGrowthYOY": "-0.942", "QuarterlyRevenueGrowthYOY": "-0.237", "AnalystTargetPrice": "123.11", "TrailingPE": "46.0265", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.1828", "PriceToBookRatio": "4.485", "EVToRevenue": "2.0928", "EVToEBITDA": "16.156", "Beta": "1.1819", "52WeekHigh": "167.64", "52WeekLow": "61.2729", "50DayMovingAverage": "100.2883", "200DayMovingAverage": "99.0366", "SharesOutstanding": "52289000", "SharesFloat": "50076148", "SharesShort": "1028078", "SharesShortPriorMonth": "1290237", "ShortRatio": "2.51", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0204", "PercentInsiders": "4.081", "PercentInstitutions": "96.985", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}