{"Symbol": "EEI", "AssetType": "Common Stock", "Name": "Ecology & Environment, Inc", "Description": "Ecology & Environment, Inc., an environmental consulting firm, provides professional services to governments, industries, multinational corporations, organizations, and private companies worldwide. It offers various energy development services, such as feasibility studies, siting analyses, and critical flaw analyses; environmental/biological surveys and assessments; federal, state, and local agency consultation and permitting applications; national environmental policy act compliance; geographic information systems data management and mapping; community outreach, stakeholder engagement, and tribal consultation; and environmental monitoring services. The company also provides environmental risk advisory and project siting support services; pipeline services, including route selection, evaluation of alternatives, field surveys, regulatory compliance and permit support, preparation of environmental monitoring and restoration plans, and environmental inspection; and services related to environmental liabilities from hazardous waste sites, which include due diligence, site and risk assessment, preliminary assessment/site inspection, remedial investigation and feasibility study, corrective/remedial action planning, remedial design, construction oversight, and brownfield and property redevelopment. In addition, it offers real property master planning, military programming, geospatial data and systems support, database management, encroachment planning, and water resources planning services; and planning/NEPA and other non-SAR works, as well as helps clients in building community resilience, emergency management planning, and disaster preparedness and recovery with focus on planning, adaptation, and mitigating impacts of sea level rise and climate change. Further, the company provides species management, stream and shoreline habitat restoration, bank stabilization, fish passage, and other services. The company was founded in 1970 and is headquartered in Lancaster, New York. As of December 31, 2019, Ecology & Environment,", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "368 Pleasant View Drive, Lancaster, NY, United States, 14086", "FullTimeEmployees": "644", "FiscalYearEnd": "July", "LatestQuarter": "0000-00-00", "MarketCapitalization": "67028400", "EBITDA": "1042000", "PERatio": "None", "PEGRatio": "0", "BookValue": "7.206", "DividendPerShare": "0.4", "DividendYield": "0.0259", "EPS": "-0.442", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "38423000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "21", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.7502", "PriceToBookRatio": "2.1442", "EVToRevenue": "0.6893", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "15.45", "200DayMovingAverage": "15.1126", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2019-08-12", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}