{"Symbol": "EFSC", "AssetType": "Common Stock", "Name": "Enterprise Financial Services Corp", "Description": "Enterprise Financial Services Corp operates as the financial holding company for Enterprise Bank & Trust that offers banking and wealth management services to individuals and corporate customers. The company offers checking and savings account, and certificates of deposit. It also provides commercial and industrial, commercial real estate, real estate construction and development, residential real estate, and consumer loans. In addition, the company offers treasury management and international trade services; tax credit brokerage services consisting of the acquisition of tax credits and sale of these tax credits to clients; and financial and estate planning, investment management, and trust services to businesses, individuals, institutions, retirement plans, and non-profit organizations. Further, it offers fiduciary, financial advisory, and merchant services; and debit and credit cards. Additionally, the company provides international banking, internet and mobile banking, remote deposit capture, positive pay, fraud detection and prevention, automated payable, check imaging, and statement and document imaging services; and cash management products, controlled disbursements, repurchase agreements, and sweep investment accounts. As of December 31, 2019, it had 19 banking locations and three limited service facilities in the St. Louis metropolitan area; seven banking locations in the Kansas City metropolitan area; two banking locations in the Phoenix metropolitan area, and six banking locations in New Mexico. Enterprise Financial Services Corp was founded in 1988 and is headquartered in Clayton, Missouri.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "150 North Meramec Avenue, Clayton, MO, United States, 63105", "FullTimeEmployees": "805", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "808455104", "EBITDA": "None", "PERatio": "9.4861", "PEGRatio": "1.9", "BookValue": "33.133", "DividendPerShare": "0.72", "DividendYield": "0.0235", "EPS": "3.219", "RevenuePerShareTTM": "9.777", "ProfitMargin": "0.3306", "OperatingMarginTTM": "0.4145", "ReturnOnAssetsTTM": "0.011", "ReturnOnEquityTTM": "0.1012", "RevenueTTM": "259096000", "GrossProfitTTM": "281521000", "DilutedEPSTTM": "3.219", "QuarterlyEarningsGrowthYOY": "-0.178", "QuarterlyRevenueGrowthYOY": "-0.21", "AnalystTargetPrice": "36.4", "TrailingPE": "9.4861", "ForwardPE": "10.142", "PriceToSalesRatioTTM": "2.6696", "PriceToBookRatio": "0.9251", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.25", "52WeekHigh": "48.81", "52WeekLow": "23.65", "50DayMovingAverage": "30.3331", "200DayMovingAverage": "30.9346", "SharesOutstanding": "26206000", "SharesFloat": "25320280", "SharesShort": "399215", "SharesShortPriorMonth": "288293", "ShortRatio": "3.34", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0128", "PercentInsiders": "5.444", "PercentInstitutions": "74.631", "ForwardAnnualDividendRate": "0.72", "ForwardAnnualDividendYield": "0.0235", "PayoutRatio": "0.2136", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-14", "LastSplitFactor": "None", "LastSplitDate": "None"}