{"Symbol": "EIGI", "AssetType": "Common Stock", "Name": "Endurance International Group Holdings, Inc", "Description": "Endurance International Group Holdings, Inc., together with its subsidiaries, provides cloud-based platform solutions for small-and medium-sized businesses in the United States and internationally. The company operates in three segments: Web Presence, Domain, and Email Marketing. It offers Web hosting services, including entry-level shared hosting, and virtual private server and dedicated hosting solutions; Website building tools; domain registration, management, and resale services; malware protection solutions to protect subscribers' Websites from viruses, malicious code, and other threats; and backup control solutions that enable subscribers to schedule, maintain, manage, and restore backups of their online data and Websites. The company also provides email marketing solutions that enable subscribers to communicate with their customers and potential customers through email; products that enables subscribers to sell their products and services online, including secure and encrypted payments, shopping carts, inventory management, online marketplace listing solutions, payment processing and related services, and mobile payments; and search engine optimization and marketing solutions. In addition, it offers solutions that allow subscribers to have their Websites and email marketing campaigns rendered on mobile devices; tools and services that enable subscribers to communicate with their customers and potential customers through social networks; business productivity tools that include professional email, word processing and presentation software, online storage, shared calendars, and video meetings; control panels and dashboards that offer subscribers with tools to analyze activity on their Websites; and professional services, including Website design, marketing, social media management, and Website migration services. The company was founded in 1997 and is headquartered in Burlington, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "10 Corporate Drive, Burlington, MA, United States, 01803", "FullTimeEmployees": "3600", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "909160960", "EBITDA": "278519008", "PERatio": "43.9286", "PEGRatio": "-0.6", "BookValue": "1.459", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.136", "RevenuePerShareTTM": "7.595", "ProfitMargin": "0.0179", "OperatingMarginTTM": "0.139", "ReturnOnAssetsTTM": "0.0365", "ReturnOnEquityTTM": "0.1074", "RevenueTTM": "1100572032", "GrossProfitTTM": "629613000", "DilutedEPSTTM": "0.136", "QuarterlyEarningsGrowthYOY": "-0.333", "QuarterlyRevenueGrowthYOY": "-0.015", "AnalystTargetPrice": "6.13", "TrailingPE": "43.9286", "ForwardPE": "91.7431", "PriceToSalesRatioTTM": "0.8155", "PriceToBookRatio": "4.2238", "EVToRevenue": "2.2433", "EVToEBITDA": "8.5406", "Beta": "2.228", "52WeekHigh": "6.62", "52WeekLow": "1.31", "50DayMovingAverage": "5.8819", "200DayMovingAverage": "3.7909", "SharesOutstanding": "140736992", "SharesFloat": "73887173", "SharesShort": "1940710", "SharesShortPriorMonth": "1746297", "ShortRatio": "1.71", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0328", "PercentInsiders": "6.062", "PercentInstitutions": "92.272", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}