{"Symbol": "ELSE", "AssetType": "Common Stock", "Name": "Electro-Sensors, Inc", "Description": "Electro-Sensors, Inc. manufactures and sells industrial production monitoring and process control systems. The company manufactures and sells various monitoring systems that measure machine production and operation rates, as well as systems, which regulate the speed of related machines in production processes. Its speed monitoring systems include a line of products that measure production counts or rates, such as parts, gallons, or board feet; and alarm systems, tachometers, and other devices that translate impulses from the sensors into alarm signals, computer inputs, or digital displays. The company's temperature application products consist of bearing, gear box, and motor temperature monitoring sensors. It also offers production monitoring devices that include a belt alignment and slide gate position monitors; vibration monitoring products; and tilt switches. In addition, the company provides hazard monitoring systems, such as Electro-Sentry, which integrates its sensors for monitoring temperature, belt alignment, and shaft speed; and HazardPRO, a wireless hazard technology monitoring system, as well as HazardPRO software. It serves customers in various industries, including grain/feed/milling, bulk material, manufacturing, food product, ethanol, power generation, and other processing industries. The company sells its products through internal sales team, manufacturer's representatives, and distributors in the United States, Canada, Mexico, Bolivia, Chile, Colombia, Guatemala, Peru, the United Kingdom, Ukraine, Egypt, Saudi Arabia, India, Indonesia, Australia, New Zealand, China, Taiwan, Korea, Vietnam, Malaysia, the Philippines, and Singapore. Electro-Sensors, Inc. was founded in 1968 and is based in Minnetonka, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "6111 Blue Circle Drive, Minnetonka, MN, United States, 55343-9108", "FullTimeEmployees": "40", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "12597379", "EBITDA": "192000", "PERatio": "185.5", "PEGRatio": "0", "BookValue": "3.776", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.012", "RevenuePerShareTTM": "2.358", "ProfitMargin": "0.0053", "OperatingMarginTTM": "-0.0194", "ReturnOnAssetsTTM": "-0.0071", "ReturnOnEquityTTM": "0.0033", "RevenueTTM": "8005000", "GrossProfitTTM": "4366000", "DilutedEPSTTM": "0.012", "QuarterlyEarningsGrowthYOY": "-0.823", "QuarterlyRevenueGrowthYOY": "-0.074", "AnalystTargetPrice": "None", "TrailingPE": "185.5", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.5749", "PriceToBookRatio": "0.9825", "EVToRevenue": "0.4455", "EVToEBITDA": "10.1031", "Beta": "0.4846", "52WeekHigh": "4.26", "52WeekLow": "2.69", "50DayMovingAverage": "3.6922", "200DayMovingAverage": "3.4458", "SharesOutstanding": "3395520", "SharesFloat": "2230246", "SharesShort": "618", "SharesShortPriorMonth": "1160", "ShortRatio": "0.03", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0001", "PercentInsiders": "34.17", "PercentInstitutions": "5.849", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2013-05-24", "ExDividendDate": "2013-05-08", "LastSplitFactor": "3:2", "LastSplitDate": "2001-02-27"}