{"Symbol": "EML", "AssetType": "Common Stock", "Name": "The Eastern Company", "Description": "The Eastern Company designs, manufactures, and sells various engineered solutions for various industrial markets in the United States and internationally. The company operates through three segments: Industrial Hardware, Security Products, and Metal Products. The Industrial Hardware segment designs, manufactures, and markets custom and standard vehicular and industrial hardware, including turnkey returnable packaging solutions; passenger restraint and vehicular locks, latches, and hinges; mirrors and mirror-cameras; light-weight sleeper boxes; and truck bodies. It also designs and manufactures fasteners and other closure devices to secure access doors on various type of industrial equipment, such as metal cabinets, machinery housings, and electronic instruments. This segment sells its products directly to original equipment manufacturers (OEM's) and distributors through in-house sales personnel and outside sales representatives. The Security Products segment designs and manufactures engineered security and access solutions in the form of mechanical, electronic, and wireless products for OEM's contract equipment manufacturers and industrial distributors; designs, manufactures, and markets timers, drop meters, coin chutes, money boxes, meter cases, mobile payment apps, smart cards, value transfer stations, smart card readers, card management software, and access control units that are used primarily in the commercial laundry market; and supplies printed circuit boards and other electronic assemblies to OEMs in various industries. The Metal Products segment designs and manufactures ductile and malleable iron castings, such as valves, rings, torque screws, bean clamps, and concrete anchors for a range of industrial markets, including oil, water, gas; and truck/automotive rail, and military/aerospace, as well as offers expansion shells to support the roofs of underground mines. The Eastern Company was founded in 1858 and is based in Naugatuck, Connecticut.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Tools & Accessories", "Address": "112 Bridge Street, Naugatuck, CT, United States, 06770", "FullTimeEmployees": "1399", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "139410368", "EBITDA": "28520694", "PERatio": "13.1779", "PEGRatio": "0", "BookValue": "16.477", "DividendPerShare": "0.44", "DividendYield": "0.0205", "EPS": "1.631", "RevenuePerShareTTM": "39.06", "ProfitMargin": "0.0418", "OperatingMarginTTM": "0.0838", "ReturnOnAssetsTTM": "0.0558", "ReturnOnEquityTTM": "0.1002", "RevenueTTM": "243578560", "GrossProfitTTM": "61852549", "DilutedEPSTTM": "1.631", "QuarterlyEarningsGrowthYOY": "0.84", "QuarterlyRevenueGrowthYOY": "-0.205", "AnalystTargetPrice": "None", "TrailingPE": "13.1779", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5517", "PriceToBookRatio": "1.3036", "EVToRevenue": "0.9094", "EVToEBITDA": "9.6036", "Beta": "0.9099", "52WeekHigh": "31.87", "52WeekLow": "15.5", "50DayMovingAverage": "18.5333", "200DayMovingAverage": "19.841", "SharesOutstanding": "6237600", "SharesFloat": "5375809", "SharesShort": "38163", "SharesShortPriorMonth": "27650", "ShortRatio": "3.95", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0117", "PercentInsiders": "5.103", "PercentInstitutions": "66.591", "ForwardAnnualDividendRate": "0.44", "ForwardAnnualDividendYield": "0.0205", "PayoutRatio": "0.2699", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-13", "LastSplitFactor": "3:2", "LastSplitDate": "2006-10-18"}