{"Symbol": "ENFC", "AssetType": "Common Stock", "Name": "Entegra Financial Corp", "Description": "As of January 1, 2020, Entegra Financial Corp. was acquired by First-Citizens Bank & Trust Company. Entegra Financial Corp. operates as the bank holding company for Entegra Bank that provides various retail and commercial banking products and services in the United States. The company offers deposit accounts, including savings accounts, certificates of deposit, money market accounts, commercial and regular checking accounts, and individual retirement accounts. It also provides commercial real estate loans, one-to-four family residential mortgage loans, home equity loans and lines of credits, and commercial loans, as well as one-to four-family residential construction, other construction and land, and consumer loans. In addition, the company invests in securities; provides wealth management services through a third party; and originates loans for sale in the secondary markets. As of December 31, 2018, it operated a network of 18 branches and 2 loan production offices in the Western North Carolina counties of Buncombe, Cherokee, Haywood, Henderson, Jackson, Macon, Polk, and Transylvania; the Upstate South Carolina counties of Anderson, Greenville, Pickens, and Spartanburg; and the northern Georgia counties of Gwinnett, Hall, and Pickens. The company also facilitates the issuance of trust preferred securities. It serves individuals and small- to mid-sized businesses. The company was formerly known as Macon Financial Corp. and changed its name to Entegra Financial Corp. in 2014. Entegra Financial Corp. was founded in 1922 and is headquartered in Franklin, North Carolina.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "14 One Center Court, Franklin, NC, United States, 28734", "FullTimeEmployees": "269", "FiscalYearEnd": "December", "LatestQuarter": "0000-00-00", "MarketCapitalization": "208934000", "EBITDA": "None", "PERatio": "15.3878", "PEGRatio": "0", "BookValue": "26.421", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.96", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "54114000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "24", "TrailingPE": "15.3878", "ForwardPE": "0", "PriceToSalesRatioTTM": "3.8632", "PriceToBookRatio": "1.1419", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "30.16", "200DayMovingAverage": "30.0651", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}