{"Symbol": "ENZY", "AssetType": "Common Stock", "Name": "Enzymotec Ltd", "Description": "Enzymotec Ltd., together with its subsidiaries, develops, manufactures, and markets bio-functional lipid ingredients and final products in North America, the European Union, Australia, New Zealand, Asia, and Israel. It operates through two segments, Nutrition and VAYA Pharma. The Nutrition segment develops and manufactures nutritional ingredient products based on lipids, such as phospholipids, which form the structural basis of cell membranes. Its products include InFat, a lipid ingredient for infant formula that resembles the composition and properties of human breast milk fat; Soy-PS product, a lipid ingredient used to improve cognitive and mental performance; and Krill Oil, an omega-3 bound to phospholipids. This segment also offers phosphatidylserine (PS) products, including Sharp PS, a nutritional supplement for adults to improve cognitive capabilities; and Sharp PS SILVER, a blend of PS and omega-3 to improve mental and cognitive abilities. In addition, it provides Sharp PS GOLD, a compound nutrient for improving memory in elderly persons; and Sharp PS GREEN, a soy-free PS food supplement. Further, this segment offers glycerylphosphorylcholine (GPC) products, such as Sharp GPC for improving cognitive functions for different age populations; and Sharp GPC ACTIVE, an alpha-GPC-based complex. The VAYA Pharma segment discovers, develops, manufactures, and markets lipid-based medical foods for the cardiovascular and neurological markets, as well as for the pharmaceutical drug markets. This segment's products include Vayarin, a medical food for the clinical dietary management of lipid imbalances associated with attention deficit-hyperactivity disorder; Vayacog, a medical food for the clinical dietary management of lipid imbalances associated with early memory impairment; and Vayarol, a medical food for the clinical dietary management of hypertriglyceridemia. The company was founded in 1998 and is headquartered in Migdal Haemeq, Israel. As of January 11, 2018, Enzymotec Ltd. operates as a subsidiary of Frutarom Lt", "Exchange": "NASDAQ", "Currency": "ILS", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "Sagi 2000 Industrial Area, PO Box 6\n2310001,Migdal Haemeq,ISR\n", "FullTimeEmployees": "205", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "277623008", "EBITDA": "-3749000", "PERatio": "None", "PEGRatio": "4.29", "BookValue": "5.992", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-0.3", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "8.67", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}