{"Symbol": "EPAY", "AssetType": "Common Stock", "Name": "Bottomline Technologies (de), Inc", "Description": "Bottomline Technologies (de), Inc. provides various solutions for the banking, financial services, insurance, healthcare, technology, retail, communications, education, media, manufacturing, and government industries. It operates through four segments: Cloud Solutions, Banking Solutions, Payments and Transactional Documents, and Other. The company's products and services include Paymode-X, an integrated payment solution, which allows businesses to transition from manual accounts payable payments processes to an integrated solution; and financial messaging solutions for risk management to banks and corporations. It also provides Digital Banking Intelligent Engagement platform that enables banks to engage with customers; legal spend management solutions and services, which integrate with claims management, and time and billing systems to automate legal invoice management processes, as well as provide insight into various areas of a company's outside legal spend. In addition, the company offers cyber fraud and risk management solutions to monitor, replay, and analyse user behaviour and payment transactions to flag and stop suspicious activity in real time; payment automation solutions that generate various domestic and international payment instructions along with consolidated bank reporting of cash activity; and various solutions for healthcare industry to address patient registration, electronic signature, mobile document, payments, and cybersecurity. Further, it provides consulting, project implementation, and training services. The company serves customers in the United States, the United Kingdom, Continental Europe, the Asia-Pacific, and the Middle East. Bottomline Technologies (de), Inc. was founded in 1989 and is headquartered in Portsmouth, New Hampshire.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "325 Corporate Drive, Portsmouth, NH, United States, 03801", "FullTimeEmployees": "0", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2097829248", "EBITDA": "43355988", "PERatio": "298.8462", "PEGRatio": "1.56", "BookValue": "9.324", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.217", "RevenuePerShareTTM": "10.587", "ProfitMargin": "-0.0209", "OperatingMarginTTM": "-0.0078", "ReturnOnAssetsTTM": "-0.0029", "ReturnOnEquityTTM": "-0.0239", "RevenueTTM": "442220992", "GrossProfitTTM": "253135000", "DilutedEPSTTM": "-0.221", "QuarterlyEarningsGrowthYOY": "-0.571", "QuarterlyRevenueGrowthYOY": "0.022", "AnalystTargetPrice": "56.43", "TrailingPE": "298.8462", "ForwardPE": "38.3142", "PriceToSalesRatioTTM": "4.566", "PriceToBookRatio": "5.412", "EVToRevenue": "4.7916", "EVToEBITDA": "125.0995", "Beta": "1.2456", "52WeekHigh": "57.22", "52WeekLow": "27.82", "50DayMovingAverage": "49.6272", "200DayMovingAverage": "45.0219", "SharesOutstanding": "43924400", "SharesFloat": "40951572", "SharesShort": "1152595", "SharesShortPriorMonth": "1051913", "ShortRatio": "5.71", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0383", "PercentInsiders": "2.449", "PercentInstitutions": "94.118", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}