{"Symbol": "EPZM", "AssetType": "Common Stock", "Name": "Epizyme, Inc", "Description": "Epizyme, Inc., a late-stage biopharmaceutical company, discovers, develops, and commercializes novel epigenetic medicines for patients with cancer and other diseases primarily in the United States. The company's lead products candidate is tazemetostat, an inhibitor of the EZH2 histone methyltransferase, which is in the Phase II clinical trial for patients with relapsed or refractory non-hodgkin lymphoma (NHL); Phase II clinical trial for relapsed or refractory patients with mesothelioma characterized by BAP1 loss-of-function; and Phase II clinical trial for adults and Phase I clinical trial for children with epithelioid sarcoma and other INI1-negative solid tumors. It also develops tazemetostat in combination with R-CHOP that is in the Phase Ib/II clinical trials in elderly patients with DLBCL; and tazemetostat in combination with PD-L1 inhibitor, which is in the Phase Ib/II clinical trials for the treatment of patients with relapsed or refractory metastatic non-small cell lung cancer. In addition, the company is developing EZM8266, a G9a inhibitor that is in the Phase 1 study for the treatment of sickle cell disease; pinometostat, which is in the preclinical studies stage for the treatment of acute myeloid leukemia and acute lymphoblastic leukemia; PRMT5 inhibitor that is in Phase II clinical trial for patients with solid tumors and NHL; and PRMT1 inhibitor, which is in the Phase 1 clinical trial. Epizyme, Inc. has collaboration agreements with Celgene Corporation; Genentech Inc.; Glaxo Group Limited; Boehringer Ingelheim International GmbH; Roche Molecular Systems, Inc.; Lymphoma Study Association; and Eisai Co. Ltd. The company was founded in 2007 and is headquartered in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "400 Technology Square, Cambridge, MA, United States, 02139", "FullTimeEmployees": "203", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1275578368", "EBITDA": "-143672992", "PERatio": "None", "PEGRatio": "0", "BookValue": "2.535", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.862", "RevenuePerShareTTM": "0.136", "ProfitMargin": "0", "OperatingMarginTTM": "-14.7756", "ReturnOnAssetsTTM": "-0.3198", "ReturnOnEquityTTM": "-0.6522", "RevenueTTM": "13831000", "GrossProfitTTM": "-108839000", "DilutedEPSTTM": "-1.997", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.582", "AnalystTargetPrice": "28.38", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "89.7478", "PriceToBookRatio": "4.8286", "EVToRevenue": "75.6407", "EVToEBITDA": "0", "Beta": "1.9978", "52WeekHigh": "27.82", "52WeekLow": "9.735", "50DayMovingAverage": "13.5136", "200DayMovingAverage": "16.9712", "SharesOutstanding": "101478000", "SharesFloat": "83494289", "SharesShort": "11041686", "SharesShortPriorMonth": "7989788", "ShortRatio": "9.62", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1305", "PercentInsiders": "4.04", "PercentInstitutions": "100.971", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}