{"Symbol": "ESIO", "AssetType": "Common Stock", "Name": "Electro Scientific Industries, Inc", "Description": "Electro Scientific Industries, Inc., together with its subsidiaries, supplies laser-based microfabrication solutions for the microtechnology industry worldwide. The company provides printed circuit board laser drilling products, including laser via drilling systems for electrical interconnect applications that require dimensions to create electrical connections between layers in flexible circuits, high-density circuit boards, and interconnect packages; micro via drilling technology that addresses the changing applications in interconnect packages, multichip modules, and high density interconnect circuit boards; and ultraviolet laser processing systems that employ technology in lasers, optics, and motion control. It also offers semiconductor manufacturing products comprising wafer marking equipment for use in serialization and wafer identification; wafer and circuit trim tools that adjust the electrical performance of semiconductor devices or hybrid circuits; and memory yield improvement systems and related laser upgrades. In addition, the company provides component test products that combine high-speed small parts handling technology with real-time control systems to provide inspection solutions for manufacturers of multilayer ceramic capacitors and other passive components, such as capacitor arrays, inductors, resistors, varistors, and hybrid circuits. Further, it offers industrial machining products, such as platforms for precision drilling, scribing, cutting, etching, routing, and marking various materials and devices; and laser systems to manufacturers of end devices for drilling, marking, and cutting. The company sells its products through direct sales and service offices, value-added resellers, and independent representatives. Electro Scientific Industries, Inc. was founded in 1944 and is headquartered in Portland, Oregon.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "13900 NW Science Park Drive\n97229,Portland,USA\n", "FullTimeEmployees": "615", "FiscalYearEnd": "March", "LatestQuarter": "None", "MarketCapitalization": "1032327744", "EBITDA": "None", "PERatio": "8.3514", "PEGRatio": "1.72", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "30.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}