{"Symbol": "ESRX", "AssetType": "Common Stock", "Name": "Express Scripts Holding Company", "Description": "Express Scripts Holding Company operates as a pharmacy benefit management (PBM) company in the United States and Canada. The company's PBM segment offers clinical solutions; and specialized pharmacy care, home delivery and specialty pharmacy, retail network pharmacy administration, benefit design consultation, drug utilization review, drug formulary management, public exchange, administration of group purchasing organization, and digital consumer health and drug information services. This segment also provides Medicare, Medicaid, and health insurance marketplace products; Express Scripts SafeGuardRx, a suite of solutions targeting the therapy classes that pose clinical challenges and budgetary threat to its clients; and Inside Rx, a program that provide affordable access to medication for uninsured and underinsured individuals. Its Other Business Operations segment distributes specialty pharmaceuticals and medical supplies, including injectable and infusible pharmaceuticals and medications to treat specialty and rare/orphan diseases. This segment also provides medical benefit management solutions for radiology, cardiology, musculoskeletal disorders, sleep disorders, post-acute care, genetic lab, specialty pharmacy, and medical oncology. The company serves managed care organizations, health insurers, third-party administrators, employers, union-sponsored benefit plans, workers' compensation plans, government health programs, providers, clinics, hospitals, and others. As of December 31, 2017, it operated 4 automated dispensing home delivery pharmacies; 1 non-automated dispensing home delivery pharmacy; 7 non-dispensing order processing centers; 5 patient contact centers; 9 specialty home delivery pharmacies; and 34 specialty branch pharmacies. The company was formerly known as Aristotle Holding, Inc. and changed its name to Express Scripts Holding Company in April 2012. Express Scripts Holding Company was founded in 1986 and is headquartered in Saint Louis, Missouri.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "One Express Way\n63121,Saint Louis,USA\n", "FullTimeEmployees": "26600", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "52037189632", "EBITDA": "7318300160", "PERatio": "10.6876", "PEGRatio": "0.68", "BookValue": "36.49", "DividendPerShare": "None", "DividendYield": "None", "EPS": "5.76", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "92.56", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}