{"Symbol": "EVOL", "AssetType": "Common Stock", "Name": "Evolving Systems, Inc", "Description": "Evolving Systems, Inc. provides real-time digital engagement solutions and services to the wireless, wireline, and cable network operators in the United Kingdom and internationally. The company offers acquisition and activation solutions, including Smart Dealer, a tool set that enables SIM retailers to sell SIM cards; and Dynamic SIM Allocation, a SIM/eSIM activation solution. Its acquisition and activation solutions also comprise Tertio Service Activation solution used to activate a new subscriber or to add a new service to an existing subscriber; and Number Inventory and Management solution, an automated solution that enables operators to manage their telephone numbers and other communication identifiers. In addition, the company offers customer analytics and value management solutions, such as the Profiling Engine, a rules-driven flexible aggregator, which supports static and ongoing dynamic profiling of subscribers; Campaign Engine that is used to configure and deliver marketing campaigns, and offers to subscribers; and Campaign Module, which provides predefined templates for specific types of real-time mobile marketing tactics. Further, it provides Social Media Integration solution, which enables carriers to expand their engagement with subscribers; and App Promotion solution. Additionally, the company offers Customer Retention and Loyalty solutions; Mobile Data Enablement solution that provides a data consumption and policy management solution for wireless carriers and mobile virtual network operators that monitor the usage and consumption of data services; and Total Number Management solution, an automated database solution that enables operators to manage their telephone numbers, and other communication identifiers. It also provides marketing, IT, and managed services; and customer value management and engagement solutions. The company was founded in 1985 and is headquartered in Englewood, Colorado.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "9800 Pyramid Court, Englewood, CO, United States, 80112", "FullTimeEmployees": "261", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "13170601", "EBITDA": "1019000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.696", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.939", "RevenuePerShareTTM": "2.088", "ProfitMargin": "-0.066", "OperatingMarginTTM": "-0.0046", "ReturnOnAssetsTTM": "-0.0032", "ReturnOnEquityTTM": "-0.1766", "RevenueTTM": "25411000", "GrossProfitTTM": "17065000", "DilutedEPSTTM": "-0.14", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.012", "AnalystTargetPrice": "7", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5269", "PriceToBookRatio": "1.5813", "EVToRevenue": "0.4443", "EVToEBITDA": "7.7919", "Beta": "1.1225", "52WeekHigh": "1.44", "52WeekLow": "0.561", "50DayMovingAverage": "1.1774", "200DayMovingAverage": "0.9901", "SharesOutstanding": "12195000", "SharesFloat": "7964170", "SharesShort": "9783", "SharesShortPriorMonth": "9500", "ShortRatio": "0.51", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0058", "PercentInsiders": "29.939", "PercentInstitutions": "22.642", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2016-07-01", "ExDividendDate": "2016-06-01", "LastSplitFactor": "1:2", "LastSplitDate": "2009-07-21"}