{"Symbol": "EXAC", "AssetType": "Common Stock", "Name": "Exactech, Inc", "Description": "Exactech, Inc. develops, manufactures, markets, distributes, and sells orthopedic implant devices, related surgical instrumentation, and biologic services. It offers extremities products comprising Equinoxe, a platform shoulder system for the treatment of degenerative disease and trauma; and knee system that provides solutions for partial, primary, and revision total knee arthroplasty. The company also provides hip solutions that address hip arthroplasty, reconstruction, and fractures, as well as primary hip surgeries. In addition, it offers biologics and spine products for the healing and regeneration of bone and soft tissues; and markets a platform of demineralized bone matrix products under the brand name Optecure, as well as OpteMx, a tri-calcium phosphate/hydroxyapatite based synthetic bone graft substitutes. Further, the company provides Accelerate, a platelet concentrating system that offers high platelet yields through centrifugal action; distribute Ossigen, a 3D matrix of collagen and an organic bone mineral processed into blocks for surgical implantation for the repair of bony defects in the spine, extremities, and pelvis; and Ossilix, a calcium phosphate bone cement indicated for filling bony defects in cancellous bone. Additionally, it offers Cemex Genta, a bone cement containing antibiotics; Cemex Fast, a cement with or without antibiotic; the InterSpace hip, knee, and shoulder spacers; and AcuDriver Automated Osteotome System, an air-driven impact handpiece that surgeons use during joint implant revision procedures to remove failed prostheses and bone cement. The company markets its orthopedic implant products through a network of independent sales agencies and distributors, direct sales representatives, and subsidiaries to hospitals, surgeons and other physicians, and clinics in the United States and internationally. Exactech, Inc. was founded in 1985 and is headquartered in Gainesville, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "2320 NW 66th Court\n32653,Gainesville,USA\n", "FullTimeEmployees": "733", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "710377088", "EBITDA": "43176000", "PERatio": "1894.2307", "PEGRatio": "3.18", "BookValue": "17.424", "DividendPerShare": "None", "DividendYield": "None", "EPS": "0.05", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "37", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}