{"Symbol": "EXEL", "AssetType": "Common Stock", "Name": "Exelixis, Inc", "Description": "Exelixis, Inc., an oncology-focused biotechnology company, focuses on the discovery, development, and commercialization of new medicines to treat cancers in the United States. The company's products include CABOMETYX tablets for the treatment of patients with advanced renal cell carcinoma who received prior anti-angiogenic therapy; and COMETRIQ capsules for the treatment of patients with progressive and metastatic medullary thyroid cancer. Its CABOMETYX and COMETRIQ are derived from cabozantinib, an inhibitor of multiple tyrosine kinases, including MET, AXL, RET, and VEGF receptors. The company also offers COTELLIC, an inhibitor of MEK as a combination regimen to treat advanced melanoma; and MINNEBRO, an oral non-steroidal selective blocker of the mineralocorticoid receptor for the treatment of hypertension in Japan. In addition, Exelixis, Inc. is developing XL092, an oral tyrosine kinase inhibitor that targets VEGF receptors, MET, and other kinases implicated in growth and spread of cancer. It has collaboration and license agreement with Ipsen Pharma SAS, Takeda Pharmaceutical Company Ltd., Roche, Aurigene Discovery Technologies Limited, Iconic Therapeutics, Inc., Invenra, Inc., StemSynergy Therapeutics, Inc., Genentech, Inc., GlaxoSmithKline, Bristol-Myers Squibb Company, Merck, Daiichi Sankyo Company, Limited, and clinical collaboration with Ipsen. The company was formerly known as Exelixis Pharmaceuticals, Inc. and changed its name to Exelixis, Inc. in February 2000. Exelixis, Inc. was founded in 1994 and is headquartered in Alameda, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "1851 Harbor Bay Parkway, Alameda, CA, United States, 94502", "FullTimeEmployees": "617", "FiscalYearEnd": "January", "LatestQuarter": "2020-07-31", "MarketCapitalization": "6683582976", "EBITDA": "332191008", "PERatio": "24.4607", "PEGRatio": "1.5808", "BookValue": "5.935", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.889", "RevenuePerShareTTM": "3.271", "ProfitMargin": "0.2821", "OperatingMarginTTM": "0.324", "ReturnOnAssetsTTM": "0.1096", "ReturnOnEquityTTM": "0.1696", "RevenueTTM": "998406976", "GrossProfitTTM": "935978000", "DilutedEPSTTM": "0.889", "QuarterlyEarningsGrowthYOY": "-0.16", "QuarterlyRevenueGrowthYOY": "0.08", "AnalystTargetPrice": "30", "TrailingPE": "24.4607", "ForwardPE": "53.1915", "PriceToSalesRatioTTM": "6.8927", "PriceToBookRatio": "3.6692", "EVToRevenue": "5.6803", "EVToEBITDA": "14.8355", "Beta": "1.4143", "52WeekHigh": "27.8", "52WeekLow": "13.67", "50DayMovingAverage": "23.2167", "200DayMovingAverage": "21.9334", "SharesOutstanding": "308996000", "SharesFloat": "275627361", "SharesShort": "13426653", "SharesShortPriorMonth": "16214510", "ShortRatio": "5.46", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0397", "PercentInsiders": "3.02", "PercentInstitutions": "78.895", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}