{"Symbol": "EXFO", "AssetType": "Common Stock", "Name": "EXFO Inc", "Description": "EXFO Inc. provides test, monitoring and analytics solutions for fixed and mobile communications service providers, web-scale operators, and network equipment. It offers field network testing products, such as copper/DSL testing, dispersion analysis, fiber inspection, light sources, live fiber detection, network protocol testing, optical fiber multimeter, optical loss testing, optical time domain reflectometry and iOLM, power meters, spectral testing, test function virtualization, and test reporting and automation products, as well as modular test platforms. The company also provides lab and manufacturing testing network protocol testing products, network simulation and load testing products, optical benchtop kits, optical communication analyzers, optical light sources, optical power meters, optical spectrum analyzers, switch and utility modules, test platforms, variable attenuators, tunable filters, optical component testers, and tunable sources; and service assurance products, such as fiber monitoring, network probe, network topology management, monitoring and troubleshooting, RAN optimization, and real-time analytics. In addition, it offers mobile portfolio that consists of network simulators and optical radio frequency test solutions for turning up and troubleshooting fiber-based mobile networks; PC-centric and open-ended platforms with cloud-based software applications; and Internet protocol assurance services, as well as monitoring services for 2G, 3G, 4G/LTE, and 5G mobile networks. The company sells products through its direct sales force, sales representatives, and distributors in the Americas, Europe, the Middle-East, Africa, and the Asia-Pacific. EXFO Inc. was founded in 1985 and is headquartered in Qubec City, Canada.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "400 Godin Avenue, Quebec City, QC, Canada, G1M 2K2", "FullTimeEmployees": "1810", "FiscalYearEnd": "August", "LatestQuarter": "2020-05-31", "MarketCapitalization": "206977696", "EBITDA": "13595000", "PERatio": "36.2114", "PEGRatio": "3.08", "BookValue": "2.926", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.089", "RevenuePerShareTTM": "4.776", "ProfitMargin": "-0.0231", "OperatingMarginTTM": "0.0101", "ReturnOnAssetsTTM": "0.0059", "ReturnOnEquityTTM": "-0.0369", "RevenueTTM": "265186000", "GrossProfitTTM": "168517000", "DilutedEPSTTM": "-0.11", "QuarterlyEarningsGrowthYOY": "152.387", "QuarterlyRevenueGrowthYOY": "-0.101", "AnalystTargetPrice": "4.13", "TrailingPE": "36.2114", "ForwardPE": "14.3266", "PriceToSalesRatioTTM": "0.7824", "PriceToBookRatio": "1.2817", "EVToRevenue": "0.8877", "EVToEBITDA": "13.9122", "Beta": "1.3903", "52WeekHigh": "4.95", "52WeekLow": "2", "50DayMovingAverage": "3.8669", "200DayMovingAverage": "3.1136", "SharesOutstanding": "24053400", "SharesFloat": "19463104", "SharesShort": "9945", "SharesShortPriorMonth": "6273", "ShortRatio": "0.35", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0006", "PercentInsiders": "18.543", "PercentInstitutions": "25.3", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}