{"Symbol": "EXPO", "AssetType": "Common Stock", "Name": "Exponent, Inc", "Description": "Exponent, Inc., together with its subsidiaries, operates as a science and engineering consulting company worldwide. Its services include analysis of product development, product recall, regulatory compliance, and the discovery of potential problems related to products, people, property, and impending litigation. The company operates in two segments, Engineering and Other Scientific, and Environmental and Health. The Engineering and Other Scientific segment provides services in the areas of biomechanics, biomedical engineering, buildings and structures, civil engineering, construction consulting, electrical engineering and computer science, human factors, industrial structures, materials and corrosion engineering, mechanical engineering, polymer science and materials chemistry, statistical and data sciences, thermal sciences, and vehicle analysis. The Environmental and Health segment offers services in the areas of chemical regulation and food safety, ecological and biological sciences, environmental and earth sciences, and health sciences. The company offers approximately 90 different technical disciplines to solve complicated issues facing industry and government. It serves clients in chemical, construction, consumer products, energy, food, beverage and nutrition, government, life sciences, insurance, manufacturing, technology, industrial equipment, transportation, and other sectors of the economy. The company was formerly known as The Failure Group, Inc. and changed its name to Exponent, Inc. in 1998. Exponent, Inc. was founded in 1967 and is headquartered in Menlo Park, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Consulting Services", "Address": "149 Commonwealth Drive, Menlo Park, CA, United States, 94025", "FullTimeEmployees": "1201", "FiscalYearEnd": "January", "LatestQuarter": "2020-07-31", "MarketCapitalization": "4251104512", "EBITDA": "96703000", "PERatio": "54.2895", "PEGRatio": "3.14", "BookValue": "6.442", "DividendPerShare": "0.76", "DividendYield": "0.0092", "EPS": "1.52", "RevenuePerShareTTM": "7.328", "ProfitMargin": "0.2112", "OperatingMarginTTM": "0.2327", "ReturnOnAssetsTTM": "0.1084", "ReturnOnEquityTTM": "0.2406", "RevenueTTM": "385308992", "GrossProfitTTM": "139193000", "DilutedEPSTTM": "1.52", "QuarterlyEarningsGrowthYOY": "-0.205", "QuarterlyRevenueGrowthYOY": "-0.124", "AnalystTargetPrice": "88.5", "TrailingPE": "54.2895", "ForwardPE": "51.0204", "PriceToSalesRatioTTM": "10.8093", "PriceToBookRatio": "12.8091", "EVToRevenue": "9.9849", "EVToEBITDA": "42.2988", "Beta": "0.2709", "52WeekHigh": "84.62", "52WeekLow": "58.03", "50DayMovingAverage": "81.7833", "200DayMovingAverage": "75.0706", "SharesOutstanding": "51622400", "SharesFloat": "50972984", "SharesShort": "977182", "SharesShortPriorMonth": "862738", "ShortRatio": "4", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0212", "PercentInsiders": "1.221", "PercentInstitutions": "90.339", "ForwardAnnualDividendRate": "0.76", "ForwardAnnualDividendYield": "0.0092", "PayoutRatio": "0.4605", "DividendDate": "2020-09-25", "ExDividendDate": "2020-09-10", "LastSplitFactor": "2:1", "LastSplitDate": "2018-06-08"}