{"Symbol": "EXTR", "AssetType": "Common Stock", "Name": "Extreme Networks, Inc", "Description": "Extreme Networks, Inc. provides software-driven networking solutions for enterprise, data center, and service provider customers worldwide. It designs, develops, and manufactures wired and wireless network infrastructure equipment; and develops the software for network management, policy, analytics, security, and access controls. The company offers edge/access switch portfolio that delivers Ethernet connectivity for the edge of the network; aggregation/core switches designed to address aggregation, top-of-rack, and campus core environments; and wireless access point products. It also provides VDX, MLX, and SLX data center family of switches; ExtremeControl, a network access control solution that allows the enterprises to unify the security of their wired and wireless networks with visibility and control over users, devices, and applications; and ExtremeAnalytics, a network-powered application analytics and optimization solution, which captures, aggregates, analyses, correlates, and reports network data that enables in decision making and enhancing business performance. In addition, the company offers ExtremeGuest and ExtremeLocation, which are cloud services that enable enterprises to incorporate location-based services; and ExtremeCloud, a wired and wireless cloud network management solution, which offers visibility and control over users and applications. It markets and sells its products through distributors, resellers, and field sales organizations. The company serves enterprises and organizations in the education, healthcare, manufacturing, hospitality, transportation, and logistics sectors, as well as government agencies, private cloud data centers, universities, and stadiums; and enterprises and private cloud data centers. Extreme Networks, Inc. was founded in 1996 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "6480 Via del Oro, San Jose, CA, United States, 95119", "FullTimeEmployees": "0", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "542326528", "EBITDA": "28478000", "PERatio": "None", "PEGRatio": "0.88", "BookValue": "0.045", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.22", "RevenuePerShareTTM": "7.912", "ProfitMargin": "-0.1338", "OperatingMarginTTM": "-0.0373", "ReturnOnAssetsTTM": "-0.0255", "ReturnOnEquityTTM": "-2.09", "RevenueTTM": "948019008", "GrossProfitTTM": "527311000", "DilutedEPSTTM": "-1.059", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.146", "AnalystTargetPrice": "6.8", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5687", "PriceToBookRatio": "100.468", "EVToRevenue": "0.8417", "EVToEBITDA": "108.6065", "Beta": "1.6687", "52WeekHigh": "8", "52WeekLow": "1.43", "50DayMovingAverage": "4.5622", "200DayMovingAverage": "4.0408", "SharesOutstanding": "120517000", "SharesFloat": "110802125", "SharesShort": "5750434", "SharesShortPriorMonth": "5873755", "ShortRatio": "4.35", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.047", "PercentInsiders": "2.165", "PercentInstitutions": "85.658", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2000-08-25"}