{"Symbol": "FBMS", "AssetType": "Common Stock", "Name": "The First Bancshares, Inc", "Description": "The First Bancshares, Inc. operates as the bank holding company for The First, A National Banking Association that provides general commercial and retail banking services. The company operates through three segments: Commercial/Retail Bank, Mortgage Banking Division, and Holding Company. It offers deposit services, including checking, NOW, and savings accounts; other time deposits, such as daily money market accounts and longer-term certificates of deposit; and individual retirement accounts. The company also provides commercial loans comprising secured and unsecured loans for working capital, business expansion, and purchase of equipment and machinery; consumer loans consisting of equity lines of credit, as well as secured and unsecured loans for financing automobiles, home improvements, education, and personal investments; and real estate construction and acquisition loans. In addition, it originates loans to purchase existing residential homes or construct new homes, and to refinance existing mortgages; and provides financial and wealth management services. Further, the company offers internet banking services, automated teller machines, voice response telephone inquiry services, commercial sweep accounts, cash management services, safe deposit boxes, merchant, mobile deposit, direct deposit of payroll and social security checks, automatic drafts for various accounts, and credit card services. It primarily serves small to medium-sized businesses, professional concerns, individuals, associations and organizations, and governmental authorities. As of December 31, 2019, the company operated through its main office and 72 full-service branches, one motor branch, and four loan production offices in Mississippi, Alabama, Louisiana, Florida, and Georgia. The First Bancshares, Inc. was incorporated in 1995 and is headquartered in Hattiesburg, Mississippi.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "6480 U.S. Highway 98 West, Hattiesburg, MS, United States, 39402", "FullTimeEmployees": "676", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "467742944", "EBITDA": "None", "PERatio": "8.1954", "PEGRatio": "0", "BookValue": "29.343", "DividendPerShare": "0.4", "DividendYield": "0.0182", "EPS": "2.597", "RevenuePerShareTTM": "7.966", "ProfitMargin": "0.3283", "OperatingMarginTTM": "0.3559", "ReturnOnAssetsTTM": "0.0115", "ReturnOnEquityTTM": "0.0903", "RevenueTTM": "150422000", "GrossProfitTTM": "145015000", "DilutedEPSTTM": "2.597", "QuarterlyEarningsGrowthYOY": "0.145", "QuarterlyRevenueGrowthYOY": "0.096", "AnalystTargetPrice": "26.06", "TrailingPE": "8.1954", "ForwardPE": "9.4607", "PriceToSalesRatioTTM": "2.4853", "PriceToBookRatio": "0.7294", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.8121", "52WeekHigh": "35.88", "52WeekLow": "15.27", "50DayMovingAverage": "21.2606", "200DayMovingAverage": "22.1434", "SharesOutstanding": "21407000", "SharesFloat": "20480572", "SharesShort": "392364", "SharesShortPriorMonth": "214534", "ShortRatio": "4.13", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0147", "PercentInsiders": "4.277", "PercentInstitutions": "56.499", "ForwardAnnualDividendRate": "0.4", "ForwardAnnualDividendYield": "0.0182", "PayoutRatio": "0.1379", "DividendDate": "2020-08-24", "ExDividendDate": "2020-08-07", "LastSplitFactor": "2:1", "LastSplitDate": "2006-03-16"}