{"Symbol": "FCCO", "AssetType": "Common Stock", "Name": "First Community Corporation", "Description": "First Community Corporation operates as the bank holding company for First Community Bank which offers various commercial and retail banking products and services to small-to-medium sized businesses, professional concerns, and individuals. The company operates through Commercial and Retail Banking, Mortgage Banking, and Investment Advisory and Non-Deposit segments. Its deposit products include demand deposit accounts, checking accounts, NOW accounts, and savings accounts, as well as other time deposits, such as daily money market accounts and longer-term certificates of deposit. The company's loan portfolio comprises commercial loans that consist of secured and unsecured loans for working capital, business expansion, and the purchase of equipment and machinery; consumer loans, including secured and unsecured loans for financing automobiles, home improvements, education, and personal investments; real estate construction and acquisition loans; and fixed and variable rate mortgage loans. It also provides other banking services, which include Internet banking, cash management services, safe deposit boxes, traveler's checks, direct deposit of payroll and social security checks, and automatic drafts for various accounts. In addition, the company offers non-deposit investment products and other investment brokerage services; VISA and MasterCard credit card services; financial and investment advisory services; and insurance services. It operates 21 full-service offices located in the Lexington County, Richland County, Newberry County, Kershaw County, Greenville County, Anderson County, Pickens County, and Aiken County, South Carolina; and Richmond County and Columbia County, Georgia. First Community Corporation was founded in 1994 and is headquartered in Lexington, South Carolina..", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "5455 Sunset Boulevard, Lexington, SC, United States, 29072", "FullTimeEmployees": "242", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "98592600", "EBITDA": "None", "PERatio": "10.7209", "PEGRatio": "0", "BookValue": "17.472", "DividendPerShare": "0.48", "DividendYield": "0.0357", "EPS": "1.291", "RevenuePerShareTTM": "6.498", "ProfitMargin": "0.1995", "OperatingMarginTTM": "0.2702", "ReturnOnAssetsTTM": "0.0079", "ReturnOnEquityTTM": "0.0774", "RevenueTTM": "48161000", "GrossProfitTTM": "48728000", "DilutedEPSTTM": "1.291", "QuarterlyEarningsGrowthYOY": "-0.194", "QuarterlyRevenueGrowthYOY": "-0.034", "AnalystTargetPrice": "16.17", "TrailingPE": "10.7209", "ForwardPE": "12.5786", "PriceToSalesRatioTTM": "2.1663", "PriceToBookRatio": "0.7915", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.7423", "52WeekHigh": "22", "52WeekLow": "12.23", "50DayMovingAverage": "13.7003", "200DayMovingAverage": "15.3082", "SharesOutstanding": "7486150", "SharesFloat": "7053077", "SharesShort": "173013", "SharesShortPriorMonth": "8795", "ShortRatio": "12.09", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0196", "PercentInsiders": "7.234", "PercentInstitutions": "51.177", "ForwardAnnualDividendRate": "0.48", "ForwardAnnualDividendYield": "0.0357", "PayoutRatio": "0.3566", "DividendDate": "2020-08-17", "ExDividendDate": "2020-07-31", "LastSplitFactor": "5:4", "LastSplitDate": "2002-03-01"}