{"Symbol": "FEYE", "AssetType": "Common Stock", "Name": "FireEye, Inc", "Description": "FireEye, Inc. provides cybersecurity solutions to prepare for, prevent, investigate, respond to, and remediate cyber-attacks in organizations. The company provides network, email, endpoint, and cloud security solutions, as well as customer support and maintenance services. It also offers Helix Security Platform, a cloud-hosted security platform; Security Validation Platform against cyber attacks; Dynamic Threat Intelligence cloud, a bi-directional cloud-based service; and Mandiant Threat Intelligence that offers subscriptions to threat intelligence reports to organizations for defending cyber threats. In addition, the company offers Mandiant Managed Defense, a technology-enabled managed detection and response service; Mandiant Digital Threat Monitoring, which analyzes content on the open and dark web for credential leakage, public data exposure, and other potential threats; and Mandiant Expertise-on-Demand, a prepaid subscription that provides access to the company's threat intelligence and expertise as microservices. Further, it provides incident response, response readiness and cyber insurance assessments, red and purple team assessments, and other strategic security services; cyber threat intelligence and defense center services; and education services. The company serves telecommunications providers, financial services entities, Internet search engines, social networking sites, stock exchanges, electrical grid operators, networking vendors, oil and gas companies, healthcare and pharmaceutical companies, and governmental agencies. FireEye, Inc. offers its products and services through distributors, resellers, and strategic partners in the United States, the Asia Pacific, Europe, the Middle East, Africa, and Japan. FireEye, Inc. has strategic partnership with Athena Alliance. The company was formerly known as NetForts, Inc. and changed its name to FireEye, Inc. in September 2005. FireEye, Inc. was founded in 2004 and is headquartered in Milpitas, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "601 McCarthy Boulevard, Milpitas, CA, United States, 95035", "FullTimeEmployees": "3400", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3339965952", "EBITDA": "-112470000", "PERatio": "None", "PEGRatio": "1.5199", "BookValue": "2.953", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.222", "RevenuePerShareTTM": "4.229", "ProfitMargin": "-0.2668", "OperatingMarginTTM": "-0.1773", "ReturnOnAssetsTTM": "-0.0368", "ReturnOnEquityTTM": "-0.3517", "RevenueTTM": "915622016", "GrossProfitTTM": "580260000", "DilutedEPSTTM": "-1.128", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.056", "AnalystTargetPrice": "16.9", "TrailingPE": "0", "ForwardPE": "63.6943", "PriceToSalesRatioTTM": "3.469", "PriceToBookRatio": "5.01", "EVToRevenue": "3.7307", "EVToEBITDA": "0", "Beta": "1.1582", "52WeekHigh": "18.34", "52WeekLow": "7.54", "50DayMovingAverage": "14.2826", "200DayMovingAverage": "12.5977", "SharesOutstanding": "225520992", "SharesFloat": "218219037", "SharesShort": "18705974", "SharesShortPriorMonth": "18035096", "ShortRatio": "3.72", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.0997", "PercentInsiders": "2.132", "PercentInstitutions": "78.03", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}