{"Symbol": "FFHL", "AssetType": "Common Stock", "Name": "Fuwei Films (Holdings) Co., Ltd", "Description": "Fuwei Films (Holdings) Co., Ltd., through its subsidiaries, develops, manufactures, and distributes biaxially oriented polyethylene-terephthalate films in the People's Republic of China. The company offers dry film, which is used in circuit boards production, nameplate, and crafts etching; chemically treated films used to enhance properties, such as barrier resistance, printing properties, and electrostatic resistance; stamping foil base films and transfer base films for packaging of luxury items, including cigarettes and alcohol; and printing base films for use in printing and lamination. It also provides metallized films or aluminum plating base films for use in vacuum aluminum plating for flexible plastic lamination; high-gloss films for aesthetically enhanced packaging purposes; heat-sealable films for construction, printing, and making heat sealable bags; and laser holographic base films used as anti-counterfeit films for food, medicine, cosmetics, cigarettes, and alcohol packaging; and heat shrinkable films used for special-shaped packaging for beverage and cosmetics. The company markets and sells its products under Fuwei Films brand for packaging, imaging, electronics, electrical, and magnetic products. It also exports its products to end-users and distributors primarily in Europe, Asia, and North America. The company was formerly known as Neo-Luck Plastic Holdings Co., Ltd. and changed its name to Fuwei Films (Holdings) Co., Ltd. in April 2005. The company was founded in 2003 and is headquartered in Weifang, the People's Republic of China. Fuwei Films (Holdings) Co., Ltd. is a subsidiary of Hongkong Ruishang International Trade Co., Ltd.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Packaging & Containers", "Address": "No. 387 Dongming Road, Weifang, China, 261061", "FullTimeEmployees": "208", "FiscalYearEnd": "December", "LatestQuarter": "2020-03-31", "MarketCapitalization": "18288704", "EBITDA": "None", "PERatio": "4.362", "PEGRatio": "0", "BookValue": "9.321", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.343", "RevenuePerShareTTM": "0", "ProfitMargin": "0.082", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0.0509", "ReturnOnEquityTTM": "0.1336", "RevenueTTM": "0", "GrossProfitTTM": "82121000", "DilutedEPSTTM": "-1.343", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.027", "AnalystTargetPrice": "357.8", "TrailingPE": "4.362", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.3576", "PriceToBookRatio": "0.5462", "EVToRevenue": "0.1188", "EVToEBITDA": "0.5306", "Beta": "0.6626", "52WeekHigh": "10.49", "52WeekLow": "1.56", "50DayMovingAverage": "5.3233", "200DayMovingAverage": "3.4482", "SharesOutstanding": "3265840", "SharesFloat": "1337589", "SharesShort": "130155", "SharesShortPriorMonth": "42221", "ShortRatio": "0.24", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0251", "PercentInsiders": "65.45", "PercentInstitutions": "6.996", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:4", "LastSplitDate": "2016-12-06"}