{"Symbol": "FISV", "AssetType": "Common Stock", "Name": "Fiserv, Inc", "Description": "Fiserv, Inc., together with its subsidiaries, provides financial services technology worldwide. Its First Data segment provides merchant acquiring, e-commerce, mobile commerce, and other business solutions; credit card and loan account processing, commercial payments, customer communications, plastics solutions, customer service, and other products; and various network solutions and security, and risk and fraud management solutions. The company's Payments and Industry Products segment offers electronic bill payment and presentment services; internet and mobile banking software and services; account-to-account transfers; person-to-person payment services; debit and credit card processing and services; payments infrastructure services; and other electronic payments software and services. This segment also offers card and print personalization services; investment account processing services for separately managed accounts; and fraud and risk management products and services. Its Financial Institution Services segment offers account processing, item processing and source capture, loan origination and servicing products, cash management and consulting services, and other products and services that support various types of financial transactions. This segment also provides ACH and treasury management, case management and resolution, and source capture optimization services to the financial services industry. The company also offers bank payment and liquidity management solutions, as well as Internet based mortgage software and mortgage lending technology solutions. It serves business, banks, governments, processors, credit unions, other financial institutions, merchants, and other clients. The company was founded in 1984 and is headquartered in Brookfield, Wisconsin.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "255 Fiserv Drive, Brookfield, WI, United States, 53045", "FullTimeEmployees": "44000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "67072143360", "EBITDA": "4522999808", "PERatio": "85.3448", "PEGRatio": "1.5647", "BookValue": "47.181", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.257", "RevenuePerShareTTM": "22.053", "ProfitMargin": "0.0582", "OperatingMarginTTM": "0.1106", "ReturnOnAssetsTTM": "0.0206", "ReturnOnEquityTTM": "0.0476", "RevenueTTM": "14407000064", "GrossProfitTTM": "4926000000", "DilutedEPSTTM": "1.257", "QuarterlyEarningsGrowthYOY": "-0.995", "QuarterlyRevenueGrowthYOY": "1.292", "AnalystTargetPrice": "125.41", "TrailingPE": "85.3448", "ForwardPE": "22.5225", "PriceToSalesRatioTTM": "4.5758", "PriceToBookRatio": "2.0991", "EVToRevenue": "6.0596", "EVToEBITDA": "18.5115", "Beta": "0.8148", "52WeekHigh": "125.05", "52WeekLow": "73.5", "50DayMovingAverage": "99.7483", "200DayMovingAverage": "101.2373", "SharesOutstanding": "669649984", "SharesFloat": "666127594", "SharesShort": "13626813", "SharesShortPriorMonth": "15090638", "ShortRatio": "2.79", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0218", "PercentInsiders": "0.461", "PercentInstitutions": "94.656", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2018-03-20"}