{"Symbol": "FLDM", "AssetType": "Common Stock", "Name": "Fluidigm Corporation", "Description": "Fluidigm Corporation creates, manufactures, and markets technologies and tools for life sciences research worldwide. It offers analytical systems comprising Helios, a CyTOF system, Hyperion imaging system, and Hyperion tissue imager; and assays and reagents, including Maxpar reagents and Maxpar human immune monitoring panel kit and workflow., as well as Maxpar direct immune profiling assays and IMC panel kits for immuno-oncology. The company also provides preparatory instruments, such as access array and Juno systems; and analytical instruments comprising Biomark HD system and EP1 system. In addition, it offers integrated fluidic circuits (IFCs), such as library preparation IFCs, Juno genotyping IFC, dynamic array IFCs, digital array IFCs, and Flex Six IFC; and assays and reagents, including Advanta RNA-Seq NGS library prep kits, delta gene and SNP type assays, access array target-specific primers and targeted sequencing prep primers, and targeted DNA Seq library assays. Further, the company offers single cell microfluidics that comprise C1 system, Polaris system, C1 IFCs, and Polaris IFC. It sells instruments, consumables, and services to academic institutions, clinical research laboratories, and contract research organizations, as well as biopharmaceutical, biotechnology, and agricultural biotechnology companies. Fluidigm Corporation sells its products to academic institutions, life sciences, and clinical research laboratories that conduct research, as well as biopharmaceutical and biotechnology companies for non-diagnostic and non-clinical purposes. The company was formerly known as Mycometrix Corporation and changed its name to Fluidigm Corporation in April 2001. Fluidigm Corporation was founded in 1999 and is headquartered in South San Francisco, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "7000 Shoreline Court, South San Francisco, CA, United States, 94080", "FullTimeEmployees": "566", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "602623552", "EBITDA": "-46797000", "PERatio": "None", "PEGRatio": "0.3", "BookValue": "1.862", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.318", "RevenuePerShareTTM": "1.605", "ProfitMargin": "-0.4846", "OperatingMarginTTM": "-0.4472", "ReturnOnAssetsTTM": "-0.1112", "ReturnOnEquityTTM": "-0.3574", "RevenueTTM": "112611000", "GrossProfitTTM": "64279000", "DilutedEPSTTM": "-0.778", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.076", "AnalystTargetPrice": "14", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "5.2337", "PriceToBookRatio": "4.5137", "EVToRevenue": "5.7631", "EVToEBITDA": "0", "Beta": "2.3385", "52WeekHigh": "10.1", "52WeekLow": "1.17", "50DayMovingAverage": "7.1008", "200DayMovingAverage": "4.3159", "SharesOutstanding": "70706096", "SharesFloat": "66444749", "SharesShort": "2623633", "SharesShortPriorMonth": "2192812", "ShortRatio": "1.51", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1017", "PercentInsiders": "1.239", "PercentInstitutions": "94.585", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}