{"Symbol": "FLEX", "AssetType": "Common Stock", "Name": "Flex Ltd", "Description": "Flex Ltd. provides design, engineering, manufacturing, and supply chain services and solutions to original equipment manufacturers in Asia, the Americas, and Europe. It operates through High Reliability Solutions, Industrial and Emerging Industries, Communications & Enterprise Compute, and Consumer Technologies Group segments. The company provides a portfolio of technologies in electrical/electronics, electromechanical, and software; and cross-industry technologies, including human machine interface, audio and video, system in package, miniaturization, IoT platforms, and power management. It also designs and integrates advanced data center servers, storage and networking equipment, and data center appliances. In addition, the company provides value-added design and engineering services; and systems assembly and manufacturing services that include enclosures, testing services, and materials procurement and inventory management services. Further, it offers chargers for smartphones and tablets; adapters for notebooks and gaming systems; power supplies for the server, storage, and networking markets; isolated DC/DC converters and non-isolated Point of Load converters for the information and communications technology market; and specialized power module solutions for other markets. Additionally, the company provides after-market and forward supply chain logistics services comprising supplier-managed inventory, inbound freight management, product postponement, build/configure to order, order fulfillment and distribution, asset tracking, and supply chain network design; and reverse logistics and repair solutions, including returns management, exchange programs, complex repair, asset recovery, recycling, and e-waste management. The company was formerly known as Flextronics International Ltd. and changed its name to Flex Ltd. in September 2016. Flex Ltd. was founded in 1990 and is based in Singapore.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Electronic Components", "Address": "2 Changi South Lane, Singapore, Singapore, 486123", "FullTimeEmployees": "160000", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "5439654400", "EBITDA": "1013089984", "PERatio": "58.6111", "PEGRatio": "0.97", "BookValue": "5.875", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.178", "RevenuePerShareTTM": "45.943", "ProfitMargin": "0.0041", "OperatingMarginTTM": "0.0243", "ReturnOnAssetsTTM": "0.0247", "ReturnOnEquityTTM": "0.0318", "RevenueTTM": "23187263488", "GrossProfitTTM": "1528380000", "DilutedEPSTTM": "0.178", "QuarterlyEarningsGrowthYOY": "0.146", "QuarterlyRevenueGrowthYOY": "-0.166", "AnalystTargetPrice": "14.57", "TrailingPE": "58.6111", "ForwardPE": "9.4162", "PriceToSalesRatioTTM": "0.2313", "PriceToBookRatio": "1.7976", "EVToRevenue": "0.3223", "EVToEBITDA": "7.3653", "Beta": "1.7978", "52WeekHigh": "14", "52WeekLow": "5.36", "50DayMovingAverage": "11.0053", "200DayMovingAverage": "10.1204", "SharesOutstanding": "500888992", "SharesFloat": "498233814", "SharesShort": "13202041", "SharesShortPriorMonth": "9044060", "ShortRatio": "2.84", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0254", "PercentInsiders": "0.45", "PercentInstitutions": "99.5", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2000-10-17"}