{"Symbol": "FMBI", "AssetType": "Common Stock", "Name": "First Midwest Bancorp, Inc", "Description": "First Midwest Bancorp, Inc. operates as the bank holding company for First Midwest Bank that provides various banking products and services. The company accepts checking, NOW, money market, and savings accounts, as well as various types of short-term and long-term certificates of deposit. Its loan products include working capital loans; accounts receivable financing; inventory and equipment financing; sector-based lending, including healthcare, asset-based lending, structured finance, and syndications; agricultural loans; and mortgages, home equity lines and loans, personal loans, specialty loans, and consumer secured and unsecured loans, as well as funding for the construction, purchase, refinance, or improvement of commercial real estate properties. In addition, the company offers treasury management products and services comprising automated clearing house collection, lockbox, remote deposit capture, and financial electronic data interchange; wire transfer, account reconciliation, controlled disbursement, direct deposit, and positive pay services; information reporting services; corporate credit cards; and liquidity management, fraud prevention, and merchant services. Further, it provides fiduciary and executor, financial planning, investment advisory, employee benefit plan, and private banking services to corporate and public retirement plans, foundations and endowments, high net worth individuals, and multi-employer trust funds. Additionally, the company offers debit and automated teller machine, and credit cards; Internet and mobile, and telephone banking services; and financial education services. The company operates 127 locations and 178 automated teller machines in metropolitan Chicago, southeast Wisconsin, northwest Indiana, central and western Illinois, and eastern Iowa. First Midwest Bancorp, Inc. was incorporated in 1982 and is headquartered in Chicago, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "8750 West Bryn Mawr Avenue, Chicago, IL, United States, 60631-3655", "FullTimeEmployees": "2122", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1447113984", "EBITDA": "None", "PERatio": "9.7442", "PEGRatio": "2.56", "BookValue": "21.227", "DividendPerShare": "0.56", "DividendYield": "0.0436", "EPS": "1.283", "RevenuePerShareTTM": "5.932", "ProfitMargin": "0.222", "OperatingMarginTTM": "0.3565", "ReturnOnAssetsTTM": "0.0075", "ReturnOnEquityTTM": "0.0586", "RevenueTTM": "654603008", "GrossProfitTTM": "706455000", "DilutedEPSTTM": "1.283", "QuarterlyEarningsGrowthYOY": "-0.633", "QuarterlyRevenueGrowthYOY": "-0.179", "AnalystTargetPrice": "14.9", "TrailingPE": "9.7442", "ForwardPE": "14.4509", "PriceToSalesRatioTTM": "1.8602", "PriceToBookRatio": "0.5923", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.239", "52WeekHigh": "23.64", "52WeekLow": "10.31", "50DayMovingAverage": "12.6894", "200DayMovingAverage": "13.9594", "SharesOutstanding": "114306000", "SharesFloat": "112941875", "SharesShort": "3472450", "SharesShortPriorMonth": "3476420", "ShortRatio": "6.4", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0389", "PercentInsiders": "0.862", "PercentInstitutions": "87.722", "ForwardAnnualDividendRate": "0.56", "ForwardAnnualDividendYield": "0.0436", "PayoutRatio": "0.4341", "DividendDate": "2020-10-06", "ExDividendDate": "2020-09-24", "LastSplitFactor": "5:4", "LastSplitDate": "2001-12-17"}