{"Symbol": "FNGN", "AssetType": "Common Stock", "Name": "Financial Engines, Inc", "Description": "Financial Engines, Inc. provides independent technology-enabled financial advisory, discretionary portfolio management, personalized investment advice, financial and retirement income planning, and financial education and guidance services in the United States. It assists individuals to develop a strategy to reach financial goals by offering a set of services, including personalized plans for saving and investing, assessments of retirement income, and the option to meet face-to-face with a financial advisor. The company's products and services include Professional Management that provides discretionary portfolio management service for individuals in the workplace who want affordable and personalized portfolio management for their retirement accounts; Personal Advisor, which offers discretionary portfolio management for 401(k), IRA, and taxable accounts for defined contribution (DC) plan participants and individual retail investors; and Online Advice, an Internet-based investment advisory service designed for individuals who wish to take an active role in personally managing their portfolios. Its products and services also comprise Financial Planning and Retirement Income Planning services, including social security guidance; and Financial Wellness, which offers a range of financial education and guidance through multiple channels, including in person, on-site events, online content, and phone-based advisors. The company delivers its services to plan sponsors and plan participants primarily through connections to nine DC plan providers. Financial Engines, Inc. was founded in 1996 and is headquartered in Sunnyvale, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "1050 Enterprise Way, 3rd Floor\n94089,Sunnyvale,USA\n", "FullTimeEmployees": "935", "FiscalYearEnd": "December", "LatestQuarter": "0000-00-00", "MarketCapitalization": "2864070144", "EBITDA": "118312000", "PERatio": "56.8987", "PEGRatio": "1.35", "BookValue": "13.672", "DividendPerShare": "0.32", "DividendYield": "0.0071", "EPS": "0.65", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "45", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "5.3133", "EVToEBITDA": "21.7053", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}