{"Symbol": "FORM", "AssetType": "Common Stock", "Name": "FormFactor, Inc", "Description": "FormFactor, Inc. designs, manufactures, and sells probe cards, analytical probes, probe stations, metrology systems, and thermal sub-systems. It operates in two segments, Probe Cards and Systems. The company offers probe cards to test various semiconductor device types, including systems on a chip, mobile application processors, microprocessors, microcontrollers, graphic processors, radio frequency, analog, mixed signal, image sensors, electro-optical, DRAM memory, NAND flash memory and NOR flash memory devices; and analytical probes, which are used for a range of applications, including device characterization, electrical simulation model development, failure analysis, and prototype design debugging for universities, research institutions, semiconductor integrated device manufacturers, semiconductor foundries, and fabless semiconductor companies. It also provides probing stations for semiconductor design engineers to capture and analyze data and integrated measurement systems that include test instrumentation, probe, cabling configurations, and software to enable fast, accurate, and on-wafer data collection for complex application and measurement needs; metrology systems for various applications including the development, production, and quality control of semiconductor products; and thermal subsystems that produce thermal chucks and other test systems used in probe stations. In addition, the company offers on-site probe card maintenance and service training, seminars, and telephone support services. FormFactor, Inc. markets and sells its products through direct sales force, manufacturers' representatives, and distributors in the United States, Taiwan, South Korea, China, Japan, Europe, the Asia-Pacific, and internationally. The company was founded in 1993 and is headquartered in Livermore, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductors", "Address": "7005 Southfront Road, Livermore, CA, United States, 94551", "FullTimeEmployees": "1836", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2090602624", "EBITDA": "120297000", "PERatio": "32.642", "PEGRatio": "0.71", "BookValue": "9.029", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.807", "RevenuePerShareTTM": "8.412", "ProfitMargin": "0.0992", "OperatingMarginTTM": "0.1175", "ReturnOnAssetsTTM": "0.0571", "ReturnOnEquityTTM": "0.0977", "RevenueTTM": "637809984", "GrossProfitTTM": "237961000", "DilutedEPSTTM": "0.807", "QuarterlyEarningsGrowthYOY": "1.889", "QuarterlyRevenueGrowthYOY": "0.144", "AnalystTargetPrice": "35.29", "TrailingPE": "32.642", "ForwardPE": "0", "PriceToSalesRatioTTM": "3.2587", "PriceToBookRatio": "2.9497", "EVToRevenue": "2.8732", "EVToEBITDA": "14.9853", "Beta": "1.3709", "52WeekHigh": "33.07", "52WeekLow": "16.3501", "50DayMovingAverage": "29.48", "200DayMovingAverage": "25.4784", "SharesOutstanding": "77058704", "SharesFloat": "76419125", "SharesShort": "1205202", "SharesShortPriorMonth": "1171744", "ShortRatio": "2.33", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0235", "PercentInsiders": "1.214", "PercentInstitutions": "96.192", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}