{"Symbol": "FORR", "AssetType": "Common Stock", "Name": "Forrester Research, Inc", "Description": "Forrester Research, Inc. operates as an independent research, data, and advisory services company in the United States and internationally. It operates through Products, Research, and SiriusDecisions segments. Its primary syndicated research product is Research, which offers clients with access to its research designed to inform their strategic decision-making. It also provides Playbooks, a set of integrated reports and tools to tackle critical business initiatives; SiriusDecisions Research that delivers operational intelligence and fact-based insight to functional marketing, sales, and product leaders of B2B organizations and their teams; and SiriusDecisions Command Center to offer performance benchmarking metrics in a self-service platform to aid sales, marketing, and product leaders in planning, uncovering new opportunities, and making business cases. In addition, it offers leadership boards that are peer groups for executives and other senior leaders at large organizations; executive programs with a trusted partner who help the executives and their teams establish and tackle their initiatives; and certification courses for leaders and their teams. Further, its analytics products and services include Customer Experience Index, a framework for assessing and measuring customer experience quality; Consumer Technographics, a quantitative research program; Business Technographics to provide assessments of what motivates businesses to choose certain technologies and vendors, as well as measures and reports on the current information consumption patterns of key influencers for technology purchases; FeedbackNow, a customer experience cloud solution; and ForecastView to provide a detailed evaluation of market size, based on expert analysis and quantitative insights from consumer and business surveys. Additionally, it offers advisory and project consulting services; and hosts various events. The company was founded in 1983 and is headquartered in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Consulting Services", "Address": "60 Acorn Park Drive, Cambridge, MA, United States, 02140", "FullTimeEmployees": "1843", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "681281600", "EBITDA": "48992000", "PERatio": "50.0694", "PEGRatio": "4.2917", "BookValue": "9.239", "DividendPerShare": "0.8", "DividendYield": "0.0199", "EPS": "0.719", "RevenuePerShareTTM": "24.265", "ProfitMargin": "0.0298", "OperatingMarginTTM": "0.0533", "ReturnOnAssetsTTM": "0.0249", "ReturnOnEquityTTM": "0.0837", "RevenueTTM": "452751008", "GrossProfitTTM": "264971000", "DilutedEPSTTM": "0.719", "QuarterlyEarningsGrowthYOY": "6.875", "QuarterlyRevenueGrowthYOY": "-0.114", "AnalystTargetPrice": "43.67", "TrailingPE": "50.0694", "ForwardPE": "51.5464", "PriceToSalesRatioTTM": "1.4895", "PriceToBookRatio": "3.9277", "EVToRevenue": "1.7413", "EVToEBITDA": "12.4923", "Beta": "0.9912", "52WeekHigh": "46", "52WeekLow": "22.45", "50DayMovingAverage": "34.6908", "200DayMovingAverage": "33.1859", "SharesOutstanding": "18893000", "SharesFloat": "9963979", "SharesShort": "564349", "SharesShortPriorMonth": "517970", "ShortRatio": "17.13", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0522", "PercentInsiders": "42.261", "PercentInstitutions": "55.217", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2018-12-26", "ExDividendDate": "2018-12-11", "LastSplitFactor": "2:1", "LastSplitDate": "2000-02-08"}