{"Symbol": "FORTY", "AssetType": "Common Stock", "Name": "Formula Systems (1985) Ltd", "Description": "Formula Systems (1985) Ltd., through its subsidiaries, provides software, proprietary and non-proprietary software, and software product marketing and support services in Israel and internationally. The company offers computer and telecommunication infrastructure solutions; computer solutions to computer and communications infrastructures; cloud computing solutions; database and big data services; customer relations management, computer systems management infrastructures, web world content management, database and data warehouse mining, application integration, database and systems, data management, and software development tools; and professional training courses and advanced professional studies. It also markets and sells computers and peripheral equipment to business customers. In addition, the company offers property and casualty insurance platforms, such as Sapiens, Sapiens CoreSuite, Sapiens IDITSuite, Sapiens PolicyPro, Sapiens BillingPro, Sapiens ClaimsPro, e-Tica, and Sapiens Stingray; life, pension, and annuities platforms, including Sapiens CoreSuite, Sapiens UnderwritingPro, Sapiens ApplicationPro, Sapiens IllustrationPro, and Sapiens ConsolidationMaster; reinsurance software solutions comprising Sapiens ReinsuranceMaster, Sapiens ReinsurancePro, and Sapiens Reinsurance GO; and Sapiens platform for workers' compensation solutions. Further, it provides financial and compliance solutions that include Sapiens FinancialPro, Sapiens Financial GO, and Sapiens StatementPro; Sapiens DECISION, a decision management platform; and technology-based solutions and digital insurance suites. Additionally, the company offers application development and business process integration platforms; vertical software solutions; software services and information technologies outsourcing software services; and professionals in various areas, as well as develops on-premise payroll software solutions. The company was founded in 1985 and is headquartered in Or Yehuda, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "5 HaPlada Street, Or Yehuda, Israel, 60218", "FullTimeEmployees": "17378", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1405643776", "EBITDA": "209338496", "PERatio": "35.3321", "PEGRatio": "0", "BookValue": "28.346", "DividendPerShare": "1.04", "DividendYield": "0.0112", "EPS": "2.712", "RevenuePerShareTTM": "117.81", "ProfitMargin": "0.0233", "OperatingMarginTTM": "0.0853", "ReturnOnAssetsTTM": "0.0463", "ReturnOnEquityTTM": "0.115", "RevenueTTM": "1800523008", "GrossProfitTTM": "386049000", "DilutedEPSTTM": "2.712", "QuarterlyEarningsGrowthYOY": "0.237", "QuarterlyRevenueGrowthYOY": "0.059", "AnalystTargetPrice": "None", "TrailingPE": "35.3321", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.8133", "PriceToBookRatio": "3.3798", "EVToRevenue": "0.9244", "EVToEBITDA": "11.0115", "Beta": "0.3606", "52WeekHigh": "99.06", "52WeekLow": "36.7501", "50DayMovingAverage": "89.3437", "200DayMovingAverage": "72.8028", "SharesOutstanding": "15294300", "SharesFloat": "9540914", "SharesShort": "816", "SharesShortPriorMonth": "171", "ShortRatio": "0.18", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0.16", "ForwardAnnualDividendRate": "1.04", "ForwardAnnualDividendYield": "0.0112", "PayoutRatio": "0.362", "DividendDate": "2020-01-21", "ExDividendDate": "2020-09-02", "LastSplitFactor": "None", "LastSplitDate": "None"}