{"Symbol": "FTEK", "AssetType": "Common Stock", "Name": "Fuel Tech, Inc", "Description": "Fuel Tech, Inc. provides boiler optimization, efficiency improvement, and air pollution reduction and control solutions to utility and industrial customers worldwide. It operates through Air Pollution Control Technology and FUEL CHEM Technology segments. The Air Pollution Control Technology segment offers technologies to reduce nitrogen oxide (NOx) emissions in flue gas from boilers, incinerators, furnaces, and other stationary combustion sources, which includes low and ultra-low NOx burners; over-fire air systems; NOxOUT and HERT selective non-catalytic reduction systems; advanced selective catalytic reduction systems comprising ULNB, OFA, and SNCR components, as well as downsized SCR catalyst, Ammonia Injection Grid, and Graduated Straightening Grid systems; NOxOUT CASCADE and NOxOUT-SCR processes; ULTRA technology; and flue gas conditioning systems. The FUEL CHEM Technology segment provides programs to improve the efficiency, reliability, fuel flexibility, boiler heat rate, and environmental status of combustion units by controlling slagging, fouling, corrosion, opacity, and acid plume, as well as the formation of sulfur trioxide, ammonium bisulfate, particulate matter, sulfur dioxide, and carbon dioxide through the addition of chemicals into the furnace using TIFI targeted in-furnace injection technology. This segment offers its FUEL CHEM program for plants operating in the electric utility, industrial, pulp and paper, waste-to-energy, university, and district heating markets, as well as to the owners of boilers, furnaces, and other combustion units. The company was founded in 1987 and is headquartered in Warrenville, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Pollution & Treatment Controls", "Address": "27601 Bella Vista Parkway, Warrenville, IL, United States, 60555-1617", "FullTimeEmployees": "82", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "20133948", "EBITDA": "1373000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.855", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.012", "RevenuePerShareTTM": "0.8", "ProfitMargin": "-0.549", "OperatingMarginTTM": "-0.5692", "ReturnOnAssetsTTM": "-0.1917", "ReturnOnEquityTTM": "-0.4037", "RevenueTTM": "19543000", "GrossProfitTTM": "10830000", "DilutedEPSTTM": "-0.439", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.508", "AnalystTargetPrice": "1.75", "TrailingPE": "0", "ForwardPE": "14.0056", "PriceToSalesRatioTTM": "1.0014", "PriceToBookRatio": "0.9366", "EVToRevenue": "0.722", "EVToEBITDA": "0", "Beta": "1.8401", "52WeekHigh": "1.49", "52WeekLow": "0.3502", "50DayMovingAverage": "0.9003", "200DayMovingAverage": "0.7499", "SharesOutstanding": "24701200", "SharesFloat": "17141616", "SharesShort": "53964", "SharesShortPriorMonth": "218989", "ShortRatio": "0.29", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0026", "PercentInsiders": "29.459", "PercentInstitutions": "25.87", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}