{"Symbol": "FUNC", "AssetType": "Common Stock", "Name": "First United Corporation", "Description": "First United Corporation operates as the bank holding company for First United Bank & Trust that provides various retail and commercial banking services to businesses and individuals. The company offers various deposit products, including checking accounts, savings and money market accounts, regular and individual retirement accounts (IRA) certificates of deposit, Christmas savings accounts, college savings accounts, and health savings accounts; Certificate of Deposit Account Registry Service program and Insured Cash Sweep program to municipalities, businesses, and consumers; and commercial customers packages, which include treasury management, cash sweep, and various checking opportunities. It also provides loans, such as commercial loans secured by real estate, commercial equipment, vehicles, or other assets of the borrower; commercial real estate loans for residential and commercial development, agricultural purpose properties, and service industry buildings; residential mortgage loans; home equity lines of credit; residential real estate construction loans; indirect and direct auto loans; and other secured and unsecured lines of credit and term loans. In addition, the company offers various trust services, including personal trust, investment agency accounts, charitable trusts, retirement accounts that consist of IRA roll-overs, 401(k) accounts and defined benefit plans, estate administration, and estate planning services; insurance products; brokerage services; and safe deposit, and night depository facilities. It operates 25 banking offices, one customer care center, and 32 automated teller machines in Allegany, Frederick, Garrett, and Washington counties in Maryland; and in Mineral, Berkeley, and Monongalia counties in West Virginia. First United Corporation was founded in 1900 and is headquartered in Oakland, Maryland.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "19 South Second Street, Oakland, MD, United States, 21550-0009", "FullTimeEmployees": "285", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "81023104", "EBITDA": "None", "PERatio": "6.8133", "PEGRatio": "0", "BookValue": "17.821", "DividendPerShare": "0.52", "DividendYield": "0.0457", "EPS": "1.657", "RevenuePerShareTTM": "8.338", "ProfitMargin": "0.1987", "OperatingMarginTTM": "0.2484", "ReturnOnAssetsTTM": "0.0077", "ReturnOnEquityTTM": "0.0934", "RevenueTTM": "58893000", "GrossProfitTTM": "60754000", "DilutedEPSTTM": "1.657", "QuarterlyEarningsGrowthYOY": "0.006", "QuarterlyRevenueGrowthYOY": "-0.028", "AnalystTargetPrice": "22", "TrailingPE": "6.8133", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.2213", "PriceToBookRatio": "0.6348", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.9137", "52WeekHigh": "24.8", "52WeekLow": "10.74", "50DayMovingAverage": "11.2397", "200DayMovingAverage": "14.5248", "SharesOutstanding": "6984750", "SharesFloat": "6635306", "SharesShort": "74210", "SharesShortPriorMonth": "13814", "ShortRatio": "2.91", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0076", "PercentInsiders": "10.256", "PercentInstitutions": "33.756", "ForwardAnnualDividendRate": "0.52", "ForwardAnnualDividendYield": "0.0457", "PayoutRatio": "0.2892", "DividendDate": "2020-08-03", "ExDividendDate": "2020-07-16", "LastSplitFactor": "105:100", "LastSplitDate": "1996-03-13"}