{"Symbol": "GBSN", "AssetType": "Common Stock", "Name": "Great Basin Scientific, Inc", "Description": "Great Basin Scientific, Inc., a molecular diagnostic testing company, develops and commercializes molecular diagnostic systems that are designed to test hospital-acquired infections. The company's platform provides C. diff test, a diagnostic test for the detection of C. diff, a gram-positive bacteria that causes severe diarrhea and other intestinal disorders. It also provides Group B streptococcus test, which is used to detect Group B streptococcus from an anal/vaginal swab of a pregnant woman; Shiga Toxin Direct test for identifying Shiga toxin produced by Escherichia coli contracted from contaminated food; and Staphylococcus Identification and Resistance Blood Infection Panel that is designed to identify species of Staphylococcus infections, detect the mecA gene that confers drug resistance directly from positive blood cultures, and provide information on the antibiotic resistance profile of the bacteria. The company's assays under clinical trials include Stool Bacterial Pathogenic Panel, which is designed to detect the causes of food poisoning; and Bordatella Pertussis test, a test for contagious respiratory disease caused by the bacterium Bordetella pertussis. Its assays under development include Staphyloccocus aureus (SA) pre-surgical nasal screen test, a test for the presence of SA in the nasal passages of a pre-surgical patient; Candida Blood Infections Panel that is designed to identify the five species of Candida directly from positive blood cultures; and Chlamydia tracomatis and Neisseria gonorrhoeae (CT/NG) test that is designed to detect sexually transmitted diseases. The company sells its diagnostic tests through a direct sales force in the United States, as well as through distributors in the European Union and New Zealand. The company was formerly known as Diagnostic Micro Arrays, Inc. and changed its name to Great Basin Scientific, Inc. in April 2006. Great Basin Scientific, Inc. was founded in 2005 and is headquartered in Salt Lake City, Utah.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "120", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "302185", "EBITDA": "-30802456", "PERatio": "None", "PEGRatio": "0", "BookValue": "-39.105", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-88.62", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "999999.9999", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}