{"Symbol": "GCVRZ", "AssetType": "Common Stock", "Name": "Sanofi", "Description": "Sanofi provides therapeutic solutions worldwide. It offers Cerezyme and Cerdelga for Gaucher, Myozyme and Lumizyme for Pompe, Fabrazyme for Fabry, and Aldurazyme for mucopolysaccharidosis Type 1; and Aubagio, an immunomodulatory and Lemtrada, a monoclonal antibody for multiple sclerosis. It also provides Dupixent for atopic dermatitis; Kevzara for rheumatoid arthritis; Eloctate and Alprolix to treat hemophilia; and Cablivi to treat acquired thrombotic thrombocytopenic purpura. In addition, it offers Libtayo for metastatic cutaneous squamous cell carcinoma; Jevtana and Taxotere taxane for cancers; Eloxatin for colon cancer; Thymoglobulin, an immunosuppressive and immunomodulating agent; Mozobil, for hematologic malignancies; and Zaltrap, for metastatic colorectal cancer. Further, it provides Lantus, Toujeo, Apidra, and Insuman insulins; Amaryl sulfonylurea; Adlyxin/Lyxumia, a GLP-1 receptor agonist; Soliqua 100/33/Suliqua, an insulin glargine and lixisenatide combination to treat diabetes; Admelog/Insulin lispro insulin; Praluent, a cholesterol-lowering drug; and Multaq, an anti-arrhythmic drug for atrial fibrillation. Additionally, it offers Plavix for atherothrombotic conditions; Lovenox for the prophylaxis, venous thromboembolism, and acute coronary syndrome; Aprovel and CoAprovel anti-hypertensives; Renagel and Renvela for patients undergoing dialysis; Synvisc and Synvisc-One viscosupplements for osteoarthritis; Stilnox for insomnia; Allegra for seasonal allergic rhinitis and uncomplicated hives; and Depakine for epilepsy. It also provides generic products; and products for allergy, cough, cold, pain, nutrition, digestion, pediatrics, influenza, meningitis, travel, and endemic vaccines; and adult and adolescent boosters. Sanofi has an alliance with Verily Life Sciences LLC; and agreement with Happify Health. Sanofi was formerly known as Sanofi-Aventis and changed its name to Sanofi in May 2011. Sanofi was founded in 1973 and is headquartered in Paris, France.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "100000", "FiscalYearEnd": "December", "LatestQuarter": "0000-00-00", "MarketCapitalization": "1086348800", "EBITDA": "None", "PERatio": "0.2245", "PEGRatio": "0", "BookValue": "52.498", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.88", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "24776000000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0.87", "200DayMovingAverage": "0.7982", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "799682", "SharesShortPriorMonth": "567161", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}