{"Symbol": "GEOS", "AssetType": "Common Stock", "Name": "Geospace Technologies Corporation", "Description": "Geospace Technologies Corporation designs and manufactures instruments and equipment used in the oil and gas industry to acquire seismic data in order to locate, characterize, and monitor hydrocarbon producing reservoirs. The company operates through three segments: Oil and Gas Markets, Adjacent Markets, and Emerging Markets. The Oil and Gas Markets segment offers wireless seismic data acquisition systems, reservoir characterization products and services, and traditional seismic exploration products, such as geophones, hydrophones, leader wires, connectors, cables, marine streamer retrieval and steering devices, and various other seismic products. The Adjacent Markets segment provides industrial products, including imaging equipment, water meter products, and offshore cables, as well as seismic sensors for vibration monitoring and geotechnical applications, such as mine safety and earthquake detection applications; and electronic pre-press products that employ direct thermal imaging and digital inkjet printing technologies targeted at the commercial graphic, industrial graphic, textile, and flexographic printing industries. The Emerging Markets segment designs and sells products used for border and perimeter security surveillance, cross-border tunneling detection, and other products targeted at movement monitoring, intrusion detection, and situational awareness. This segment serves customers that include various agencies of the United States government, including the Department of Defense, Department of Energy, Department of Homeland Security, and other agencies. It operates in Asia, Canada, Europe, the United States, and internationally. Geospace Technologies Corporation was founded in 1980 and is headquartered in Houston, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Equipment & Services", "Address": "7007 Pinemont Drive, Houston, TX, United States, 77040", "FullTimeEmployees": "786", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "91272848", "EBITDA": "11572000", "PERatio": "32.0909", "PEGRatio": "-0.61", "BookValue": "12.036", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.327", "RevenuePerShareTTM": "7.061", "ProfitMargin": "-0.0704", "OperatingMarginTTM": "-0.1238", "ReturnOnAssetsTTM": "-0.0383", "ReturnOnEquityTTM": "-0.0401", "RevenueTTM": "95253000", "GrossProfitTTM": "31428000", "DilutedEPSTTM": "-0.498", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.007", "AnalystTargetPrice": "17.25", "TrailingPE": "32.0909", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.9489", "PriceToBookRatio": "0.5566", "EVToRevenue": "0.6811", "EVToEBITDA": "3.17", "Beta": "2.0841", "52WeekHigh": "17.66", "52WeekLow": "4.61", "50DayMovingAverage": "7.2481", "200DayMovingAverage": "7.5462", "SharesOutstanding": "13663600", "SharesFloat": "13046838", "SharesShort": "454834", "SharesShortPriorMonth": "551432", "ShortRatio": "2.89", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0152", "PercentInsiders": "4.21", "PercentInstitutions": "86.941", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2012-10-19"}