{"Symbol": "GFNCP", "AssetType": "Common Stock", "Name": "General Finance Corporation", "Description": "General Finance Corporation, a specialty rental services company, provides portable storage, modular space, and liquid containment solutions in North America and the Asia-Pacific regions. The company's portable storage products include storage containers for classroom equipment storage, construction equipment and tool storage, disaster shelters, landscaping sheds, recreational equipment storage, and retail inventory storage applications; and freight containers used in freight transportation. Its modular space products comprise office or portable building containers, ground level offices, and modular buildings and offices for use in general administrative office spaces, military installations, workforce living accommodations, bank branches, classrooms/education, construction offices, day-care facilities, dormitories, general administrative office space, healthcare and rental facilities, retail space, and shelters. The company's liquid containment products consist of portable liquid storage tanks for well-site liquid containment needs, expansion/upgrade projects, highway construction/groundwater sewage, infrastructure projects, major industrial projects, mining pit pump works, municipal sewer and water projects, non-residential construction projects, pipeline construction and maintenance, and refinery turnarounds. It also provides steps, ramps, furniture, portable toilets, security systems, shelving, mud pumps, hoses, splitter valves, tee connectors, and other items used in connection with leased equipment. In addition, the company offers temporary prison holding cells, hoarding units, blast-resistant units, workforce living accommodations, temporary retail frontage units, and observatory units customized from storage containers, as well as shipping container modifications, specialty trailers and tanks, chassis, storm shelters, and trash hoppers. The company was founded in 2005 and is headquartered in Pasadena, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Rental & Leasing Services", "Address": "39 East Union Street, Pasadena, CA, United States, 91103", "FullTimeEmployees": "1019", "FiscalYearEnd": "June", "LatestQuarter": "2020-03-31", "MarketCapitalization": "237144992", "EBITDA": "99196000", "PERatio": "153.2927", "PEGRatio": "0", "BookValue": "4.537", "DividendPerShare": "9.2", "DividendYield": "0.092", "EPS": "0.299", "RevenuePerShareTTM": "12.194", "ProfitMargin": "0.0353", "OperatingMarginTTM": "0.1695", "ReturnOnAssetsTTM": "0.0526", "ReturnOnEquityTTM": "0.0737", "RevenueTTM": "368188000", "GrossProfitTTM": "185259000", "DilutedEPSTTM": "0.299", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.044", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.1192", "52WeekHigh": "109.7245", "52WeekLow": "65", "50DayMovingAverage": "99.5975", "200DayMovingAverage": "96.0345", "SharesOutstanding": "30283000", "SharesFloat": "11570420", "SharesShort": "7", "SharesShortPriorMonth": "23", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "1", "PercentInstitutions": "17.325", "ForwardAnnualDividendRate": "9.2", "ForwardAnnualDividendYield": "0.092", "PayoutRatio": "0", "DividendDate": "2020-07-31", "ExDividendDate": "2020-07-29", "LastSplitFactor": "None", "LastSplitDate": "None"}