{"Symbol": "GFNSL", "AssetType": "Common Stock", "Name": "General Finance Corporation SR NT", "Description": "General Finance Corporation, a specialty rental services company, provides portable storage, modular space, and liquid containment solutions in North America and the Asia-Pacific regions. Its portable storage products include storage containers used in classroom equipment storage, construction equipment and tool storage, disaster shelters, landscaping sheds, recreational equipment storage, and retail inventory storage applications; and freight containers used in freight transportation by road and rail. The company's modular space products comprise office container products, modular buildings, and mobile offices used in various applications, such as general administrative office space, military installations, workforce living accommodations, bank branches, classrooms/education, construction offices, daycare facilities, dormitories, healthcare facilities, rental facilities, retail space, and shelters. Its liquid containment products consists of portable liquid storage tanks for well-site liquid containment needs, expansion/upgrade projects, highway construction/groundwater sewage, infrastructure projects, industrial projects, mining pit pump works, municipal sewer and water projects, non-residential construction projects, pipeline construction and maintenance, and refinery turnaround applications. The company provides ancillary products, such as steps, ramps, furniture, portable toilets, security systems, shelving, mud pumps, hoses, splitter valves, tee connectors, and other items used in connection with leased equipment. It also manufactures various steel-based products, such as chassis, storm shelters, blast-resistant modules, and specialty tanks. General Finance Corporation serves commercial, construction, transportation, industrial, energy, manufacturing, mining, retail, and education industries, as well as government clients. The company was founded in 2005 and is headquartered in Pasadena, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "848", "FiscalYearEnd": "June", "LatestQuarter": "2020-03-31", "MarketCapitalization": "670880960", "EBITDA": "None", "PERatio": "10.7224", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0.1157", "EPS": "0.5652", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "26.5", "52WeekLow": "18.71", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "4143", "SharesShortPriorMonth": "7197", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0.1157", "PayoutRatio": "0", "DividendDate": "2020-07-31", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}