{"Symbol": "GHDX", "AssetType": "Common Stock", "Name": "Genomic Health, Inc", "Description": "Genomic Health, Inc., a healthcare company, provides clinically actionable genomic information to personalize cancer treatment decisions in the United States and internationally. The company develops and commercializes genomic-based clinical laboratory services that analyze the underlying biology of cancer, which allows physicians and patients to make individualized treatment decisions. It offers the Oncotype DX invasive breast cancer test that is used for early stage invasive breast cancer patients to predict the breast cancer recurrence and chemotherapy benefit. The company also provides the Oncotype DX colon cancer test, which is used to predict the likelihood of colon cancer recurrence in patients with stage II disease, as well as for use in patients with stage III disease treated with oxaliplatin-containing adjuvant therapy; Oncotype DX prostate cancer test, which provides a genomic prostate score to predict disease aggressiveness in men with low risk prostate cancer, as well as to enhance treatment decisions for prostate cancer patients in conjunction with the Gleason score; and Oncotype DX AR-V7 nucleus detect tests for men with metastatic castration-resistant prostate cancer. In addition, it develops Oncoytpe DXi IVD breast recurrence score test; and Oncotype DX GPS test. The company offers its products through a network of distributors. Genomic Health, Inc. has license and development agreement with Biocartis N.V. to develop and commercialize an in vitro diagnostic of the Oncotype DX breast cancer test; collaboration agreement with Epic Sciences, Inc. to commercializeAR-V7 Nucleus Detect test; and license and development agreement with Cleveland Diagnostics, Inc. to develop and commercialize new prostate cancer tests. The company was founded in 2000 and is based in Redwood City, California. As of November 8, 2019, Genomic Health, Inc. operates as a subsidiary of Exact Sciences Corporation.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "301 Penobscot Drive\n94063,Redwood City,USA\n", "FullTimeEmployees": "829", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "2011177728", "EBITDA": "67904000", "PERatio": "48.9621", "PEGRatio": "-152.55", "BookValue": "9.295", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.456", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "72", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "76.48", "52WeekLow": "62.74", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}