{"Symbol": "GIFI", "AssetType": "Common Stock", "Name": "Gulf Island Fabrication, Inc", "Description": "Gulf Island Fabrication, Inc., together with its subsidiaries, operates as a fabricator of steel structures, modules, and marine vessels in the United States. It operates in three segments: Fabrication, Shipyard, and Services. The Fabrication segment fabricates modules and piping systems for onshore refining, petrochemical, LNG, and industrial facilities; foundations, secondary steel components, and support structures for alternative energy developments and coastal mooring facilities; offshore production platforms and associated structures; and other complex steel structures and components. The Shipyard segment fabricates new-build marine vessels, such as offshore support and multi-purpose service vessels, research and salvage vessels, tug boats, towboats, barges, drydocks, anchor handling vessels, and lift boats. It also performs steel repair, blasting, painting, electrical systems repair, and machinery and piping system repairs; and propeller, shaft, and rudder reconditioning services. In addition, this segment performs conversion projects to lengthen and modify vessels to permit their use for various type of activities. The Services segment provides welding, interconnect piping, and other services for offshore platforms; on-site construction and maintenance services on inland platforms and structures and industrial facilities; performs municipal and drainage projects, such as pump stations, levee reinforcement, bulkheads, and other public works; and fabricates skid units, modules, and piping systems. The company serves international energy producers; refining, petrochemical, liquefied natural gas, industrial, power, and marine operators; engineering, procurement, and construction companies; and various agencies of the U.S. government. The company was founded in 1985 and is headquartered in Houston, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Equipment & Services", "Address": "16225 Park Ten Place, Houston, TX, United States, 77084", "FullTimeEmployees": "944", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "44394940", "EBITDA": "-19448000", "PERatio": "None", "PEGRatio": "-0.29", "BookValue": "10.021", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.581", "RevenuePerShareTTM": "19.234", "ProfitMargin": "-0.1387", "OperatingMarginTTM": "-0.1119", "ReturnOnAssetsTTM": "-0.0761", "ReturnOnEquityTTM": "-0.2349", "RevenueTTM": "293776000", "GrossProfitTTM": "-16599000", "DilutedEPSTTM": "-2.667", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.255", "AnalystTargetPrice": "5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.1445", "PriceToBookRatio": "0.2774", "EVToRevenue": "0.011", "EVToEBITDA": "1.1894", "Beta": "1.0368", "52WeekHigh": "6.39", "52WeekLow": "2.67", "50DayMovingAverage": "3.0128", "200DayMovingAverage": "3.2651", "SharesOutstanding": "15308600", "SharesFloat": "13752791", "SharesShort": "116913", "SharesShortPriorMonth": "98848", "ShortRatio": "4.65", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0067", "PercentInsiders": "33.534", "PercentInstitutions": "65.28", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2017-11-24", "ExDividendDate": "2017-11-09", "LastSplitFactor": "2:1", "LastSplitDate": "1997-10-29"}