{"Symbol": "GIII", "AssetType": "Common Stock", "Name": "G-III Apparel Group, Ltd", "Description": "G-III Apparel Group, Ltd. designs, sources, and markets women's and men's apparel in the United States and internationally. The company operates in two segments, Wholesale Operations and Retail Operations. Its products include outerwear, dresses, sportswear, swimwear, women's suits, and women's performance wear; and women's handbags, footwear, small leather goods, cold weather accessories, and luggage. The company markets apparel and other products under the proprietary brand names, including DKNY, Donna Karan, Vilebrequin, G.H. Bass, Eliza J, Jessica Howard, Andrew Marc, Marc New York, Black Rivet, Wilsons, G-III Sports by Carl Banks, and G-III for Her; and licensed brands, such as Calvin Klein, Tommy Hilfiger, Karl Lagerfeld Paris, Guess?, Kenneth Cole, Cole Haan, Levi's, Vince Camuto, Kensie, and Dockers. It has licenses with the National Football League, Major League Baseball, National Basketball Association, and National Hockey League, as well as approximately 150 U.S. colleges and universities. The company offers its products to department, specialty, and mass merchant retail stores. As of January 31, 2020, it operated 282 leased retail stores, which include 124 stores under Wilsons Leather name, 99 stores under G.H. Bass brand, 43 stores under DKNY brand, 12 stores under licensed Karl Lagerfeld Paris brand, and 4 stores under licensed Calvin Klein Performance brand. The company also operates Wilsons Leather, G.H. Bass, DKNY, Donna Karan, Andrew Marc, and Karl Lagerfeld Paris online stores. G-III Apparel Group, Ltd. was founded in 1956 and is headquartered in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Apparel Retail", "Address": "512 Seventh Avenue, New York, NY, United States, 10018", "FullTimeEmployees": "4000", "FiscalYearEnd": "January", "LatestQuarter": "2020-04-30", "MarketCapitalization": "560295616", "EBITDA": "221336000", "PERatio": "5.9202", "PEGRatio": "0.98", "BookValue": "26.681", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.907", "RevenuePerShareTTM": "61.059", "ProfitMargin": "0.0316", "OperatingMarginTTM": "0.0621", "ReturnOnAssetsTTM": "0.0434", "ReturnOnEquityTTM": "0.076", "RevenueTTM": "2932043008", "GrossProfitTTM": "1117940000", "DilutedEPSTTM": "1.907", "QuarterlyEarningsGrowthYOY": "0.059", "QuarterlyRevenueGrowthYOY": "-0.361", "AnalystTargetPrice": "17.7", "TrailingPE": "5.9202", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.1839", "PriceToBookRatio": "0.4292", "EVToRevenue": "0.3802", "EVToEBITDA": "5.7054", "Beta": "2.4363", "52WeekHigh": "34.08", "52WeekLow": "2.96", "50DayMovingAverage": "11.0819", "200DayMovingAverage": "12.6411", "SharesOutstanding": "48052800", "SharesFloat": "41684365", "SharesShort": "8005155", "SharesShortPriorMonth": "7865387", "ShortRatio": "6.81", "ShortPercentOutstanding": "0.17", "ShortPercentFloat": "0.224", "PercentInsiders": "10.875", "PercentInstitutions": "100.44", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2015-05-04"}