{"Symbol": "GLBZ", "AssetType": "Common Stock", "Name": "Glen Burnie Bancorp", "Description": "Glen Burnie Bancorp operates as the bank holding company for The Bank of Glen Burnie that provides commercial and retail banking services to individuals, associations, partnerships, and corporations. The company accepts various deposits, including savings accounts, money market deposit accounts, demand deposit accounts, NOW checking accounts, IRA and SEP accounts, and certificates of deposit. It also provides residential and commercial real estate, construction, land acquisition and development, and secured and unsecured commercial loans, as well as consumer installment lending, such as indirect automobile lending services; and residential first and second mortgage loans, home equity lines of credit, and commercial mortgage loans. In addition, the company offers ancillary products and services comprising safe deposit boxes, money orders, night depositories, automated clearinghouse transactions, automated teller machine services, and telephone and Internet banking services. Further, it provides treasury services, including wire transfer and ACH services, and debit cards; and telephone, mobile, and Internet banking services, as well as Internet bill paying services. Additionally, the company engages in the business of acquiring, holding, and disposing of real property. It serves customers in northern Anne Arundel county and surrounding areas from its main office and branch in Glen Burnie, Maryland; and branch offices in Odenton, Riviera Beach, Crownsville, Severn, Linthicum, and Severna Park, Maryland. The company also has a remote ATM located in Pasadena, Maryland. Glen Burnie Bancorp was founded in 1949 and is based in Glen Burnie, Maryland.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "101 Crain Highway, S.E., Glen Burnie, MD, United States, 21061", "FullTimeEmployees": "102", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "28809352", "EBITDA": "None", "PERatio": "20.6383", "PEGRatio": "0", "BookValue": "12.655", "DividendPerShare": "0.4", "DividendYield": "0.0412", "EPS": "0.466", "RevenuePerShareTTM": "4.751", "ProfitMargin": "0.0982", "OperatingMarginTTM": "0.1358", "ReturnOnAssetsTTM": "0.0033", "ReturnOnEquityTTM": "0.0373", "RevenueTTM": "13436000", "GrossProfitTTM": "13997000", "DilutedEPSTTM": "0.466", "QuarterlyEarningsGrowthYOY": "0.976", "QuarterlyRevenueGrowthYOY": "-0.206", "AnalystTargetPrice": "None", "TrailingPE": "20.6383", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.0284", "PriceToBookRatio": "0.7676", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.7549", "52WeekHigh": "11.8", "52WeekLow": "7.05", "50DayMovingAverage": "8.8044", "200DayMovingAverage": "9.0512", "SharesOutstanding": "2838360", "SharesFloat": "2248632", "SharesShort": "637", "SharesShortPriorMonth": "92", "ShortRatio": "0.6", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0006", "PercentInsiders": "20.992", "PercentInstitutions": "3.215", "ForwardAnnualDividendRate": "0.4", "ForwardAnnualDividendYield": "0.0412", "PayoutRatio": "0.8511", "DividendDate": "2020-07-31", "ExDividendDate": "2020-07-17", "LastSplitFactor": "120:100", "LastSplitDate": "2008-01-10"}