{"Symbol": "GNBC", "AssetType": "Common Stock", "Name": "Green Bancorp, Inc", "Description": "Green Bancorp, Inc. operates as the bank holding company for Green Bank, N.A. that provides commercial and private banking services primarily in Texas. It offers deposit accounts, such as demand, savings, money market, and time accounts. The company also provides loans, including commercial and industrial loans, including commercial lines of credit, working capital loans, commercial real estate-backed loans, mortgage-warehouse lines, term loans, equipment financing, borrowing base loans, real estate construction loans, homebuilder loans, government guaranteed loans, purchased receivables financing, letters of credit, and other loan products, as well as acquisition, expansion, and development loans to national and regional companies, real estate developers, mortgage lenders, manufacturing and industrial companies, and other businesses. In addition, it offers various consumer loans, such as residential real estate loans, home equity loans, installment loans, unsecured and secured personal lines of credit, overdraft protection, and letters of credit. Further, the company provides a range of online banking solutions, including access to account balances, online transfers, online bill payment, and electronic delivery of customer statements; and extended drive-through hours, and ATMs, as well as banking through telephone, mail, and personal appointment. Additionally, it offers debit cards, night depository services, direct deposits, and cashier's checks, as well as treasury management, wire transfer, and automated clearing house services. The company provides its services through 22 full service branches in the greater Houston and Dallas metropolitan areas, as well as in Austin, Louisville, and Honey Grove. Green Bancorp, Inc. was founded in 1999 and is headquartered in Houston, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "4000 Greenbriar\n77098,Houston,USA\n", "FullTimeEmployees": "368", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "640525184", "EBITDA": "None", "PERatio": "14.6246", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "27.75", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}