{"Symbol": "GRFS", "AssetType": "Common Stock", "Name": "Grifols, S.A", "Description": "Grifols, S.A. develops, manufactures, and distributes a range of biological medicines on plasma derived proteins worldwide. The company operates in five segments: Bioscience, Diagnostic, Hospital, Bio Supplies, and Others. The Bioscience segment manufactures plasma derivatives for therapeutic use; and sells and distributes end products. It offers intravenous immune globulin, Factor VIII, alpha-1 proteinase inhibitor, and albumin; and intramuscular immunoglobulins, antithrombin III, Factor IX, and plasma thromboplastin components. The Diagnostic segment focuses on researching, developing, manufacturing, and marketing in vitro diagnostics products, including analytical instruments, reagents, software, and related products for use in clinical and blood bank laboratories. It serves blood donation centers, clinical analysis laboratories, and hospital immunohematology services. The Hospital segment offers products used by hospitals, as well as parenteral solutions and enteral nutritional fluids. The Bio Supplies segment provides biological products for non-therapeutic uses. The Others segment renders manufacturing services to third party companies. The company also provides infusion solutions, nutrition products, and medical devices for use in hospitals and clinics; and engineering services. Its products and services are used by healthcare providers to diagnose and treat patients with hemophilia, immune deficiencies, infectious diseases, and other medical conditions. The company serves hospitals and clinics, group purchasing organizations, governments, and other distributors through sales representatives, marketing partners, and third-party distributors. Grifols, S.A. has a technology collaboration agreement with Mondragon; and a formal collaboration with the United States Biomedical Advanced Research Development Authority, the Food and Drug Administration, and other Federal public health agencies. The company was founded in 1940 and is headquartered in Barcelona, Spain.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "Avinguda de la Generalitat, 152, Barcelona, Spain, 08174", "FullTimeEmployees": "24162", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "15583382528", "EBITDA": "None", "PERatio": "16.9", "PEGRatio": "1.3375", "BookValue": "3.5575", "DividendPerShare": "0.44", "DividendYield": "0.0274", "EPS": "0.5995", "RevenuePerShareTTM": "0", "ProfitMargin": "0.104", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0.0429", "ReturnOnEquityTTM": "0.1033", "RevenueTTM": "0", "GrossProfitTTM": "2341232000", "DilutedEPSTTM": "0.5995", "QuarterlyEarningsGrowthYOY": "-0.8", "QuarterlyRevenueGrowthYOY": "0.093", "AnalystTargetPrice": "26.75", "TrailingPE": "16.9", "ForwardPE": "11.9904", "PriceToSalesRatioTTM": "1.7508", "PriceToBookRatio": "1.7467", "EVToRevenue": "4.3135", "EVToEBITDA": "17.0285", "Beta": "0.3171", "52WeekHigh": "25.73", "52WeekLow": "13.4", "50DayMovingAverage": "18.3664", "200DayMovingAverage": "19.8285", "SharesOutstanding": "684140032", "SharesFloat": "1102630097", "SharesShort": "2663646", "SharesShortPriorMonth": "2855345", "ShortRatio": "2.12", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "53.682", "ForwardAnnualDividendRate": "0.44", "ForwardAnnualDividendYield": "0.0274", "PayoutRatio": "0.2487", "DividendDate": "2019-12-11", "ExDividendDate": "2019-12-02", "LastSplitFactor": "2:1", "LastSplitDate": "2016-01-04"}