{"Symbol": "GRMN", "AssetType": "Common Stock", "Name": "Garmin Ltd", "Description": "Garmin Ltd. designs, develops, manufactures, markets, and distributes a range of navigation, communication, and information devices worldwide. It operates through five segments: Auto, Aviation, Marine, Outdoor, and Fitness. The Auto segment offers personal navigation devices; infotainment systems; and cameras, as well as mobile applications. The Aviation segment provides flight display, navigation, communication, flight control, hazard avoidance, weather radar, radar altimeter, and in-cockpit and cloud connectivity products; datalink weather receivers and services; engine information, traffic collision avoidance, and terrain awareness and warning systems; wearables, portables, and apps; and training, simulation, flight planning/filing, premium trip, and aviation data services. This segment also offers controller-pilot data link, a suite of automatic dependent surveillance broadcast solutions. The Marine segment provides chartplotters and multi-function displays, cartography products, fish finders, sounders, autopilot systems, radars, compliant instrument displays, VHF communication radios, handhelds and wearable devices, sailing products, entertainment, and digital switching equipment. The Outdoor segment offers outdoor handhelds, smartwatches, golf devices, and dog tracking and training devices; Garmin Connect and Garmin Connect Mobile, which are Web and mobile platforms; and Connect IQ application development platform. The Fitness segment provides running/multi-sport watches, cycling computers, cycling power meters, cycling safety and awareness products, and activity tracking devices. The company sells its global positioning system receivers and accessories to retail outlets; and aviation products to aviation dealers and aircraft manufacturers through a network of independent dealers and distributors. Garmin Ltd. was founded in 1990 and is based in Schaffhausen, Switzerland.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "Muhlentalstrasse 2, Schaffhausen, Switzerland, 8200", "FullTimeEmployees": "15000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "19842750464", "EBITDA": "1016827008", "PERatio": "21.0184", "PEGRatio": "4.3425", "BookValue": "24.792", "DividendPerShare": "2.44", "DividendYield": "0.0238", "EPS": "4.877", "RevenuePerShareTTM": "19.749", "ProfitMargin": "0.2482", "OperatingMarginTTM": "0.2402", "ReturnOnAssetsTTM": "0.0962", "ReturnOnEquityTTM": "0.2101", "RevenueTTM": "3762589952", "GrossProfitTTM": "2233976000", "DilutedEPSTTM": "4.877", "QuarterlyEarningsGrowthYOY": "-0.179", "QuarterlyRevenueGrowthYOY": "-0.089", "AnalystTargetPrice": "106.71", "TrailingPE": "21.0184", "ForwardPE": "26.455", "PriceToSalesRatioTTM": "5.2174", "PriceToBookRatio": "4.1375", "EVToRevenue": "4.7678", "EVToEBITDA": "17.6426", "Beta": "0.9885", "52WeekHigh": "105.5", "52WeekLow": "61.04", "50DayMovingAverage": "101.2856", "200DayMovingAverage": "89.8146", "SharesOutstanding": "191236992", "SharesFloat": "140098640", "SharesShort": "4497371", "SharesShortPriorMonth": "5275583", "ShortRatio": "2.66", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0176", "PercentInsiders": "26.758", "PercentInstitutions": "49.44", "ForwardAnnualDividendRate": "2.44", "ForwardAnnualDividendYield": "0.0238", "PayoutRatio": "0.4754", "DividendDate": "2021-03-31", "ExDividendDate": "2020-09-14", "LastSplitFactor": "2:1", "LastSplitDate": "2006-08-16"}