{"Symbol": "GUID", "AssetType": "Common Stock", "Name": "Guidance Software, Inc", "Description": "Guidance Software, Inc., a technology company, provides forensic security solutions in the United States, Europe, Asia, and internationally. The compay operates through five segments: Products, Subscription, Professional Services, Training, and Maintenance. It provides endpoint investigation solutions for cybersecurity, security incident response, e-discovery, data privacy, and forensic analysis. The company's products include EnCase Endpoint Security, which offers crucial IT cybersecurity functionality; and EnCase Endpoint Investigator, an investigative platform that enables an organization to search, collect, preserve, and analyze data on the servers, desktops, and laptops across the network. Its products also comprise EnForce Risk Manager, a data risk and privacy solution; EnCase Forensic, a forensic investigation solution that enables forensic practitioners to conduct digital data collection and investigations; and EnCase eDiscovery, an e-discovery solution, which addresses the end-to-end e-discovery needs, as well as EnCase and EnCase Portable products. In addition, the company offers Tableau forensic appliances, including write blockers, forensic duplicators, and storage devices; and consulting services, such as cybersecurity incident response, e-discovery, implementation, guidance software advisory program, cloud review, training, and civil/criminal forensic investigation services, as well as customer and technical support, packaged, and maintenance services. It serves government agencies and corporations in the financial and insurance services, technology, defense contracting, telecom, pharmaceutical, healthcare, manufacturing, and retail industries. The company was founded in 1997 and is headquartered in Pasadena, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "1055 East Colorado Boulevard\n91106,Pasadena,USA\n", "FullTimeEmployees": "350", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-0.24", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "8.04", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}