{"Symbol": "HAIN", "AssetType": "Common Stock", "Name": "The Hain Celestial Group, Inc", "Description": "The Hain Celestial Group, Inc. manufactures, markets, and sells organic and natural products in United States, United Kingdom, and internationally. It operates through two segments, North America and International. The company offers infant formula; infant, toddler, and kids food; plant-based beverages and frozen desserts, such as soy, rice, oat, almond, and coconut; and condiments. It also provides cooking and culinary oils; cereal bars; canned, chilled fresh, aseptic, and instant soups; yogurts, chilis, chocolate, and nut butters; and juices. In addition, the company offers hot-eating desserts, cookies, frozen fruit and vegetables, pre-cut fresh fruits, refrigerated and frozen plant-based meat-alternative products, jams, fruit spreads, jellies, honey, natural sweeteners, and marmalade products, as well as other food products. Further, it provides snack products comprising potato, root vegetable and other exotic vegetable chips, straws, tortilla chips, whole grain chips, pita chips, and puffs; and personal care products that include hand, skin, hair, and oral care products, as well as deodorants, baby care items, body washes, sunscreens, and lotions under the Alba Botanica, Avalon Organics, Earth's Best, JASON, Live Clean, and Queen Helene brands name. Additionally, the company offers herbal, green, black, wellness, rooibos, and chai tea under the Celestial Seasonings brand. It sells pantry products under the Spectrum, Spectrum Essentials, MaraNatha, Imagine broths, Hain Pure Foods, Health Valley, Hollywood, Westbrae, Almond Dream, Coconut Dream, Rice Dream, Oat Dream, Soy Dream, and DreamTM brand names. It sells its products through specialty and natural food distributors, supermarkets, natural food stores, mass-market and e-commerce retailers, food service channels and clubs, and drug and convenience stores in approximately 75 countries worldwide. The company was founded in 1993 and is headquartered in Lake Success, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Packaged Foods", "Address": "1111 Marcus Avenue, Lake Success, NY, United States, 11042-1034", "FullTimeEmployees": "4287", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3245069056", "EBITDA": "186019008", "PERatio": "129.4", "PEGRatio": "1.1441", "BookValue": "14.168", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.761", "RevenuePerShareTTM": "19.822", "ProfitMargin": "-0.0392", "OperatingMarginTTM": "0.0652", "ReturnOnAssetsTTM": "0.0351", "ReturnOnEquityTTM": "0.0173", "RevenueTTM": "2053902976", "GrossProfitTTM": "469945000", "DilutedEPSTTM": "-0.776", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.013", "AnalystTargetPrice": "34.3", "TrailingPE": "129.4", "ForwardPE": "30.3951", "PriceToSalesRatioTTM": "1.6371", "PriceToBookRatio": "2.2833", "EVToRevenue": "1.7644", "EVToEBITDA": "34.7878", "Beta": "0.8236", "52WeekHigh": "34.53", "52WeekLow": "18.12", "50DayMovingAverage": "33.1633", "200DayMovingAverage": "29.0454", "SharesOutstanding": "101954000", "SharesFloat": "83445911", "SharesShort": "8539101", "SharesShortPriorMonth": "8220908", "ShortRatio": "19.08", "ShortPercentOutstanding": "0.08", "ShortPercentFloat": "0.1025", "PercentInsiders": "2.518", "PercentInstitutions": "105.703", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2014-12-30"}