{"Symbol": "HBANP", "AssetType": "Common Stock", "Name": "Huntington Bancshares Incorporated", "Description": "Huntington Bancshares Incorporated operates as a holding company for The Huntington National Bank that provides commercial, small business, consumer, and mortgage banking services. The company's Consumer and Business Banking segment offers financial products and services, such as checking accounts, savings accounts, money market accounts, certificates of deposit, consumer loans, and small business loans; and investments, mortgages, insurance, interest rate risk protection, and foreign exchange and treasury management services. Its Commercial Banking segment provides corporate risk management services; institutional sales, trading, and underwriting services; treasury management services; and other financing solutions, as well as lends real estate developers, REITs, and other customers. The company's Vehicle Finance segment offers financing for automobiles, light-duty trucks, recreational vehicles, and marine craft at franchised dealerships; and financing the acquisition of new and used vehicle inventory of franchised dealerships. Its Regional Banking and The Huntington Private Client Group segment provides deposits, lending, other banking, wealth management, investment and portfolio management, fiduciary administration, trust, retirement plan and trust, and institutional and mutual fund custody services. The company provides online, mobile, and telephone banking services, as well as ATM services. As of December 31, 2017, it had 10 private client group offices and 956 branches. The company was founded in 1866 and is headquartered in Columbus, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "15770", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "17258813440", "EBITDA": "None", "PERatio": "1316", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "0.72", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}