{"Symbol": "HBHC", "AssetType": "Common Stock", "Name": "Hancock Holding Company", "Description": "Hancock Holding Company operates as the bank holding company for Whitney Bank that provides a range of community banking services to commercial, small business, and retail customers. The company offers various deposit products, including noninterest-bearing demand deposits, interest-bearing transaction accounts, savings accounts, money market deposit accounts, and time deposit accounts. It also provides commercial and industrial; commercial real estate; construction and land development; and residential mortgages, including fixed and adjustable rate loans; and consumer loans comprising second lien mortgage home loans, home equity lines of credit, and nonresidential consumer purpose loans. In addition, the company offers treasury management services, investment brokerage services, letters of credit and financial guarantees, and revolving credit facilities. Further, it provides trust and investment management services to retirement plans, corporations, and individuals. Additionally, the company provides insurance agency services, discount investment brokerage services, life insurance, and consumer financing services, as well as operates and sells foreclosed assets. It operates approximately 237 full service banking and financial services offices and 277 automated teller machines in Gulf south corridor, south Mississippi; southern and central Alabama; southern Louisiana; the northern, central, and Panhandle regions of Florida; and Houston, Texas under the Hancock and Whitney Bank brand names, as well as operates a loan production office in Nashville, Tennessee. Hancock Holding Company was founded in 1883 and is headquartered in Gulfport, Mississippi.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "3887", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "4405073920", "EBITDA": "None", "PERatio": "20.8266", "PEGRatio": "2.28", "BookValue": "33.861", "DividendPerShare": "0.96", "DividendYield": "0.0195", "EPS": "2.4", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "52.68", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}