{"Symbol": "HBIO", "AssetType": "Common Stock", "Name": "Harvard Bioscience, Inc", "Description": "Harvard Bioscience, Inc. provides scientific instruments, systems, software, and services used in life science basic research, drug discovery, and clinical and environmental testing. The company offers physiology, cell, and molecular instruments, such as traditional syringe pump and peristaltic pump products, as well as a range of instruments and accessories for tissue, organ, and animal based lab research under the Harvard Apparatus, CMA Microdialysis, Panlab, Coulbourn, and Hugo Sachs brands; and spectrophotometers, microplate readers, amino acid analyzers, gel electrophoresis equipment, sample preparation plates and columns, and electroporation and electrofusion instruments under the Biochrom, BioDrop, Hoefer, Scie-plas, QuikPrep, and BTX brands. It also designs, develops, and manufactures precision electrophysiology equipment specializing in patch clamp amplifiers, and manual and automated patch clamp systems under the HEKA brand; manufactures tools for electrophysiology and cell biology research consisting of cell chambers, perfusion and temperature controllers, and microincubation and bio-sensing systems under the Warner Instruments brand; and designs and develops in vivo neural interface systems under the TBSI brand for neuroscience research, primarily in the fields of electrophysiology, psychology, neurology, and pharmacology. In addition, the company is involved in the development and manufacture of precision scientific measuring instrumentation and equipment under the Multi-Channel Systems brand; and physiologic monitoring focused on delivering preclinical products, systems, services, and solutions under the DSI and Buxco brands. It markets its products in approximately 100 countries through sales organizations, Websites, catalogs, and distributors to research scientists at pharmaceutical and biotechnology companies, universities, hospitals, and government laboratories. The company was founded in 1901 and is headquartered in Holliston, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "84 October Hill Road, Holliston, MA, United States, 01746", "FullTimeEmployees": "505", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "131236896", "EBITDA": "6064000", "PERatio": "147.5", "PEGRatio": "2.89", "BookValue": "1.967", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.1239", "RevenuePerShareTTM": "2.763", "ProfitMargin": "-0.0774", "OperatingMarginTTM": "-0.0161", "ReturnOnAssetsTTM": "-0.0067", "ReturnOnEquityTTM": "-0.1044", "RevenueTTM": "105469000", "GrossProfitTTM": "64557000", "DilutedEPSTTM": "-0.214", "QuarterlyEarningsGrowthYOY": "-0.803", "QuarterlyRevenueGrowthYOY": "-0.212", "AnalystTargetPrice": "4.5", "TrailingPE": "147.5", "ForwardPE": "42.3729", "PriceToSalesRatioTTM": "1.3209", "PriceToBookRatio": "1.8686", "EVToRevenue": "1.8335", "EVToEBITDA": "38.5672", "Beta": "1.5516", "52WeekHigh": "4.41", "52WeekLow": "1.39", "50DayMovingAverage": "3.4775", "200DayMovingAverage": "2.871", "SharesOutstanding": "38942700", "SharesFloat": "34633675", "SharesShort": "2445704", "SharesShortPriorMonth": "1489341", "ShortRatio": "9.33", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.039", "PercentInsiders": "14.796", "PercentInstitutions": "67.768", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1319:1000", "LastSplitDate": "2013-11-04"}