{"Symbol": "HCKT", "AssetType": "Common Stock", "Name": "The Hackett Group, Inc", "Description": "The Hackett Group, Inc. operates as a strategic advisory and technology consulting firm primarily in North America and European countries. Its executive advisory programs include best practice intelligence center, an online searchable repository of best practices, performance metrics, conference presentations, and associated research; best practice accelerators that provide Web-based access to best practices, customized software configuration tools, and best practice process flows; advisor inquiry, an inquiry service used by clients for access to fact-based advice on proven approaches and methods; best practice research, a research that provides insights into the proven approaches; and peer interaction comprising member-led Webcasts, annual best practice conferences, annual member forums, membership performance surveys, and client-submitted content. The company's benchmarking services conduct studies in the areas of selling, general and administrative, finance, human resources, information technology, procurement, enterprise performance management, and shared services; and business transformation practices help clients to develop coordinated strategy for achieving performance enhancements across the enterprise. It also provides Oracle EEA solutions in the areas of core financial close and consolidation, integrated business planning, and reporting/advanced analytics. In addition, the company offers SAP Solutions, including planning, architecture, and vendor evaluation and selection through implementation, customization, testing, and integration; post-implementation support, change management, exception management, process transparency, system documentation, and end-user training; and off-shore application development, and application maintenance and support services. The company was formerly known as Answerthink, Inc. and changed its name to The Hackett Group, Inc. in 2008. The Hackett Group, Inc. was founded in 1991 and is headquartered in Miami, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "1001 Brickell Bay Drive, Miami, FL, United States, 33131", "FullTimeEmployees": "1110", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "385983232", "EBITDA": "30787000", "PERatio": "37.4555", "PEGRatio": "1.3233", "BookValue": "4.545", "DividendPerShare": "0.38", "DividendYield": "0.0304", "EPS": "0.331", "RevenuePerShareTTM": "8.303", "ProfitMargin": "0.0434", "OperatingMarginTTM": "0.1062", "ReturnOnAssetsTTM": "0.0859", "ReturnOnEquityTTM": "0.0806", "RevenueTTM": "248308992", "GrossProfitTTM": "97616000", "DilutedEPSTTM": "0.331", "QuarterlyEarningsGrowthYOY": "-0.233", "QuarterlyRevenueGrowthYOY": "-0.226", "AnalystTargetPrice": "19.33", "TrailingPE": "37.4555", "ForwardPE": "17.8571", "PriceToSalesRatioTTM": "1.536", "PriceToBookRatio": "2.7523", "EVToRevenue": "1.3151", "EVToEBITDA": "22.2354", "Beta": "0.7346", "52WeekHigh": "18.07", "52WeekLow": "9.5", "50DayMovingAverage": "13.4725", "200DayMovingAverage": "13.7465", "SharesOutstanding": "30061000", "SharesFloat": "24869725", "SharesShort": "279949", "SharesShortPriorMonth": "184185", "ShortRatio": "2.8", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0129", "PercentInsiders": "17.381", "PercentInstitutions": "80.021", "ForwardAnnualDividendRate": "0.38", "ForwardAnnualDividendYield": "0.0304", "PayoutRatio": "0.8237", "DividendDate": "2020-10-09", "ExDividendDate": "2020-09-24", "LastSplitFactor": "None", "LastSplitDate": "None"}