{"Symbol": "HDS", "AssetType": "Common Stock", "Name": "HD Supply Holdings, Inc", "Description": "HD Supply Holdings, Inc. operates as an industrial distributor in North America. It operates in two segments, Facilities Maintenance, and Construction & Industrial. The Facilities Maintenance segment offers electrical and lighting items, plumbing supplies, appliances, janitorial supplies, hardware products, kitchen and bath cabinets, window coverings, textiles and guest amenities, healthcare maintenance products, water and wastewater treatment products, and heating, ventilating, and air conditioning products. This segment also distributes maintenance, repair, and operations products; and provides value-add services, as well as fabricates custom products. The Construction & Industrial segment distributes hardware, tools, engineered materials, and safety products, as well as offers pre-bid assistance, product submittal, engineering, and tool repair services. Its products include tilt-up brace systems, forming and shoring systems, concrete chemicals, hand and power tools, cutting tools, rebars, ladders, safety and fall arrest equipment, specialty screws and fasteners, sealants and adhesives, drainage pipes, geo-synthetics, erosion and sediment control equipment, and other engineered materials. This segment also offers home improvement solutions, such as light remodeling and construction supplies, kitchen and bath cabinets, windows, plumbing materials, electrical equipment, and other products. The company has approximately 270 branches and 44 distribution centers. It sells its products primarily through a professional sales force, print catalog, and e-commerce channels to approximately 500,000 customers consisting of contractors, maintenance professionals, home builders, industrial businesses, and government entities. The company was formerly known as HDS Investment Holding, Inc. and changed its name to HD Supply Holdings, Inc. in April 2013. HD Supply Holdings, Inc. was founded in 2007 and is headquartered in Atlanta, Georgia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Industrial Distribution", "Address": "3400 Cumberland Boulevard SE, Atlanta, GA, United States, 30339", "FullTimeEmployees": "11000", "FiscalYearEnd": "January", "LatestQuarter": "2020-05-03", "MarketCapitalization": "6544558080", "EBITDA": "786000000", "PERatio": "16.0734", "PEGRatio": "2.1164", "BookValue": "8.72", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.532", "RevenuePerShareTTM": "36.853", "ProfitMargin": "0.069", "OperatingMarginTTM": "0.1149", "ReturnOnAssetsTTM": "0.0915", "ReturnOnEquityTTM": "0.2983", "RevenueTTM": "6048000000", "GrossProfitTTM": "2403000000", "DilutedEPSTTM": "2.532", "QuarterlyEarningsGrowthYOY": "-0.289", "QuarterlyRevenueGrowthYOY": "-0.066", "AnalystTargetPrice": "43.5", "TrailingPE": "16.0734", "ForwardPE": "15.9236", "PriceToSalesRatioTTM": "1.1024", "PriceToBookRatio": "4.6437", "EVToRevenue": "1.4791", "EVToEBITDA": "11.3378", "Beta": "1.1648", "52WeekHigh": "43.37", "52WeekLow": "21.69", "50DayMovingAverage": "37.7686", "200DayMovingAverage": "33.8238", "SharesOutstanding": "161994000", "SharesFloat": "160289413", "SharesShort": "5361286", "SharesShortPriorMonth": "4662795", "ShortRatio": "5.16", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.039", "PercentInsiders": "1.01", "PercentInstitutions": "99.362", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}