{"Symbol": "HLIT", "AssetType": "Common Stock", "Name": "Harmonic Inc", "Description": "Harmonic Inc. designs, manufactures, and sells video infrastructure products and system solutions worldwide. Its products enable customers to create, prepare, and deliver a range of video and broadband services to consumer devices, including televisions, personal computers, laptops, tablets, and smart phones. The company operates in two segments, Video and Cable Access. The Video segment sells video processing, and production and playout solutions and services to cable operators, and satellite and telecommunications Pay-TV service providers, as well as to broadcast and media, including streaming media companies. This segment's video processing solutions include network management and application software, and hardware products, such as cloud media processing, broadcast and over-the-top encoders, contribution encoders, high-density transcoders and stream processing, multiscreen delivery, decoders and descramblers, and video servers. This segment also provides video-optimized storage systems; and unified video playout and processing software-as-a-service solutions. The Cable Access segment offers cable edge solutions and related services, including CableOS software-based cable access solutions; and narrowcast services gateway products primarily to cable operators. The company also provides technical support and professional services, such as maintenance and support, consulting, implementation, program management, technical design and planning, building and site preparation, integration and equipment installation, system testing, and training. Harmonic Inc. sells its products through its direct sales force, as well as through independent resellers and systems integrators. The company was founded in 1988 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "4300 North First Street, San Jose, CA, United States, 95134", "FullTimeEmployees": "1172", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "572883136", "EBITDA": "23871000", "PERatio": "None", "PEGRatio": "-0.21", "BookValue": "2.377", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.315", "RevenuePerShareTTM": "4.178", "ProfitMargin": "-0.0516", "OperatingMarginTTM": "0.0158", "ReturnOnAssetsTTM": "0.0071", "ReturnOnEquityTTM": "-0.091", "RevenueTTM": "390313984", "GrossProfitTTM": "224403000", "DilutedEPSTTM": "-0.215", "QuarterlyEarningsGrowthYOY": "0.511", "QuarterlyRevenueGrowthYOY": "-0.128", "AnalystTargetPrice": "8.07", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.4314", "PriceToBookRatio": "2.5301", "EVToRevenue": "1.7735", "EVToEBITDA": "65.2533", "Beta": "0.8313", "52WeekHigh": "8.57", "52WeekLow": "4.44", "50DayMovingAverage": "5.8219", "200DayMovingAverage": "5.6979", "SharesOutstanding": "97429104", "SharesFloat": "85099455", "SharesShort": "6850342", "SharesShortPriorMonth": "6744858", "ShortRatio": "7.95", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.1001", "PercentInsiders": "3.782", "PercentInstitutions": "87.682", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "1999-10-15"}