{"Symbol": "HNH", "AssetType": "Common Stock", "Name": "Handy and Harman Ltd", "Description": "Handy & Harman Ltd. manufactures and sells engineered niche industrial products in the United States and internationally. Its Joining Materials segment fabricates precious metals and their alloys into brazing alloys, such as gold, silver, palladium, copper, nickel, aluminum, and tin. The company?s Tubing segment provides seamless stainless steel tubing coils for petrochemical infrastructure and shipbuilding markets; small diameter coil tubing to the aerospace, defense, and semiconductor fabrication markets; and welded carbon steel tubing products in coiled and straight lengths for transportation, appliance and heating, and oil and gas industries. Its Building Materials segment offers fasteners and fastening systems for the commercial low slope roofing industry; and engineered specialty fasteners for the building products industry. The company?s Performance Materials segment provides sheet and mechanically formed glass, quartz, carbon, and aramid materials for specialty applications. Its Electrical Products segment offers power electronics, motion control, power protection, power quality electromagnetic equipment, and custom gears and gearboxes. The company?s Kasco Blades and Route Repair Services segment provides meat-room blade products, repair services, and resale products for the meat and deli departments of supermarkets, restaurants, and meat and fish processing plants, as well as for distributors of electrical saws and cutting equipment; and wood cutting blade products for the pallet manufacturing, pallet recycler, and portable saw mill industries. It sells its products and services through direct sales forces, distributors, and manufacturer?s representatives to the construction, electrical, electronics, transportation, power control, utility, medical, oil and gas exploration, aerospace and defense, and food industries. The company was founded in 1852 and is based in New York, New York. Handy & Harman Ltd. is a subsidiary of Steel Partners Holdings L.P.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "590 Madison Avenue, 32nd Floor\n10022,New York,USA\n", "FullTimeEmployees": "3470", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "0.71", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}