{"Symbol": "HSKA", "AssetType": "Common Stock", "Name": "Heska Corporation", "Description": "Heska Corporation manufactures, sells, and markets veterinary diagnostic and specialty products for canine and feline healthcare markets in the United States, Canada, Europe, and internationally. The company's Core Companion Animal segment offers Element DC and DRI-CHEM 7000 veterinary chemistry analyzers for blood chemistry and electrolyte analysis; Element HT5 and HemaTrue veterinary hematology analyzers to measure blood cell and platelet count, and hemoglobin levels; Element POC blood gas and electrolyte analyzers; Element i immunodiagnostic analyzers; Element COAG veterinary analyzers; and IV infusion pumps. It also provides digital radiography hardware and mobile digital radiography products, as well as ultrasound systems; Cloudbank, a Web-based image storage solution; ViewCloud, a picture archival and communications system for Cloudbank; point-of-care heartworm diagnostic test products for dogs and cats; Tri-Heart Plus chewable tablets for the treatment of canine heartworm infection, and treatment and control of ascarid and hookworm infections; and allergy products and services, including ALLERCEPT definitive allergen panels, and therapy shots or drops. The company's Other Vaccines and Pharmaceuticals segment offers a line of bovine vaccines; biological and pharmaceutical products for other animal health companies; and various turnkey services comprising research, licensing, production, labeling, and packaging, as well as provides validation support and distribution services. Heska Corporation sells its products to veterinarians through a field organization, a telephone sales force, and third party distributors; and trade shows, print advertising, and other distribution relationships. The company was formerly known as Paravax, Inc. and changed its name to Heska Corporation in 1995. Heska Corporation was founded in 1988 and is headquartered in Loveland, Colorado.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "3760 Rocky Mountain Avenue, Loveland, CO, United States, 80538", "FullTimeEmployees": "386", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "975913984", "EBITDA": "4877000", "PERatio": "213.9271", "PEGRatio": "2.53", "BookValue": "28.683", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.466", "RevenuePerShareTTM": "18.131", "ProfitMargin": "-0.0968", "OperatingMarginTTM": "-0.0099", "ReturnOnAssetsTTM": "-0.0032", "ReturnOnEquityTTM": "-0.0719", "RevenueTTM": "141370000", "GrossProfitTTM": "54449000", "DilutedEPSTTM": "-1.76", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.624", "AnalystTargetPrice": "96.17", "TrailingPE": "0", "ForwardPE": "243.9024", "PriceToSalesRatioTTM": "5.5352", "PriceToBookRatio": "3.5097", "EVToRevenue": "6.5436", "EVToEBITDA": "729.0801", "Beta": "1.667", "52WeekHigh": "110.9", "52WeekLow": "50", "50DayMovingAverage": "100.3619", "200DayMovingAverage": "85.0911", "SharesOutstanding": "9443720", "SharesFloat": "8069279", "SharesShort": "576963", "SharesShortPriorMonth": "556370", "ShortRatio": "6.35", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0596", "PercentInsiders": "7.912", "PercentInstitutions": "106.706", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2012-10-10", "ExDividendDate": "2012-09-26", "LastSplitFactor": "1:10", "LastSplitDate": "2010-12-30"}