{"Symbol": "HSTM", "AssetType": "Common Stock", "Name": "HealthStream, Inc", "Description": "HealthStream, Inc. provides workforce and provider solutions for healthcare organizations in the United States. It operates through two segments, Workforce Solutions and Provider Solutions. The company offers workforce solutions, including software-as-a-service (SaaS) based services and subscription-based solutions to meet the training, certification, competency assessment, development, clinical development, talent management, performance appraisal, and other needs, as well as training, implementation, and account management services. It also provides applications for learning, compensation management, succession planning, competency management, disclosure management, simulation-based education, quality management, and industry training. In addition, the company offers VerityStream, a SaaS-based solution for recruiting, application submission, verification of licensure and other credentials, privileging, appointments by credentialing committees, enrollment, network management, onboarding, and performance evaluation; EchoCredentialing and MSOW platforms that manage medical staff credentialing and privileging processes for hospitals; EchoOneApp, a provider enrollment platform for medical groups; CredentialMyDoc, a SaaS-based solution to credential and enroll providers with payers for reimbursement, and to apply and maintain privileges, primarily in ambulatory care settings; and EchoAccess, a platform to support hospital call centers with physician referral and provider directories functionalities. Further, it provides NurseGrid Mobile, an application for nurses to manage and share their schedules, swap shifts, communicate with one another, and to coordinate work and non-work activities. The company offers its solutions in healthcare industry companies that include private, not-for-profit, and government entities, as well as pharmaceutical and medical device companies. The company was founded in 1990 and is headquartered in Nashville, Tennessee.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Health Information Services", "Address": "500 11th Avenue North, Nashville, TN, United States, 37203", "FullTimeEmployees": "849", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "672587456", "EBITDA": "36681000", "PERatio": "37.2727", "PEGRatio": "12.2024", "BookValue": "10.608", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.556", "RevenuePerShareTTM": "7.662", "ProfitMargin": "0.0725", "OperatingMarginTTM": "0.0756", "ReturnOnAssetsTTM": "0.0245", "ReturnOnEquityTTM": "0.0524", "RevenueTTM": "247270000", "GrossProfitTTM": "150222000", "DilutedEPSTTM": "0.556", "QuarterlyEarningsGrowthYOY": "0.537", "QuarterlyRevenueGrowthYOY": "-0.051", "AnalystTargetPrice": "27.33", "TrailingPE": "37.2727", "ForwardPE": "147.0588", "PriceToSalesRatioTTM": "2.6795", "PriceToBookRatio": "1.9325", "EVToRevenue": "2.1871", "EVToEBITDA": "11.3573", "Beta": "0.4846", "52WeekHigh": "29.78", "52WeekLow": "20.03", "50DayMovingAverage": "21.8394", "200DayMovingAverage": "22.9734", "SharesOutstanding": "31997500", "SharesFloat": "25582960", "SharesShort": "389848", "SharesShortPriorMonth": "424961", "ShortRatio": "6.24", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0443", "PercentInsiders": "20.4", "PercentInstitutions": "73.789", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2018-04-03", "ExDividendDate": "2018-03-05", "LastSplitFactor": "None", "LastSplitDate": "None"}