{"Symbol": "HTBK", "AssetType": "Common Stock", "Name": "Heritage Commerce Corp", "Description": "Heritage Commerce Corp operates as the bank holding company for Heritage Bank of Commerce that provides various commercial and personal banking services to residents and the business/professional community in California. It offers a range of deposit products for business banking and retail markets, including interest and non-interest bearing demand, savings accounts, certificate of deposit, money market accounts, and time deposits. The company also provides various loan products comprising commercial loans, such as operating secured and unsecured loans advanced for working capital, equipment purchases, and other business purposes; commercial real estate loans; commercial construction loans for rental properties, commercial buildings, and homes; home equity lines of credit; residential mortgage loans; consumer loans consisting of loans for financing automobiles, various consumer goods, and other personal purposes; and small business administration loans. In addition, it offers other banking services, including cashier's checks, bank-by-mail, night depositories, safe deposit boxes, direct deposit, automated payroll, electronic funds transfer, online bill pay, homeowner association, remote deposit capture, automated clearing house origination, electronic data interchange, and check imaging services, as well as other customary banking, factoring financing, and electronic banking services. The company provides its banking products and services through 19 full service branch offices in the southern and eastern regions of the general San Francisco Bay Area of California in the counties of Alameda, Contra Costa, Marin, San Benito, San Francisco, San Mateo, and Santa Clara. Heritage Commerce Corp was founded in 1997 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "150 Almaden Boulevard, San Jose, CA, United States, 95113", "FullTimeEmployees": "340", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "426017728", "EBITDA": "None", "PERatio": "13.8431", "PEGRatio": "1.88", "BookValue": "9.603", "DividendPerShare": "0.52", "DividendYield": "0.0737", "EPS": "0.522", "RevenuePerShareTTM": "2.494", "ProfitMargin": "0.2155", "OperatingMarginTTM": "0.3976", "ReturnOnAssetsTTM": "0.0076", "ReturnOnEquityTTM": "0.0612", "RevenueTTM": "136624992", "GrossProfitTTM": "141210000", "DilutedEPSTTM": "0.522", "QuarterlyEarningsGrowthYOY": "-0.313", "QuarterlyRevenueGrowthYOY": "0.043", "AnalystTargetPrice": "9.4", "TrailingPE": "13.8431", "ForwardPE": "11.3895", "PriceToSalesRatioTTM": "2.5792", "PriceToBookRatio": "0.7354", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.067", "52WeekHigh": "13.14", "52WeekLow": "6.04", "50DayMovingAverage": "7.0217", "200DayMovingAverage": "7.9624", "SharesOutstanding": "59876000", "SharesFloat": "57486317", "SharesShort": "913158", "SharesShortPriorMonth": "753184", "ShortRatio": "2.55", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0141", "PercentInsiders": "3.767", "PercentInstitutions": "71.392", "ForwardAnnualDividendRate": "0.52", "ForwardAnnualDividendYield": "0.0737", "PayoutRatio": "0.9804", "DividendDate": "2020-08-20", "ExDividendDate": "2020-08-05", "LastSplitFactor": "11:10", "LastSplitDate": "2000-02-03"}