{"Symbol": "HTLF", "AssetType": "Common Stock", "Name": "Heartland Financial USA, Inc", "Description": "Heartland Financial USA, Inc., a multi-bank holding company, provides commercial, small business, and consumer banking services to individuals and businesses in the United States. It accepts various deposit products, including checking and other demand deposit accounts; NOW, savings, money market, individual retirement, and health savings accounts; certificates of deposit; and other time deposits. The company also offers commercial and industrial loans; commercial real estate loans; real estate mortgage loans; small business loans; agricultural loans; consumer loans comprising motor vehicle and home improvement loans, home equity line of credit, and fixed rate home equity and personal lines of credit; and credit cards for commercial, business, and personal use. In addition, it provides online banking, mobile banking, telephone banking, bill payment, automated clearing house, wire transfer, zero balance account, transaction reporting, lock box, remote deposit capture, accounts receivable, investment sweep account, reconciliation, treasury management, foreign exchange, and various fraud prevention services, such as check and electronic positive pay, and virus/malware protection service, as well as commercial purchasing and merchant credit cards, debit cards, and automated teller machines. Further, the company offers investment services, such as mutual funds, annuities, retirement products, education savings products, brokerage services, employer sponsored plans, and insurance products, as well as vehicle, property and casualty, and life and disability insurance products. Additionally, it is involved in the community development, consumer finance, multi-line insurance agency, and property management businesses. The company operates through 115 banking locations in Iowa, Illinois, Wisconsin, New Mexico, Arizona, Montana, Colorado, Minnesota, Kansas, Missouri, Texas, and California. Heartland Financial USA, Inc. was founded in 1981 and is headquartered in Dubuque, Iowa.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "1398 Central Avenue, Dubuque, IA, United States, 52001", "FullTimeEmployees": "1821", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1284161536", "EBITDA": "None", "PERatio": "10.2108", "PEGRatio": "1.66", "BookValue": "44.421", "DividendPerShare": "0.8", "DividendYield": "0.0232", "EPS": "3.329", "RevenuePerShareTTM": "13.705", "ProfitMargin": "0.2429", "OperatingMarginTTM": "0.3176", "ReturnOnAssetsTTM": "0.009", "ReturnOnEquityTTM": "0.075", "RevenueTTM": "504862016", "GrossProfitTTM": "542997000", "DilutedEPSTTM": "3.329", "QuarterlyEarningsGrowthYOY": "-0.352", "QuarterlyRevenueGrowthYOY": "-0.16", "AnalystTargetPrice": "36.25", "TrailingPE": "10.2108", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.1755", "PriceToBookRatio": "0.7639", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.2049", "52WeekHigh": "51.85", "52WeekLow": "25.3", "50DayMovingAverage": "32.5372", "200DayMovingAverage": "33.6384", "SharesOutstanding": "36880000", "SharesFloat": "32844978", "SharesShort": "537261", "SharesShortPriorMonth": "382631", "ShortRatio": "4.56", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0137", "PercentInsiders": "6.266", "PercentInstitutions": "58.01", "ForwardAnnualDividendRate": "0.8", "ForwardAnnualDividendYield": "0.0232", "PayoutRatio": "0.2289", "DividendDate": "2020-08-29", "ExDividendDate": "2020-08-06", "LastSplitFactor": "3:2", "LastSplitDate": "2003-12-30"}