{"Symbol": "HURN", "AssetType": "Common Stock", "Name": "Huron Consulting Group Inc", "Description": "Huron Consulting Group Inc., a professional services firm, provides advisory, technology, and analytic solutions in the United States and internationally. Its Healthcare segment provides advisory services in financial and operational improvement, care transformation, culture and organizational excellence, strategy, and technology and analytics to national and regional hospitals, integrated health systems, academic medical centers, community hospitals, and medical groups. The company's Education segment offers consulting and technology solutions related to business and technology strategy, financial and operational excellence, student success, research administration, and regulatory compliance for higher education institutions and academic medical centers. Its Business Advisory segment provides capital advisory, transaction advisory, operational improvement, restructuring and turnaround, valuation, and dispute advisory services; technology and analytic solutions that enable organizations to manage their financial performance, operational efficiency, and client or stakeholder experience; and strategic solutions to pharmaceutical, medical device, and biotechnology companies. This segment provides its services to large and middle market organizations, not-for-profit organizations, lending institutions, law firms, investment banks, and private equity firms. The company serves the aerospace, automotive, energy and utilities, financial services, government, life sciences, logistics, manufacturing, metals and mining, retail and consumer products, technology, media, and telecommunications industries. Huron Consulting Group Inc. was founded in 2002 and is headquartered in Chicago, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Consulting Services", "Address": "550 West Van Buren Street, Chicago, IL, United States, 60607", "FullTimeEmployees": "2952", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1010555648", "EBITDA": "101965000", "PERatio": "26.9519", "PEGRatio": "1.5199", "BookValue": "24.51", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.352", "RevenuePerShareTTM": "40.638", "ProfitMargin": "-0.0009", "OperatingMarginTTM": "0.0817", "ReturnOnAssetsTTM": "0.0407", "ReturnOnEquityTTM": "-0.0012", "RevenueTTM": "892033984", "GrossProfitTTM": "301155000", "DilutedEPSTTM": "-0.036", "QuarterlyEarningsGrowthYOY": "0.308", "QuarterlyRevenueGrowthYOY": "-0.013", "AnalystTargetPrice": "64", "TrailingPE": "26.9519", "ForwardPE": "26.5252", "PriceToSalesRatioTTM": "1.031", "PriceToBookRatio": "1.8998", "EVToRevenue": "1.3965", "EVToEBITDA": "13.1288", "Beta": "0.6385", "52WeekHigh": "70.91", "52WeekLow": "35.15", "50DayMovingAverage": "45.5647", "200DayMovingAverage": "47.5507", "SharesOutstanding": "22873600", "SharesFloat": "21444741", "SharesShort": "229880", "SharesShortPriorMonth": "239598", "ShortRatio": "1.12", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0072", "PercentInsiders": "2.166", "PercentInstitutions": "93.489", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}