{"Symbol": "HZNP", "AssetType": "Common Stock", "Name": "Horizon Therapeutics Public Limited Company", "Description": "Horizon Therapeutics Public Limited Company, a biopharmaceutical company, focuses on researching, developing, and commercializing medicines that address unmet treatment needs for rare and rheumatic diseases in the United States and internationally. Its orphan and rheumatology marketed medicines include KRYSTEXXA, a medicine for the treatment of uncontrolled gout; RAVICTI for use as a nitrogen-binding agent for chronic management of adult and pediatric patients; PROCYSBI for nephropathic cystinosis, a rare and life-threatening metabolic disorder; ACTIMMUNE for chronic granulomatous disease; RAYOS for the treatment of multiple conditions, rheumatoid arthritis; BUPHENYL tablets for oral administration and BUPHENYL powder for oral, nasogastric, or gastrostomy tube administration; and QUINSAIR, a formulation of the antibiotic drug levofloxacin for the management of chronic pulmonary infections due to Pseudomonas aeruginosa in adult patients with cystic fibrosis. The company's primary care marketed medicines comprise PENNSAID 2% that is indicated for the treatment of pain of osteoarthritis of the knees; DUEXIS for the relief of signs and symptoms of RA and OA, and to decrease the risk of developing upper-GI ulcers; VIMOVO for the relief of signs and symptoms of OA, RA, and AS and to decrease the risk of developing gastric ulcers in patients at risk of developing NSAID-associated gastric ulcers; and MIGERGOT, a therapy to abort or prevent vascular headaches, such as migraines and migraine variants. It has collaboration agreements with Alliance for Lupus Research, Syneos Health, Inc., and HemoShear Therapeutics, LLC. The company was formerly known as Horizon Pharma Public Limited Company and changed its name to Horizon Therapeutics Public Limited Company in May 2019. Horizon Therapeutics Public Limited Company was founded in 2005 and is headquartered in Dublin, Ireland.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersGeneral", "Address": "Connaught House, Dublin, Ireland, 4", "FullTimeEmployees": "1225", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "15961937920", "EBITDA": "142644000", "PERatio": "27.9886", "PEGRatio": "1", "BookValue": "11.832", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.549", "RevenuePerShareTTM": "8.021", "ProfitMargin": "0.3409", "OperatingMarginTTM": "0.0822", "ReturnOnAssetsTTM": "0.0189", "ReturnOnEquityTTM": "0.2665", "RevenueTTM": "1517698944", "GrossProfitTTM": "937943000", "DilutedEPSTTM": "2.549", "QuarterlyEarningsGrowthYOY": "-0.526", "QuarterlyRevenueGrowthYOY": "0.443", "AnalystTargetPrice": "93.5", "TrailingPE": "27.9886", "ForwardPE": "19.802", "PriceToSalesRatioTTM": "10.2192", "PriceToBookRatio": "6.8413", "EVToRevenue": "10.9387", "EVToEBITDA": "50.79", "Beta": "1.2269", "52WeekHigh": "78.93", "52WeekLow": "23.81", "50DayMovingAverage": "66.4039", "200DayMovingAverage": "46.7275", "SharesOutstanding": "220347008", "SharesFloat": "203871358", "SharesShort": "9229711", "SharesShortPriorMonth": "7698083", "ShortRatio": "1.65", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0206", "PercentInsiders": "1.307", "PercentInstitutions": "91.659", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}