{"Symbol": "IART", "AssetType": "Common Stock", "Name": "Integra LifeSciences Holdings Corporation", "Description": "Integra LifeSciences Holdings Corporation develops, manufactures, and markets surgical implants and medical instruments for use in neurosurgery, extremity reconstruction, orthopedics, and general surgery. It operates in two segments, Codman Specialty Surgical, and Orthopedics and Tissue Technologies. The company offers neurosurgery and neuro critical care products, including tissue ablation equipment, dural repair products, cerebral spinal fluid management devices, hydrocephalus management systems, intracranial monitoring equipment, and cranial stabilization equipment; and surgical headlamps and instrumentation, as well as asset management software and support, and after-market services. It also sells approximately 40,000 instrument patterns, and surgical and lighting products to hospitals and surgery centers, as well as dental, podiatry, and veterinary offices. In addition, the company provides regenerative technology products for the treatment of acute and chronic wounds; and surgical tissue repair products for hernia repair, peripheral nerve repair and protection, and tendon repair. Further, it sells hardware products, such as bone and joint fixation, and joint replacement devices; and implants and instruments, which provide for the orthopedic reconstruction of bone in the hand, wrist, elbow, and shoulder, as well as the foot, ankle, and leg below the knee in the extremity bone and joint reconstruction procedures. The company offers its products directly through various sales forces and other distribution channels to the hospitals, integrated health networks, group purchasing organizations, clinicians, surgery centers, and health care providers in the United States, Europe, Asia Pacific, and internationally. Integra LifeSciences Holdings Corporation was founded in 1989 and is headquartered in Princeton, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "1100 Campus Road, Princeton, NJ, United States, 08540", "FullTimeEmployees": "4000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4039951616", "EBITDA": "312366016", "PERatio": "160.0645", "PEGRatio": "1.9773", "BookValue": "16.008", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.311", "RevenuePerShareTTM": "16.247", "ProfitMargin": "-0.0025", "OperatingMarginTTM": "0.1428", "ReturnOnAssetsTTM": "0.037", "ReturnOnEquityTTM": "-0.0025", "RevenueTTM": "1387211008", "GrossProfitTTM": "978142000", "DilutedEPSTTM": "-0.041", "QuarterlyEarningsGrowthYOY": "-0.716", "QuarterlyRevenueGrowthYOY": "-0.326", "AnalystTargetPrice": "58.5", "TrailingPE": "160.0645", "ForwardPE": "23.753", "PriceToSalesRatioTTM": "2.9147", "PriceToBookRatio": "2.9346", "EVToRevenue": "3.7935", "EVToEBITDA": "28.1179", "Beta": "1.0648", "52WeekHigh": "63.84", "52WeekLow": "34.21", "50DayMovingAverage": "48.6306", "200DayMovingAverage": "48.8729", "SharesOutstanding": "84271000", "SharesFloat": "71009252", "SharesShort": "3810219", "SharesShortPriorMonth": "3457538", "ShortRatio": "9.48", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.0567", "PercentInsiders": "16.2", "PercentInstitutions": "86.539", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2017-01-04"}