{"Symbol": "ICAD", "AssetType": "Common Stock", "Name": "iCAD, Inc", "Description": "iCAD, Inc. provides image analysis, workflow solutions, and radiation therapy for the early identification and treatment of cancer in the United States and internationally. It operates through two segments, Cancer Detection and Cancer Therapy. The company provides electronic brachytherapy (eBX) products, including Axxent eBx systems for the treatment of early stage breast cancer, endometrial cancer, cervical cancer, and skin cancer, as well as for treating other cancers or conditions where radiation therapy is indicated comprising intraoperative radiation therapy. It also offers digital mammography computer-aided detection (CAD) products, which include PowerLook Mammo Detection, which detects and identifies suspicious masses and micro-calcifications; and PowerLook Platform, a server residing on a customer's network that receives patient studies from the imaging modality, performs analysis, and sends results to picture archiving and communication system and/or review workstations. In addition, the company offers magnetic resonance imaging products to detect breast and prostate cancer; breast tomosynthesis systems; and advanced image analysis and workflow solutions in computed tomography (CT) colonography, including VeraLook that supports the detection of colonic polyps in conjunction with CT colonography. It serves healthcare centers through direct sales organizations, as well as through various original equipment manufacturer partners, distributors, and resellers. The company was formerly known as Howtek, Inc. and changed its name to iCAD, Inc. in June 2002. iCAD, Inc. was founded in 1984 and is headquartered in Nashua, New Hampshire.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Health Information Services", "Address": "98 Spit Brook Road, Nashua, NH, United States, 03062", "FullTimeEmployees": "135", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "231525056", "EBITDA": "-5863000", "PERatio": "None", "PEGRatio": "-0.56", "BookValue": "1.158", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.703", "RevenuePerShareTTM": "1.446", "ProfitMargin": "-0.6988", "OperatingMarginTTM": "-0.3444", "ReturnOnAssetsTTM": "-0.1427", "ReturnOnEquityTTM": "-1.0973", "RevenueTTM": "29356000", "GrossProfitTTM": "24624000", "DilutedEPSTTM": "-1.011", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.24", "AnalystTargetPrice": "14.7", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "6.9512", "PriceToBookRatio": "8.6876", "EVToRevenue": "7.3298", "EVToEBITDA": "0", "Beta": "1.1401", "52WeekHigh": "15.31", "52WeekLow": "5.84", "50DayMovingAverage": "10.1064", "200DayMovingAverage": "10.4769", "SharesOutstanding": "22900600", "SharesFloat": "20354962", "SharesShort": "1232384", "SharesShortPriorMonth": "756403", "ShortRatio": "5.24", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0534", "PercentInsiders": "10.229", "PercentInstitutions": "28.594", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:5", "LastSplitDate": "2012-08-16"}