{"Symbol": "ICFI", "AssetType": "Common Stock", "Name": "ICF International, Inc", "Description": "ICF International, Inc. provides management, marketing, technology, and policy consulting and implementation services to government and commercial clients in the United States and internationally. The company researches critical policy, industry, stakeholder issues, trends, and behaviors; measures and evaluates results and their impact; and provides strategic planning and advisory services to its clients on how to navigate societal, market, business, communication, and technology challenges. It also identifies, defines, and implements policies, plans, programs, and business tools through a range of standard and customized methodologies for its clients; conducts survey research; collects and analyzes various data to understand critical issues and options for its clients; and provides actionable business intelligence, as well as information and data management solutions that allow integrated and purpose-driven data usage. In addition, the company provides solutions to optimize the customer and citizen experience; modernizes IT systems; and cyber security solutions that support the range of cyber security missions and protect IT infrastructures in the face of relentless threats, as well as designs, develops, and implements technology systems and business tools that are principal to its clients' mission or business performance. Further, it informs and engages its clients' constituents, customers, and employees through public relations, branding and marketing, multichannel and strategic communications, and reputation issues management. The company serves energy, environment, and infrastructure; health, education, and social programs; safety and security; and consumer and financial markets. The company was formerly known as ICF Consulting Group Holdings, LLC and changed its name to ICF International, Inc. in 2006. ICF International, Inc. was founded in 1969 and is headquartered in Fairfax, Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Consulting Services", "Address": "9300/9302 Lee Highway, Fairfax, VA, United States, 22031", "FullTimeEmployees": "7000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1284902272", "EBITDA": "127162000", "PERatio": "20.7788", "PEGRatio": "1.881", "BookValue": "37.409", "DividendPerShare": "0.56", "DividendYield": "0.0082", "EPS": "3.302", "RevenuePerShareTTM": "78.762", "ProfitMargin": "0.0427", "OperatingMarginTTM": "0.0654", "ReturnOnAssetsTTM": "0.04", "ReturnOnEquityTTM": "0.0923", "RevenueTTM": "1482779008", "GrossProfitTTM": "525338000", "DilutedEPSTTM": "3.302", "QuarterlyEarningsGrowthYOY": "-0.053", "QuarterlyRevenueGrowthYOY": "-0.035", "AnalystTargetPrice": "90.8", "TrailingPE": "20.7788", "ForwardPE": "18.6567", "PriceToSalesRatioTTM": "0.8868", "PriceToBookRatio": "1.833", "EVToRevenue": "1.2741", "EVToEBITDA": "14.9331", "Beta": "0.5731", "52WeekHigh": "95.24", "52WeekLow": "47.7514", "50DayMovingAverage": "67.7806", "200DayMovingAverage": "68.0859", "SharesOutstanding": "18848500", "SharesFloat": "18078560", "SharesShort": "233551", "SharesShortPriorMonth": "186379", "ShortRatio": "2.1", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0139", "PercentInsiders": "4.113", "PercentInstitutions": "95.376", "ForwardAnnualDividendRate": "0.56", "ForwardAnnualDividendYield": "0.0082", "PayoutRatio": "0.1697", "DividendDate": "2020-10-13", "ExDividendDate": "2020-09-10", "LastSplitFactor": "None", "LastSplitDate": "None"}