{"Symbol": "ICUI", "AssetType": "Common Stock", "Name": "ICU Medical, Inc", "Description": "ICU Medical, Inc., together with its subsidiaries, develops, manufactures, and sells medical devices used in vascular therapy and critical care applications worldwide. The company's infusion therapy products include needlefree connector products under the MicroClave, MicroClave Clear, and NanoClave brands; Neutron catheter patency connectors; SwabCap disinfecting caps; Tego hemodialysis connectors; NovaCath and SuperCath peripheral intravenous (IV) catheters; ClearGuard HD, an antimicrobial barrier cap for hemodialysis catheters; and ChemoLock and ChemoClave closed system transfer devices, as well as Diana hazardous drug compounding system for the preparation of hazardous drugs. It also provides IV therapy and diluents, including sodium chloride, dextrose, balanced electrolyte solutions, lactated ringer's, ringer's, mannitol, sodium chloride/dextrose, and sterile water; and irrigation, such as sodium chloride irrigation, sterile water irrigation, physiologic solutions, ringer's irrigation, acetic acid irrigation, glycine irrigation, sorbitol-mannitol irrigation, flexible containers, and pour bottle options. In addition, the company offers infusion pumps under the Plum 360 and LifeCare PCA brands; Cogent 2-in-1 and CardioFlo hemodynamic monitoring systems; TDQ and OptiQ cardiac output monitoring catheters; TriOx venous oximetry catheters; Transpac blood pressure transducers; and SafeSet closed blood sampling and conservation systems. Further, it provides ICU Medical Mednet, an enterprise medication management platform that connects smart pumps to hospital's electronic health records, asset tracking systems, and alarm notification platforms, as well as related professional services. The company sells its products to acute care hospitals, wholesalers, ambulatory clinics, and alternate site facilities, such as clinics, home health care providers, and long-term care facilities. ICU Medical, Inc. was founded in 1984 and is headquartered in San Clemente, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "951 Calle Amanecer, San Clemente, CA, United States, 92673", "FullTimeEmployees": "8000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4110109952", "EBITDA": "236658000", "PERatio": "51.4675", "PEGRatio": "6.9935", "BookValue": "67.434", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.85", "RevenuePerShareTTM": "60.463", "ProfitMargin": "0.0661", "OperatingMarginTTM": "0.1235", "ReturnOnAssetsTTM": "0.0556", "ReturnOnEquityTTM": "0.0608", "RevenueTTM": "1254979968", "GrossProfitTTM": "488164000", "DilutedEPSTTM": "3.85", "QuarterlyEarningsGrowthYOY": "-0.17", "QuarterlyRevenueGrowthYOY": "-0.029", "AnalystTargetPrice": "216.33", "TrailingPE": "51.4675", "ForwardPE": "29.9401", "PriceToSalesRatioTTM": "3.4017", "PriceToBookRatio": "2.9387", "EVToRevenue": "3.102", "EVToEBITDA": "20.8785", "Beta": "0.5137", "52WeekHigh": "236.505", "52WeekLow": "148.89", "50DayMovingAverage": "187.1761", "200DayMovingAverage": "193.8633", "SharesOutstanding": "20937900", "SharesFloat": "19565588", "SharesShort": "308257", "SharesShortPriorMonth": "263731", "ShortRatio": "2.34", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0197", "PercentInsiders": "7.103", "PercentInstitutions": "96.422", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:2", "LastSplitDate": "2002-03-18"}