{"Symbol": "IDTI", "AssetType": "Common Stock", "Name": "Integrated Device Technology, Inc", "Description": "Integrated Device Technology, Inc. designs, develops, manufactures, and markets a range of semiconductor solutions for the communications, computing, consumer, automotive, industrial, and industrial end-markets. It operates in two segments, Communications; and Computing, Consumer and Industrial. The Communications segment offers clocks and timing solutions; radio frequency products; flow-control management products, including multi-port products; telecommunication interface products; static random access memory products; first in and first out memories; digital logic products; optical interconnect and frequency control solutions; and Serial RapidIO switching solutions. The Computing, Consumer and Industrial segment provides clock generation and distribution products; programmable timing devices; computing timing solutions; high-performance server memory interfaces; wireless power products; PCI Express products; signal integrity products; power management integrated circuits; video distribution and contribution solutions; sensor signal conditioners; and optical interconnect solutions, as well as sensing products for mobile, automotive, and industrial solutions. The company markets its products primarily to original equipment manufacturers through various channels, including direct sales, distributors, electronic manufacturing suppliers, and independent sales representatives. Integrated Device Technology, Inc. was founded in 1980 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "6024 Silver Creek Valley Road\n95138,San Jose,USA\n", "FullTimeEmployees": "1821", "FiscalYearEnd": "March", "LatestQuarter": "0000-00-00", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "2.65", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "47.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}