{"Symbol": "IESC", "AssetType": "Common Stock", "Name": "IES Holdings, Inc", "Description": "IES Holdings, Inc. engages in communications, commercial and industrial, infrastructure solutions, and residential businesses in the United States. Its Commercial & Industrial segment offers electrical and mechanical design, construction, and maintenance services for office buildings, manufacturing facilities, data centers, chemical plants, refineries, wind farms, solar facilities, municipal infrastructures, and health care facilities. Its Communications segment offers network infrastructure services for data centers and other mission critical environments. This segment designs, installs, and maintains network infrastructure for corporate, educational, financial, hospitality and healthcare building, e-commerce distribution center, and high-tech manufacturing facility industries, as well as colocation and managed hosting customers; designs and installs audio/visual, telephone, fire, wireless access, and intrusion alarm systems; and designs/builds, services, and maintains data network systems. Its Infrastructure Solutions segment maintains and repairs alternating and direct current electric motors and generators, and power generating and distribution equipment; manufactures custom-engineered metal enclosed bus duct solutions used in power distribution; manufactures custom commercial and industrial generator enclosures; manufactures, remanufactures, and repairs industrial lifting magnets; and maintains and repairs railroad main and auxiliary generators, main alternators, and traction motors. Its Residential segment offers electrical installations to single-family housing and multi-family apartments; and cable television installations to residential and light commercial applications, as well as installs residential solar power for new construction and existing residences. The company was formerly known as Integrated Electrical Services, Inc. and changed its name to IES Holdings, Inc. in May 2016. The company was founded in 1997 and is headquartered in Houston, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Engineering & Construction", "Address": "5433 Westheimer Road, Houston, TX, United States, 77056", "FullTimeEmployees": "5389", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "613777152", "EBITDA": "60568000", "PERatio": "17.0116", "PEGRatio": "0", "BookValue": "13.155", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.721", "RevenuePerShareTTM": "55.371", "ProfitMargin": "0.0319", "OperatingMarginTTM": "0.0428", "ReturnOnAssetsTTM": "0.0641", "ReturnOnEquityTTM": "0.1443", "RevenueTTM": "1154051968", "GrossProfitTTM": "182103000", "DilutedEPSTTM": "1.721", "QuarterlyEarningsGrowthYOY": "0.141", "QuarterlyRevenueGrowthYOY": "0.037", "AnalystTargetPrice": "6.5", "TrailingPE": "17.0116", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5348", "PriceToBookRatio": "2.2753", "EVToRevenue": "0.5216", "EVToEBITDA": "10.0016", "Beta": "0.9", "52WeekHigh": "30.01", "52WeekLow": "13.7297", "50DayMovingAverage": "25.8578", "200DayMovingAverage": "22.3205", "SharesOutstanding": "21048600", "SharesFloat": "8121173", "SharesShort": "193652", "SharesShortPriorMonth": "170659", "ShortRatio": "4.05", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0226", "PercentInsiders": "4.076", "PercentInstitutions": "81.463", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1000:17092", "LastSplitDate": "2006-05-15"}