{"Symbol": "III", "AssetType": "Common Stock", "Name": "Information Services Group, Inc", "Description": "Information Services Group, Inc. operates as a technology research and advisory company in the Americas, Europe, and the Asia Pacific. The company offers digital transformation services, including automation, cloud, and data analytics; sourcing advisory; managed governance and risk; network carrier; technology strategy and operations design; change management; and market intelligence and technology research and analysis services. It supports private and public sector organizations to transform and optimize their operational environments. The company also provides subscription research, and advisory and strategy consulting services for senior business and IT executives, technology and software vendors, and business/IT services providers; and consulting services, such as business advisory services, data and analytics, digital solutions, network advisory services, organizational change management, automation, human resources technology and delivery services, software advisory services, and sourcing solutions. In addition, it offers ISG GovernX third-party management services that assist clients with monitoring and managing their supplier relationships, as well as provides them with real-time market intelligence and insights; and a range of industry conferences. The company serves private sector clients operating in the financial services, telecommunications, healthcare and pharmaceuticals, manufacturing, transportation and travel, and energy and utilities industries; and public sector customers, including state and local governments, airport and transit authorities, and national and provincial government units. Information Services Group, Inc. has a strategic partnership with NICE to expand its automation ecosystem. The company was founded in 2006 and is headquartered in Stamford, Connecticut.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "2187 Atlantic Street, Stamford, United States, 06902", "FullTimeEmployees": "1300", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "100007440", "EBITDA": "20009000", "PERatio": "36", "PEGRatio": "0.8571", "BookValue": "1.833", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.059", "RevenuePerShareTTM": "5.366", "ProfitMargin": "0.0121", "OperatingMarginTTM": "0.0534", "ReturnOnAssetsTTM": "0.0391", "ReturnOnEquityTTM": "0.035", "RevenueTTM": "254748000", "GrossProfitTTM": "112584000", "DilutedEPSTTM": "0.059", "QuarterlyEarningsGrowthYOY": "0.132", "QuarterlyRevenueGrowthYOY": "-0.148", "AnalystTargetPrice": "4.25", "TrailingPE": "36", "ForwardPE": "12.0048", "PriceToSalesRatioTTM": "0.4085", "PriceToBookRatio": "1.1762", "EVToRevenue": "0.6134", "EVToEBITDA": "7.7575", "Beta": "0.3396", "52WeekHigh": "3.7633", "52WeekLow": "1.6086", "50DayMovingAverage": "2.1456", "200DayMovingAverage": "2.3081", "SharesOutstanding": "47612900", "SharesFloat": "31493106", "SharesShort": "280697", "SharesShortPriorMonth": "148147", "ShortRatio": "3", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0103", "PercentInsiders": "28.621", "PercentInstitutions": "52.19", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2015-01-28", "ExDividendDate": "2015-01-13", "LastSplitFactor": "None", "LastSplitDate": "None"}