{"Symbol": "IIIN", "AssetType": "Common Stock", "Name": "Insteel Industries, Inc", "Description": "Insteel Industries, Inc., together with its subsidiaries, manufactures and markets steel wire reinforcing products for concrete construction applications. The company offers pre-stressed concrete strand (PC strand) and welded wire reinforcement (WWR) products. Its PC strand is a seven-wire strand that is used to impart compression forces into precast concrete elements and structures providing reinforcement for bridges, parking decks, buildings, and other concrete structures. The company's WWR engineered reinforcing product is used in nonresidential and residential construction. It produces a range of WWR products, such as engineered structural mesh, an engineered made-to-order product that is used as the primary reinforcement for concrete elements or structures serving as a reinforcing solution for hot-rolled rebar; concrete pipe reinforcement, an engineered made-to-order product, which is used as the primary reinforcement in concrete pipe, box culverts, and precast manholes for drainage and sewage systems, water treatment facilities, and other related applications; and standard welded wire reinforcement, a secondary reinforcing product for crack control applications in residential and light nonresidential construction, including driveways, sidewalks, and various slab-on-grade applications. The company sells its products through sales representatives to the manufacturers of concrete products, distributors, rebar fabricators, and contractors primarily in the United States, as well as in Canada, Mexico, and Central and South America. Insteel Industries, Inc. was founded in 1953 and is headquartered in Mount Airy, North Carolina.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Metal Fabrication", "Address": "1373 Boggs Drive, Mount Airy, NC, United States, 27030", "FullTimeEmployees": "834", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "359982496", "EBITDA": "26310000", "PERatio": "36.1569", "PEGRatio": "1.74", "BookValue": "13.331", "DividendPerShare": "0.12", "DividendYield": "0.0064", "EPS": "0.509", "RevenuePerShareTTM": "23.24", "ProfitMargin": "0.0219", "OperatingMarginTTM": "0.0273", "ReturnOnAssetsTTM": "0.0238", "ReturnOnEquityTTM": "0.0389", "RevenueTTM": "447790016", "GrossProfitTTM": "29416000", "DilutedEPSTTM": "0.509", "QuarterlyEarningsGrowthYOY": "2.091", "QuarterlyRevenueGrowthYOY": "-0.034", "AnalystTargetPrice": "19", "TrailingPE": "36.1569", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.7977", "PriceToBookRatio": "1.3816", "EVToRevenue": "0.6561", "EVToEBITDA": "10.8975", "Beta": "1.8791", "52WeekHigh": "26.61", "52WeekLow": "10", "50DayMovingAverage": "19.1703", "200DayMovingAverage": "17.7283", "SharesOutstanding": "19260700", "SharesFloat": "18203696", "SharesShort": "273266", "SharesShortPriorMonth": "254485", "ShortRatio": "2.51", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.016", "PercentInsiders": "5.145", "PercentInstitutions": "82.147", "ForwardAnnualDividendRate": "0.12", "ForwardAnnualDividendYield": "0.0064", "PayoutRatio": "0.2353", "DividendDate": "2020-09-25", "ExDividendDate": "2020-09-10", "LastSplitFactor": "2:1", "LastSplitDate": "2006-06-19"}