{"Symbol": "IIN", "AssetType": "Common Stock", "Name": "IntriCon Corporation", "Description": "IntriCon Corporation, together with its subsidiaries, designs, develops, engineers, manufactures, and distributes body-worn devices in the United States, Europe, Asia, and internationally. The company operates in two segments, Body Worn Devices and Hearing Health Direct-To-End-Consumer. It offers micro-miniature products, microelectronics, micro-mechanical assemblies, high-precision injection-molded plastic components, and assemblies and software solutions for medical biotelemetry devices, hearing healthcare, and professional audio communication devices markets. The company also provides medical and micro coils for pacemaker programming and interventional catheter positioning applications; bubble sensors and flow restrictors that monitor and control the flow of fluid in an intravenous infusion system; and safety needle products for original equipment manufacturing customers. In addition, it offers professional audio headset products used for emergency response needs in the fire, law enforcement, safety, aviation, and military markets; and a line of miniature ear-and head-worn devices used by performers and support staff in the music and stage performance markets. The company sells its hearing device products, and medical and professional audio communications products directly to hearing instrument manufacturers, distributors, and partnerships; and microphone products to the radio communication and professional audio industries, as well as markets and sells hearing aid devices directly to consumers through direct mail advertising, Internet, and call center. The company was formerly known as Selas Corporation of America and changed its name to IntriCon Corporation. The company was founded in 1930 and is headquartered in Arden Hills, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "1260 Red Fox Road, Arden Hills, MN, United States, 55112", "FullTimeEmployees": "780", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "109170792", "EBITDA": "890000", "PERatio": "None", "PEGRatio": "0", "BookValue": "9.926", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.179", "RevenuePerShareTTM": "11.316", "ProfitMargin": "-0.038", "OperatingMarginTTM": "-0.0262", "ReturnOnAssetsTTM": "-0.014", "ReturnOnEquityTTM": "-0.0426", "RevenueTTM": "99692000", "GrossProfitTTM": "30986000", "DilutedEPSTTM": "-0.429", "QuarterlyEarningsGrowthYOY": "-0.094", "QuarterlyRevenueGrowthYOY": "-0.195", "AnalystTargetPrice": "23.67", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.079", "PriceToBookRatio": "1.2301", "EVToRevenue": "0.8606", "EVToEBITDA": "78.7819", "Beta": "0.8819", "52WeekHigh": "22.47", "52WeekLow": "9.84", "50DayMovingAverage": "12.1211", "200DayMovingAverage": "12.8972", "SharesOutstanding": "8933780", "SharesFloat": "8369526", "SharesShort": "645450", "SharesShortPriorMonth": "593407", "ShortRatio": "11.04", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.064", "PercentInsiders": "7.428", "PercentInstitutions": "74.992", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "2001-09-12", "LastSplitFactor": "3:2", "LastSplitDate": "1997-06-30"}