{"Symbol": "IIVI", "AssetType": "Common Stock", "Name": "II-VI Incorporated", "Description": "II-VI Incorporated develops, manufactures, and markets engineered materials, and optoelectronic components and devices worldwide. The company operates through two segments, Compound Semiconductors and Photonic Solutions. The Compound Semiconductors segment offers optical and electro-optical components and materials used in high-power CO2 lasers; fiber-delivered beam delivery systems, and processing tools and direct diode lasers for industrial lasers; and compound semiconductor epitaxial and gallium arsenide wafers. This segment also provides infrared optical components and optical assemblies for aerospace and defense, medical, and commercial laser imaging applications; semiconductor lasers and detectors for optical interconnects and sensing applications with InP; and engineered materials for thermoelectric and silicon carbide applications to the semiconductor, aerospace, and defense and medical markets. In addition, it offers compound semiconductor epitaxial wafers for applications in optical components, wireless devices, and communication systems; and GaAs wafers for the production of lasers and integrated circuits. The Photonic Solutions segment provides crystal materials, optics, microchip lasers, and optoelectronic modules for use in optical communication networks and other consumer, life sciences, and commercial applications. This segment also offers pump lasers, optical isolators, and optical amplifiers and micro-optics for optical amplifiers, terrestrial and submarine applications. The company serves original equipment manufacturers, laser end users, system integrators of high-power lasers, U.S. government prime contractors, and various U.S. government agencies, as well as manufacturers of equipment and devices for industrial, optical communications, consumer electronics, security and monitoring applications. The company was founded in 1971 and is headquartered in Saxonburg, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "375 Saxonburg Boulevard, Saxonburg, PA, United States, 16056", "FullTimeEmployees": "22969", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4592492544", "EBITDA": "392460992", "PERatio": "42.2581", "PEGRatio": "1.47", "BookValue": "22.437", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.837", "RevenuePerShareTTM": "28.058", "ProfitMargin": "-0.0282", "OperatingMarginTTM": "0.0721", "ReturnOnAssetsTTM": "0.0298", "ReturnOnEquityTTM": "-0.0418", "RevenueTTM": "2380070912", "GrossProfitTTM": "907250000", "DilutedEPSTTM": "-0.79", "QuarterlyEarningsGrowthYOY": "0.192", "QuarterlyRevenueGrowthYOY": "1.057", "AnalystTargetPrice": "55.96", "TrailingPE": "0", "ForwardPE": "14.2045", "PriceToSalesRatioTTM": "1.5069", "PriceToBookRatio": "2.1105", "EVToRevenue": "2.6322", "EVToEBITDA": "25.4289", "Beta": "1.2967", "52WeekHigh": "52.97", "52WeekLow": "19", "50DayMovingAverage": "46.7647", "200DayMovingAverage": "39.1964", "SharesOutstanding": "103668000", "SharesFloat": "100147778", "SharesShort": "11666411", "SharesShortPriorMonth": "12183651", "ShortRatio": "7.75", "ShortPercentOutstanding": "0.14", "ShortPercentFloat": "0.1666", "PercentInsiders": "4.472", "PercentInstitutions": "92.128", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2011-06-27"}