{"Symbol": "INDB", "AssetType": "Common Stock", "Name": "Independent Bank Corp", "Description": "Independent Bank Corp. operates as the bank holding company for Rockland Trust Company that provides commercial banking products and services to individuals and small-to-medium sized businesses primarily in Massachusetts. Its products and services include demand deposits and time certificates of deposit, as well as checking, money market, and savings accounts. The company's loan portfolio includes commercial loans, such as commercial and industrial, asset-based, commercial real estate, commercial construction, and small business loans; consumer real estate loans, including residential mortgages, home equity loans, and loans for the construction of residential properties; and other consumer loans, such as personal loans. Its commercial and industrial loans cover loans for working capital, other business-related purposes, and floor plan financing; asset-based loans consist primarily of revolving lines of credit and term loans; commercial real estate loans include commercial mortgages for construction purposes that are secured by nonresidential properties, multifamily properties, or one-to-four family rental properties; and small business loans comprise businesses with commercial credit needs. The company also provides investment management and trust services to individuals, institutions, small businesses, and charitable institutions; Internet and mobile banking services, as well as automated teller machine cards and debit cards; and mutual fund shares, unit investment trust shares, general securities, fixed and variable annuities, and life insurance. It operates through 95 full service and 2 limited service retail branches, 15 commercial banking centers, 9 investment management offices, and 7 mortgage lending centers in Eastern Massachusetts, Greater Boston, the South Shore, and the Cape and Islands, as well as in Worcester County and Rhode Island. The company was founded in 1907 and is headquartered in Rockland, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "288 Union Street, Rockland, MA, United States, 02370", "FullTimeEmployees": "1348", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2107539584", "EBITDA": "None", "PERatio": "14.37", "PEGRatio": "10.9971", "BookValue": "50.746", "DividendPerShare": "1.84", "DividendYield": "0.0283", "EPS": "4.439", "RevenuePerShareTTM": "13.468", "ProfitMargin": "0.3299", "OperatingMarginTTM": "0.4294", "ReturnOnAssetsTTM": "0.0123", "ReturnOnEquityTTM": "0.0913", "RevenueTTM": "457631008", "GrossProfitTTM": "497867000", "DilutedEPSTTM": "4.439", "QuarterlyEarningsGrowthYOY": "-0.151", "QuarterlyRevenueGrowthYOY": "-0.249", "AnalystTargetPrice": "74.25", "TrailingPE": "14.37", "ForwardPE": "22.4215", "PriceToSalesRatioTTM": "4.3127", "PriceToBookRatio": "1.2633", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.933", "52WeekHigh": "87.11", "52WeekLow": "50.45", "50DayMovingAverage": "65.8903", "200DayMovingAverage": "66.4864", "SharesOutstanding": "32950900", "SharesFloat": "32494541", "SharesShort": "1209798", "SharesShortPriorMonth": "1207624", "ShortRatio": "11.23", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0445", "PercentInsiders": "1.858", "PercentInstitutions": "84.876", "ForwardAnnualDividendRate": "1.84", "ForwardAnnualDividendYield": "0.0283", "PayoutRatio": "0.4036", "DividendDate": "2020-07-10", "ExDividendDate": "2020-06-26", "LastSplitFactor": "3:2", "LastSplitDate": "1987-10-01"}