{"Symbol": "INFN", "AssetType": "Common Stock", "Name": "Infinera Corporation", "Description": "Infinera Corporation provides optical transport networking equipment, software, and services worldwide. The company's product portfolio includes Infinera Groove series of modular and sled-based platforms to support a variety of transport network applications; 7300 series, an SDN-ready coherent optical transport system; FlexILS open line system platform that connects various Infinera and third-party terminal equipment platforms over long-distance fiber optic cable providing switching, multiplexing, amplification, and management channels; and 7090 and 7100 series packet transport platforms. It also offers Infinera XTM series packet-optical transport platform that enables high performance metro networks with service-aware, application-specific capabilities; XTC series multi-terabit packet optical transport platforms that integrate digital OTN switching and optical WDM transmission; mTera series universal transport platform; and XT series for long-haul and subsea applications. In addition, the company Infinera Cloud Xpress Family designed to meet the varying needs of ICPs, communication service providers, internet exchange service providers, enterprises, and other large-scale data center operators; DRX series of routers; and 8600 series of SDN-ready Internet Protocol/MPLS routers. Further, it provides transcend software suite; Infinera CNOS, a hardware-independent network operating system; and a range of support services for all hardware and software products. The company also serves telecommunications service providers, internet content providers, cable providers, wholesale carriers, research and education institutions, large enterprises, and government entities. It markets and sells its products and related support services primarily through its direct sales force. The company was formerly known as Zepton Networks. Infinera Corporation was founded in 2000 and is headquartered in Sunnyvale, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "140 Caspian Court, Sunnyvale, CA, United States, 94089", "FullTimeEmployees": "3209", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1386648960", "EBITDA": "-127104000", "PERatio": "None", "PEGRatio": "-0.76", "BookValue": "1.761", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-2.354", "RevenuePerShareTTM": "7.532", "ProfitMargin": "-0.2276", "OperatingMarginTTM": "-0.1155", "ReturnOnAssetsTTM": "-0.0637", "ReturnOnEquityTTM": "-0.7392", "RevenueTTM": "1371768064", "GrossProfitTTM": "416890000", "DilutedEPSTTM": "-1.715", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.119", "AnalystTargetPrice": "9.29", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.9718", "PriceToBookRatio": "4.1584", "EVToRevenue": "1.3041", "EVToEBITDA": "0", "Beta": "1.0852", "52WeekHigh": "8.89", "52WeekLow": "3.68", "50DayMovingAverage": "7.5581", "200DayMovingAverage": "6.189", "SharesOutstanding": "187384992", "SharesFloat": "157384977", "SharesShort": "27113353", "SharesShortPriorMonth": "25916801", "ShortRatio": "7.36", "ShortPercentOutstanding": "0.16", "ShortPercentFloat": "0.222", "PercentInsiders": "2.329", "PercentInstitutions": "92.181", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}