{"Symbol": "INO", "AssetType": "Common Stock", "Name": "Inovio Pharmaceuticals, Inc", "Description": "Inovio Pharmaceuticals, Inc., a biotechnology company, focuses on the discovery, development, and commercialization of DNA medicines to treat, cure, and protect people from diseases associated with human papillomavirus (HPV), cancer, and infectious diseases. Its SynCon immunotherapy design has the ability to break the immune system's tolerance of cancerous cells and facilitate cross-strain protection against unmatched and matched pathogens. The company is involved in conducting and planning clinical studies of its DNA medicines for HPV-associated precancers, including cervical, vulvar, and anal dysplasia; HPV-associated cancers, including head and neck, cervical, anal, penile, vulvar, and vaginal; other HPV-associated disorders, such as recurrent respiratory papillomatosis; glioblastoma multiforme; prostate cancer; HIV; Ebola; Middle East Respiratory Syndrome (MERS); Lassa fever; Zika virus; and the COVID-19 virus (coronavirus). Its partners and collaborators include ApolloBio Corp., AstraZeneca PLC or AstraZeneca, Beijing Advaccine Biotechnology Co., The Bill & Melinda Gates Foundation, Coalition for Epidemic Preparedness Innovations (CEPI), Defense Advanced Research Projects Agency (DARPA), GeneOne Life Science, HIV Vaccines Trial Network, the U.S. Defense Threat Reduction Agency's Medical CBRN Defense Consortium (MCDC), National Cancer Institute, National Institutes of Health, National Institute of Allergy and Infectious Diseases, Plumbline Life Sciences, Regeneron Pharmaceuticals, Roche/Genentech, the University of Pennsylvania, the Walter Reed Army Institute of Research, and The Wistar Institute. The company also has an agreement with Richter-Helm BioLogics GmbH & Co. KG to support investigational DNA vaccine INO-4800, which is currently in Phase I clinical testing for COVID-19; and a partnership with International Vaccine Institute and Seoul National University Hospital. The company was founded in 1979 and is headquartered in Plymouth Meeting, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "660 West Germantown Pike, Plymouth Meeting, PA, United States, 19462", "FullTimeEmployees": "190", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2020291328", "EBITDA": "-108041976", "PERatio": "None", "PEGRatio": "0", "BookValue": "1.173", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.215", "RevenuePerShareTTM": "0.023", "ProfitMargin": "0", "OperatingMarginTTM": "-40.4574", "ReturnOnAssetsTTM": "-0.2279", "ReturnOnEquityTTM": "-1.8448", "RevenueTTM": "2740812", "GrossProfitTTM": "-82005389", "DilutedEPSTTM": "-1.852", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.969", "AnalystTargetPrice": "19", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "557.0169", "PriceToBookRatio": "11.449", "EVToRevenue": "679.3227", "EVToEBITDA": "0", "Beta": "1.3143", "52WeekHigh": "33.79", "52WeekLow": "1.96", "50DayMovingAverage": "19.2192", "200DayMovingAverage": "13.4903", "SharesOutstanding": "167520000", "SharesFloat": "164190129", "SharesShort": "30921340", "SharesShortPriorMonth": "25776868", "ShortRatio": "2.14", "ShortPercentOutstanding": "0.28", "ShortPercentFloat": "0.2881", "PercentInsiders": "2.692", "PercentInstitutions": "29.409", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:4", "LastSplitDate": "2014-06-06"}