{"Symbol": "INOD", "AssetType": "Common Stock", "Name": "Innodata Inc", "Description": "Innodata Inc. operates as a digital services and solution company worldwide. The company operates through three segments: Digital Data Solutions (DDS), Synodex, and Agility PR Solutions (Agility). The DDS segment combines deep neural networks and human expertise to make unstructured information useable for various domains, including health, science, and law. The Synodex segment transforms medical records into useable digital data and applies technologies to the digital data to augment decision support. The Agility segment offers various tools and related professional services, such as content amplification solution, integrated newswire services, an influencer targeting solution to help PR professionals identify influencers, and media monitoring and analysis solution. This segment also provides media monitoring and PR measurement; and PR reporting and measurement services, including custom reports and PR measurement and social media/influencer analysis, as well as Bulldog Reporter, a publisher of PR-related news and a popular e-newsletter, and Bulldog Awards, a PR awards program that recognizes outstanding performance among PR and communications professionals and agencies. In addition, it provides various services, including acquisition, transformation, and digital data enrichment. In addition, the company offers digital operations management and analytics, such as IP rights, contract, publishing workflow, publisher relationship, and transaction management, as well as provides customer relations, data processing, and regulatory reporting services. Further, it develops and maintains content applications. The company serves banking and financial services, technology, digital retailing, healthcare, science, and insurance sector through its professional staff, senior management, and direct sales personnel. Innodata Inc. was founded in 1988 and is headquartered in Ridgefield Park, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Information Technology Services", "Address": "55 Challenger Road, Ridgefield Park, NJ, United States, 07660", "FullTimeEmployees": "3000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "51364736", "EBITDA": "3145000", "PERatio": "None", "PEGRatio": "0", "BookValue": "1.034", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.014", "RevenuePerShareTTM": "2.273", "ProfitMargin": "-0.0249", "OperatingMarginTTM": "0.0144", "ReturnOnAssetsTTM": "0.0099", "ReturnOnEquityTTM": "-0.0583", "RevenueTTM": "56918000", "GrossProfitTTM": "21043000", "DilutedEPSTTM": "-0.059", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.016", "AnalystTargetPrice": "5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.9326", "PriceToBookRatio": "2.0496", "EVToRevenue": "0.7977", "EVToEBITDA": "15.9361", "Beta": "1.1725", "52WeekHigh": "2.68", "52WeekLow": "0.75", "50DayMovingAverage": "1.6561", "200DayMovingAverage": "1.2643", "SharesOutstanding": "24459400", "SharesFloat": "21900910", "SharesShort": "6801", "SharesShortPriorMonth": "9913", "ShortRatio": "0.27", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0012", "PercentInsiders": "10.215", "PercentInstitutions": "20.508", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2001-03-26"}