{"Symbol": "INTL", "AssetType": "Common Stock", "Name": "INTL FCStone Inc", "Description": "StoneX Group Inc. operates as a financial services company worldwide. The company's Commercial Hedging segment offers risk management consulting services related to agricultural and energy commodities, and base metal products listed on the London Metals Exchange. Its Global Payments segment provides foreign exchange and treasury services to banks and commercial businesses; charities and non-governmental organizations, and government organizations; and payments services. The company's Securities segment offers value-added solutions that facilitate cross-border trading in foreign securities, including unlisted American Depositary Receipts, Global Depository Receipts, and foreign ordinary shares. It also operates as an institutional dealer in fixed income securities to serve asset managers, commercial bank trust and investment departments, broker-dealers, and insurance companies. In addition, this segment originates, structures, and places debt instruments; trades in various international debt instruments; and operates an asset management business. The company's Physical Commodities segment provides a range of trading and hedging services comprising over-the-counter (OTC) products for various producers, consumers, and investors. It also provides financing services to commercial commodity-related companies against physical inventories. The company's Clearing and Execution Services segment offers prime brokerage foreign exchange services for the financial institutions and professional traders; provides a range of OTC products, such as 24-hour a day execution of spot, forwards, and options, as well as non-deliverable forwards; and operates a proprietary foreign exchange desk that arbitrages the exchange-traded foreign exchange markets with the cash markets. The company was formerly known as INTL FCStone Inc. and changed its name to StoneX Group Inc. in July 2020. StoneX Group Inc. was founded in 1924 and is headquartered in New York City, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Capital Markets", "Address": "155 East 44th Street, New York City, NY, United States, 10017", "FullTimeEmployees": "2151", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1069080640", "EBITDA": "None", "PERatio": "9.3797", "PEGRatio": "0", "BookValue": "33.752", "DividendPerShare": "None", "DividendYield": "0", "EPS": "5.082", "RevenuePerShareTTM": "2693.603", "ProfitMargin": "0.002", "OperatingMarginTTM": "0.0026", "ReturnOnAssetsTTM": "0.0098", "ReturnOnEquityTTM": "0.1651", "RevenueTTM": "50616799232", "GrossProfitTTM": "591600000", "DilutedEPSTTM": "5.082", "QuarterlyEarningsGrowthYOY": "0.653", "QuarterlyRevenueGrowthYOY": "1.843", "AnalystTargetPrice": "46", "TrailingPE": "9.3797", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.0214", "PriceToBookRatio": "1.6115", "EVToRevenue": "0.0306", "EVToEBITDA": "7.8638", "Beta": "1.4359", "52WeekHigh": "60.16", "52WeekLow": "28.01", "50DayMovingAverage": "56.8474", "200DayMovingAverage": "47.1079", "SharesOutstanding": "19217700", "SharesFloat": "15540401", "SharesShort": "375105", "SharesShortPriorMonth": "462842", "ShortRatio": "3.16", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0274", "PercentInsiders": "16.712", "PercentInstitutions": "77.613", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "11:10", "LastSplitDate": "2000-03-08"}