{"Symbol": "INTLL", "AssetType": "Common Stock", "Name": "INTL FCStone Inc", "Description": "INTL FCStone Inc., together with its subsidiaries, operates as a financial services company worldwide. Its Commercial Hedging segment offers risk management consulting services in the areas of agricultural and energy commodities, and base metals products listed on the LME. The company?s Global Payments segment provides payment solutions to banks and commercial businesses, as well as to charities and non-governmental organizations, and government organizations. Its Securities segment offers value-added solutions that facilitate cross-border trading in foreign securities, including unlisted ADRs and foreign ordinary shares. This segment also provides a range of corporate finance advisory services, such as mergers and acquisitions, liability management, and restructuring opinions and valuations; originates, structures, and places various debt instruments; and trades in various international debt instruments, as well as offers asset management services. The company?s Physical Commodities segment engages in physical precious metals trading activities, such as providing a range of trading and hedging services comprising OTC products for selecting producers, consumers, and investors. This segment also offers financing to commercial commodity-related companies against physical inventories. Its Clearing and Execution Services segment offers prime brokerage foreign exchange services for the financial institutions and professional traders; and operates a proprietary foreign exchange desk that arbitrages the exchange-traded foreign exchange markets with the cash markets. The company also operates an online news and analysis portal for the coffee industry. It was formerly known as International Assets Holding Corporation and changed its name to INTL FCStone Inc. in March 2011. INTL FCStone Inc. was founded in 1924 and is based in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "None", "FiscalYearEnd": "None", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "None", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}