{"Symbol": "INVE", "AssetType": "Common Stock", "Name": "Identiv, Inc", "Description": "Identiv, Inc. operates as a security technology company that secures data, physical places, and things worldwide. It operates through two segment, Premises and Identity. The Premises segment offers modular Hirsch MX controllers that allow customers to start with a small system and expand over time; Hirsch Velocity software platform for centralized management of access and security operations across an organization; federal identity, credential and access management architecture, an access control system; TouchSecure door readers that provide various features to support security standards; and global services to support system design, deployment, and managed services across customers premises security lifecycle. The Identity segment provides smart card readers, which include various contact, contactless, portable, and mobile smart card readers, as well as tokens and terminals to enable logical access, and security and identification applications, such as national ID, payment, e-health, and e-government. The company also offers near field communication and radio frequency identification products, including inlays and inlay-based; labels and tags, as well as other radio frequency and integrated circuits components for use in various applications, such as virtual reality, games, loyalty cards, mobile payment systems, transit and event ticketing, and brand authenticity foe pharmaceuticals, consumer goods, hospital resource management, cold-chain management, and others; and access cards. It markets and sells its products through original equipment manufacturers, dealers, systems integrators, value added resellers, resellers, and Internet, as well as directly to end users. Identiv, Inc. has a strategic partnership with CertiPath. The company was formerly known as Identive Group, Inc. and changed its name to Identiv, Inc. in May 2014. Identiv, Inc. was founded in 1990 and is headquartered in Fremont, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Computer Hardware", "Address": "2201 Walnut Avenue, Fremont, CA, United States, 94538", "FullTimeEmployees": "289", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "107355600", "EBITDA": "530000", "PERatio": "None", "PEGRatio": "0", "BookValue": "1.82", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.086", "RevenuePerShareTTM": "4.553", "ProfitMargin": "-0.07", "OperatingMarginTTM": "-0.0339", "ReturnOnAssetsTTM": "-0.0218", "ReturnOnEquityTTM": "-0.1631", "RevenueTTM": "79221000", "GrossProfitTTM": "36654000", "DilutedEPSTTM": "-0.384", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.141", "AnalystTargetPrice": "7", "TrailingPE": "0", "ForwardPE": "42.735", "PriceToSalesRatioTTM": "1.1883", "PriceToBookRatio": "2.9777", "EVToRevenue": "1.4074", "EVToEBITDA": "37.5662", "Beta": "1.4341", "52WeekHigh": "7.0393", "52WeekLow": "2.1101", "50DayMovingAverage": "5.1603", "200DayMovingAverage": "4.2975", "SharesOutstanding": "17892600", "SharesFloat": "17174777", "SharesShort": "72614", "SharesShortPriorMonth": "103775", "ShortRatio": "1.1", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0088", "PercentInsiders": "5.186", "PercentInstitutions": "34.47", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:10", "LastSplitDate": "2014-05-27"}