{"Symbol": "INWK", "AssetType": "Common Stock", "Name": "InnerWorkings, Inc", "Description": "InnerWorkings, Inc. provides marketing execution solutions in the United States, Canada, the United Kingdom, continental Europe, the Middle East, Africa, Asia, Mexico, Central America, and South America. The company's software applications and databases create an integrated solution that stores, analyzes, and tracks the production capabilities of its supplier network, as well as detailed pricing data. It offers outsourced print management solutions that encompass the design, sourcing, and delivery of printed marketing materials, including direct mail, in-store signage, and marketing collateral; and outsourced solutions for the design, sourcing, and delivery of branded merchandise and product packaging. The company also assists clients with the management of events, promotions spending, and related procurement needs; and designs, sources, and installs point of sale displays, permanent retail fixtures, and store design, as well as offers on-site outsourced creative studio and digital marketing services. In addition, it provides fulfillment and logistics services, such as kitting and assembly, inventory management, and pre-sorting postage. Further, the company offers creative services comprising copywriting, graphics and Website design, identity work and marketing collateral development, and image and print-ready page processing and proofing capability services. It serves corporate clients in a range of industries, including retail, financial services, hospitality, consumer packaged goods, non-profits, healthcare, pharmaceuticals, food and beverage, broadcasting and cable, and transportation. The company was founded in 2001 and is headquartered in Chicago, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Advertising Agencies", "Address": "203 North LaSalle Street, Chicago, IL, United States, 60601", "FullTimeEmployees": "2000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "151129824", "EBITDA": "30713000", "PERatio": "None", "PEGRatio": "1.35", "BookValue": "3.153", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.503", "RevenuePerShareTTM": "20.029", "ProfitMargin": "-0.0171", "OperatingMarginTTM": "0.0227", "ReturnOnAssetsTTM": "0.0263", "ReturnOnEquityTTM": "-0.1049", "RevenueTTM": "1071433024", "GrossProfitTTM": "262009000", "DilutedEPSTTM": "-0.437", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.284", "AnalystTargetPrice": "3", "TrailingPE": "0", "ForwardPE": "20.3666", "PriceToSalesRatioTTM": "0.1441", "PriceToBookRatio": "0.9093", "EVToRevenue": "0.2689", "EVToEBITDA": "19.7322", "Beta": "2.6121", "52WeekHigh": "5.81", "52WeekLow": "0.87", "50DayMovingAverage": "2.6372", "200DayMovingAverage": "1.9916", "SharesOutstanding": "52842600", "SharesFloat": "36477050", "SharesShort": "1479429", "SharesShortPriorMonth": "2416719", "ShortRatio": "0.82", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0329", "PercentInsiders": "21.894", "PercentInstitutions": "84.208", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}