{"Symbol": "IOSP", "AssetType": "Common Stock", "Name": "Innospec Inc", "Description": "Innospec Inc. develops, manufactures, blends, markets, and supplies specialty chemicals worldwide. It operates through four segments: Fuel Specialties, Performance Chemicals, Oilfield Services, and Octane Additives. The Fuel Specialties segment offers a range of specialty chemical products used as additives in various fuels. Its products are used in the operation of automotive, marine, and aviation engines; power station generators; and heating oil. The Performance Chemicals segment provides technology-based solutions for its customers' processes or products focused in the personal care, home care, agrochemical, and metal extraction markets. The Oilfield Services segment develops and markets products to prevent loss of mud in drilling operations; chemical solutions for fracturing, stimulation, and completion operations; and products for oil and gas production, which enable flow assurance and maintain asset integrity. The Octane Additives segment produces and sells tetra ethyl lead (TEL) for use in automotive gasoline. This segment is also involved in environmental remediation business that manages the cleanup of redundant TEL facilities. The company sells its products primarily to oil and gas exploration and production companies, oil refineries, fuel manufacturers and users, personal care and home care companies, formulators of agrochemical and metal extraction preparations, and other chemical and industrial companies. The company was formerly known as Octel Corp. and changed its name to Innospec Inc. in January 2006. Innospec Inc. was founded in 1938 and is headquartered in Englewood, Colorado.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Basic Materials", "Industry": "Specialty Chemicals", "Address": "8310 South Valley Highway, Englewood, CO, United States, 80112", "FullTimeEmployees": "2000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1877977984", "EBITDA": "168200000", "PERatio": "34.4909", "PEGRatio": "-2.95", "BookValue": "36.6", "DividendPerShare": "1.04", "DividendYield": "0.0137", "EPS": "2.212", "RevenuePerShareTTM": "56.269", "ProfitMargin": "0.0396", "OperatingMarginTTM": "0.0878", "ReturnOnAssetsTTM": "0.0536", "ReturnOnEquityTTM": "0.062", "RevenueTTM": "1379800064", "GrossProfitTTM": "470600000", "DilutedEPSTTM": "2.212", "QuarterlyEarningsGrowthYOY": "0.145", "QuarterlyRevenueGrowthYOY": "-0.324", "AnalystTargetPrice": "90", "TrailingPE": "34.4909", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.3565", "PriceToBookRatio": "2.0732", "EVToRevenue": "1.359", "EVToEBITDA": "15.2829", "Beta": "1.1879", "52WeekHigh": "107.845", "52WeekLow": "56.71", "50DayMovingAverage": "77.7453", "200DayMovingAverage": "76.5248", "SharesOutstanding": "24568000", "SharesFloat": "24228423", "SharesShort": "540871", "SharesShortPriorMonth": "427624", "ShortRatio": "4.53", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0268", "PercentInsiders": "1.357", "PercentInstitutions": "95.677", "ForwardAnnualDividendRate": "1.04", "ForwardAnnualDividendYield": "0.0137", "PayoutRatio": "0.4727", "DividendDate": "2020-05-26", "ExDividendDate": "2020-05-15", "LastSplitFactor": "2:1", "LastSplitDate": "2007-07-23"}