{"Symbol": "IPGP", "AssetType": "Common Stock", "Name": "IPG Photonics Corporation", "Description": "IPG Photonics Corporation develops and manufactures a range of high-performance fiber lasers, fiber amplifiers, and diode lasers used in various applications primarily in materials processing worldwide. The company's laser products include high power lasers; fiber pigtailed packaged diodes and fiber coupled direct diode laser systems; high-energy pulsed lasers, multi-wavelength and tunable lasers, and single-polarization and single-frequency lasers; and high power optical fiber delivery cables, fiber couplers, beam switches, chillers, scanners, and other accessories. It also provides erbium-doped fiber and Raman amplifiers, and integrated communications systems, which are deployed in broadband networks; and ytterbium and thulium specialty fiber amplifiers and broadband light sources. In addition, the company offers integrated laser systems; 2D compact flat sheet cutter systems and multi-axis systems; welding seam stepper and picker, a fiber laser welding tool; and specialized fiber laser systems for material processing applications; and optical transceiver and transponder modules for interconnecting electronic equipment, including Ethernet switches, IP routers and SONET/SDH optical transport modules within telecommunications, cable multi-system operator, and data center networking applications. Its lasers and amplifiers are also used in materials processing, advanced communications, and medical applications. The company markets its products to original equipment manufacturers, system integrators, and end users through direct sales force, as well as through agreements with independent sales representatives and distributors. IPG Photonics Corporation was founded in 1990 and is headquartered in Oxford, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Semiconductor Equipment & Materials", "Address": "50 Old Webster Road, Oxford, MA, United States, 01540", "FullTimeEmployees": "5960", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "8502479872", "EBITDA": "307280992", "PERatio": "65.2563", "PEGRatio": "2.52", "BookValue": "45.811", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.378", "RevenuePerShareTTM": "22.264", "ProfitMargin": "0.1079", "OperatingMarginTTM": "0.1787", "ReturnOnAssetsTTM": "0.048", "ReturnOnEquityTTM": "0.0533", "RevenueTTM": "1181417984", "GrossProfitTTM": "606209000", "DilutedEPSTTM": "2.378", "QuarterlyEarningsGrowthYOY": "-0.47", "QuarterlyRevenueGrowthYOY": "-0.185", "AnalystTargetPrice": "181.86", "TrailingPE": "65.2563", "ForwardPE": "59.5238", "PriceToSalesRatioTTM": "7.0588", "PriceToBookRatio": "3.395", "EVToRevenue": "5.9822", "EVToEBITDA": "22.9999", "Beta": "1.7126", "52WeekHigh": "184.02", "52WeekLow": "98.04", "50DayMovingAverage": "166.3086", "200DayMovingAverage": "144.7434", "SharesOutstanding": "53257000", "SharesFloat": "37153654", "SharesShort": "1312228", "SharesShortPriorMonth": "1463537", "ShortRatio": "2.99", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0418", "PercentInsiders": "33.806", "PercentInstitutions": "68.323", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2012-12-28", "ExDividendDate": "2012-12-19", "LastSplitFactor": "None", "LastSplitDate": "None"}