{"Symbol": "IPHS", "AssetType": "Common Stock", "Name": "Innophos Holdings, Inc", "Description": "Innophos Holdings, Inc., together with its subsidiaries, produces specialty ingredients with applications in food, health, nutrition, and industrial markets. It operates through three segments: Food, Health and Nutrition; Industrial Specialties; and Other. The company's specialty ingredients include specialty phosphate products, specialty phosphoric acids, as well as other mineral, enzyme, and botanical based specialty ingredients that are used as flavor enhancers in beverages; electrolytes in sports drinks; texture modifiers in cheeses; leavening agents in baked goods; calcium and phosphorus fortification in food and beverages; moisture and color retention in seafood, poultry, and meat; excipients in vitamins, minerals, nutritional supplements, and pharmaceuticals; and abrasives in toothpaste. It also provides food and technical grade purified phosphoric acid (PPA) used in the production of phosphate salts, as well as in food and beverages, and water treatment applications; technical grade sodium tripolyphosphate (STPP), a specialty phosphate, which is used as an ingredient in cleaning products, such as industrial and institutional cleaners, automatic dishwashing detergents, and consumer laundry detergents, as well as in water treatment, clay processing, and copper ore processing activities; and detergent grade PPA that is primarily used in the production of STPP. In addition, the company offers granular triple super-phosphate (GTSP), a fertilizer product line used for enhancing crop yields in various agricultural sectors; and merchant green phosphoric acid. It serves primarily consumer goods manufacturers, distributors, and specialty chemical manufacturers in the United States, Canada, Mexico, and internationally. Innophos Holdings, Inc. was founded in 2004 and is headquartered in Cranbury, New Jersey. As of February 7, 2020, Innophos Holdings, Inc. operates as a subsidiary of Iris Parent LLC.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "259 Prospect Plains Road\n08512,Cranbury,GBR\n", "FullTimeEmployees": "1485", "FiscalYearEnd": "December", "LatestQuarter": "0000-00-00", "MarketCapitalization": "629908672", "EBITDA": "109780000", "PERatio": "29.6204", "PEGRatio": "1.4", "BookValue": "17.291", "DividendPerShare": "1.92", "DividendYield": "0.0015", "EPS": "1.079", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "153091000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "32", "TrailingPE": "29.6204", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.8318", "PriceToBookRatio": "1.8642", "EVToRevenue": "1.3118", "EVToEBITDA": "9.9905", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "31.99", "200DayMovingAverage": "32.1346", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "187270", "SharesShortPriorMonth": "263166", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0.0015", "PayoutRatio": "0", "DividendDate": "2019-09-06", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}