{"Symbol": "IRDM", "AssetType": "Common Stock", "Name": "Iridium Communications Inc", "Description": "Iridium Communications Inc. provides mobile voice and data communications services and product to businesses, the United States and foreign governments, non-governmental organizations, and consumers worldwide. The company offers postpaid mobile voice and data satellite communications; prepaid mobile voice satellite communications; push-to-talk; broadband data; and Internet of Things (IoT) services. It also provides other services, such as inbound connections from the public switched telephone network, short message, subscriber identity module, activation, customer reactivation, and other peripheral services. In addition, the company offers voice and data solutions comprising personnel tracking devices; asset tracking devices for equipment, vehicles, and aircrafts; beyond-line-of-sight aircraft communications applications; maritime communications applications; specialized communications solutions for high-value individuals; mobile communications and data devices for the military and intelligence community, such as secure satellite handsets, as well as netted voice, messaging, and paging services; and maintenance services for the department of defense's dedicated gateway. Further, it provides satellite handsets, personal connectivity devices, voice and data modems, broadband data devices, and IoT data devices; various accessories for its devices that include batteries, holsters, earbud headphones, portable auxiliary antennas, antenna adaptors, USB data cables, charging units, and others; and engineering and support services. Iridium Communications Inc. sells its products and services to commercial end users through a wholesale distribution network that include service providers, and value-added resellers and manufacturers. The company was formerly known as Iridium Holdings LLC and changed its name to Iridium Communications Inc. in September 2009. Iridium Communications Inc. was founded in 2000 and is headquartered in McLean, Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Telecom Services", "Address": "1750 Tysons Boulevard, McLean, VA, United States, 22102", "FullTimeEmployees": "497", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3769068032", "EBITDA": "326931008", "PERatio": "None", "PEGRatio": "1.42", "BookValue": "10.633", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.567", "RevenuePerShareTTM": "4.296", "ProfitMargin": "-0.2987", "OperatingMarginTTM": "0.0451", "ReturnOnAssetsTTM": "0.0044", "ReturnOnEquityTTM": "-0.114", "RevenueTTM": "569118976", "GrossProfitTTM": "415300000", "DilutedEPSTTM": "-1.285", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.02", "AnalystTargetPrice": "31.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "6.6057", "PriceToBookRatio": "2.669", "EVToRevenue": "9.2461", "EVToEBITDA": "17.6576", "Beta": "1.4264", "52WeekHigh": "32.08", "52WeekLow": "16.87", "50DayMovingAverage": "27.9133", "200DayMovingAverage": "25.2846", "SharesOutstanding": "132527000", "SharesFloat": "116821036", "SharesShort": "8239824", "SharesShortPriorMonth": "8167709", "ShortRatio": "8.57", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0652", "PercentInsiders": "12.476", "PercentInstitutions": "84.856", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}