{"Symbol": "IRIX", "AssetType": "Common Stock", "Name": "IRIDEX Corporation", "Description": "IRIDEX Corporation, an ophthalmic medical technology company, provides therapeutic based laser systems, delivery devices, and consumable instrumentation to treat sight-threatening eye diseases in ophthalmology. The company offers laser consoles, such as Cyclo G6 laser system for use in the treatment of glaucoma; IQ 532 and IQ 577 laser photocoagulation systems, which are used for the treatment of diabetic macular edema and other retinal diseases; and OcuLight TX, OcuLight SL, OcuLight SLx, OcuLight GL, and OcuLight GLx laser photocoagulation systems that are used to treat proliferative diabetic retinopathy, macular holes, retinal tears, and detachments. It also provides delivery devices, including TxCell scanning laser delivery system that allows the physician to perform multi-spot pattern scanning; slit lamp adapter, which allows the physician to utilize a standard slit lamp in diagnosis and treatment procedures; and laser indirect ophthalmoscope for use in procedures to treat peripheral retinal disorders. In addition, the company offers MicroPulse P3 Probe, which is used with its Cylco G6 laser system that delivers laser to treat glaucoma; G-Probe, which is used in procedures to treat uncontrolled glaucoma; G-Probe and G-Probe Illuminate, which are used in procedures to treat refractory glaucoma; and EndoProbe family of products for use in vitrectomy procedures. It serves ophthalmologists, research and teaching hospitals, government installations, surgical centers, hospitals, and office clinics. IRIDEX Corporation markets its products through direct and independent sales force in the United States, as well as through independent distributors internationally. The company was formerly known as IRIS Medical Instruments, Inc. and changed its name to IRIDEX Corporation in November 1995. IRIDEX Corporation was founded in 1989 and is headquartered in Mountain View, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "1212 Terra Bella Avenue, Mountain View, CA, United States, 94043", "FullTimeEmployees": "94", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "29441286", "EBITDA": "-10705000", "PERatio": "None", "PEGRatio": "-0.44", "BookValue": "1.356", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.864", "RevenuePerShareTTM": "2.733", "ProfitMargin": "-0.2065", "OperatingMarginTTM": "-0.2099", "ReturnOnAssetsTTM": "-0.1459", "ReturnOnEquityTTM": "-0.3501", "RevenueTTM": "37666000", "GrossProfitTTM": "17939000", "DilutedEPSTTM": "-0.564", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.404", "AnalystTargetPrice": "4.75", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.7391", "PriceToBookRatio": "1.4926", "EVToRevenue": "0.5692", "EVToEBITDA": "0", "Beta": "1.1093", "52WeekHigh": "4.24", "52WeekLow": "1.36", "50DayMovingAverage": "2.1283", "200DayMovingAverage": "2.0941", "SharesOutstanding": "13887400", "SharesFloat": "10341976", "SharesShort": "163982", "SharesShortPriorMonth": "161029", "ShortRatio": "5.85", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0121", "PercentInsiders": "14.024", "PercentInstitutions": "48.06", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}