{"Symbol": "ISSC", "AssetType": "Common Stock", "Name": "Innovative Solutions and Support, Inc", "Description": "Innovative Solutions and Support, Inc., a systems integrator, designs, develops, manufactures, sells, and services flight guidance, autothrottle, and cockpit display system in the United States and internationally. It offers flat panel display systems that replicates the display of analog or digital displays on one screen and replace existing displays in legacy aircraft, as well as used for security monitoring on-board aircraft and as tactical workstations on military aircraft; and flight management systems that complement the flat panel display system upgrade for commercial air transport aircraft. The company also provides integrated standby units, which incorporate the measurement and display of attitude, altitude, airspeed, and navigation data into a single standby/backup navigation instrument for military, commercial air transport, and corporate/general aviation applications. In addition, it offers digital air data computers that calculate various air data parameters, such as altitude, airspeed, vertical speed, angle of attack, and other information; integrated air data computers and display units, which calculate and convey air data information; altitude displays that convey aircraft altitude measurements; airspeed displays that convey various airspeed measurements; and altitude alerters. Further, the company offers engine and fuel displays that convey information related to fuel and oil levels, and engine activity, including oil and hydraulic pressure and temperature; integrated global navigation systems; ThrustSense, a full regime autothrottle; and utilities management systems. It serves commercial air transport carriers and corporate/general aviation companies, Department of Defense and its commercial contractors, aircraft operators, aircraft modification centers, government agencies, foreign militaries, and original equipment manufacturers. The company was founded in 1988 and is based in Exton, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "720 Pennsylvania Drive, Exton, PA, United States, 19341", "FullTimeEmployees": "71", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "125684560", "EBITDA": "2811469", "PERatio": "39.4444", "PEGRatio": "0", "BookValue": "2.261", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.179", "RevenuePerShareTTM": "1.188", "ProfitMargin": "0.1504", "OperatingMarginTTM": "0.1194", "ReturnOnAssetsTTM": "0.0381", "ReturnOnEquityTTM": "0.0821", "RevenueTTM": "20102170", "GrossProfitTTM": "9896470", "DilutedEPSTTM": "0.179", "QuarterlyEarningsGrowthYOY": "1.333", "QuarterlyRevenueGrowthYOY": "0.297", "AnalystTargetPrice": "10", "TrailingPE": "39.4444", "ForwardPE": "0", "PriceToSalesRatioTTM": "6.0367", "PriceToBookRatio": "3.1401", "EVToRevenue": "4.8587", "EVToEBITDA": "34.7403", "Beta": "0.9571", "52WeekHigh": "7.64", "52WeekLow": "1.2", "50DayMovingAverage": "5.9017", "200DayMovingAverage": "4.8716", "SharesOutstanding": "16984400", "SharesFloat": "10546309", "SharesShort": "24305", "SharesShortPriorMonth": "26892", "ShortRatio": "0.26", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0018", "PercentInsiders": "32.355", "PercentInstitutions": "30.718", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2012-12-27", "ExDividendDate": "2012-12-28", "LastSplitFactor": "3:2", "LastSplitDate": "2005-07-08"}