{"Symbol": "ITRN", "AssetType": "Common Stock", "Name": "Ituran Location and Control Ltd", "Description": "Ituran Location and Control Ltd., together with its subsidiaries, provides location-based services and wireless communications products. The company's Location-Based Services segment provides stolen vehicle recovery and tracking services, which locate, track, and recover stolen vehicles for its subscribers; fleet management services that enable corporate and individual customers to track and manage their vehicles in real time; and personal locator services that allow customers to protect valuable merchandise and equipment. It also offers on-demand navigation guidance, information, and assistance, including the provision of traffic reports and directions, as well as information on the location of gas stations, car repair shops, post offices, hospitals, and other facilities; and Connect, an Android platform that provides access to Android applications and various services through manufacturer interface. This segment serves insurance companies and agents, car manufacturers, dealers and importers, cooperative sales channels, and private subscribers. The company's Wireless Communications Products segment provides Base Site, a radio receiver that includes a processor and a data computation unit to collect and send data to and from transponders, and to control centers; Control Center, a center consisting of software used to collect data from various base sites, conduct location calculations, and transmit location data to various customers and law enforcement agencies; navigation and tracking devices installed in vehicles; and SMART, a portable transmitter installed in vehicles that sends a signal to the base site enabling the location of vehicles, equipment, or an individual. As of December 31, 2018, it served approximately 230,000 end-users through 40,000 corporate customers in Israel, Brazil, Argentina, Mexico, Ecuador, Colombia, and the United States. The company was founded in 1994 and is headquartered in Azor, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "3 Hashikma Street, Azor, Israel, 58001", "FullTimeEmployees": "3000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "358704096", "EBITDA": "62167000", "PERatio": "56.6154", "PEGRatio": "0", "BookValue": "5.19", "DividendPerShare": "0.96", "DividendYield": "0.0631", "EPS": "0.327", "RevenuePerShareTTM": "12.274", "ProfitMargin": "-0.0345", "OperatingMarginTTM": "0.1604", "ReturnOnAssetsTTM": "0.0757", "ReturnOnEquityTTM": "-0.0568", "RevenueTTM": "256171008", "GrossProfitTTM": "130518000", "DilutedEPSTTM": "-0.423", "QuarterlyEarningsGrowthYOY": "-0.19", "QuarterlyRevenueGrowthYOY": "-0.252", "AnalystTargetPrice": "19.5", "TrailingPE": "56.6154", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.1968", "PriceToBookRatio": "3.1923", "EVToRevenue": "1.3914", "EVToEBITDA": "9.3154", "Beta": "1.233", "52WeekHigh": "28.94", "52WeekLow": "11.01", "50DayMovingAverage": "14.5803", "200DayMovingAverage": "16.6457", "SharesOutstanding": "23475400", "SharesFloat": "13837315", "SharesShort": "62543", "SharesShortPriorMonth": "27488", "ShortRatio": "1.26", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0015", "PercentInsiders": "19.875", "PercentInstitutions": "53.972", "ForwardAnnualDividendRate": "0.96", "ForwardAnnualDividendYield": "0.0631", "PayoutRatio": "3.6923", "DividendDate": "2020-04-07", "ExDividendDate": "2020-03-23", "LastSplitFactor": "3:1", "LastSplitDate": "2005-09-22"}