{"Symbol": "JAKK", "AssetType": "Common Stock", "Name": "JAKKS Pacific, Inc", "Description": "JAKKS Pacific, Inc. develops, produces, and markets consumer and related products worldwide. The company operates through three segments: U.S. and Canada, International, and Halloween. It offers action figures and accessories, such as licensed characters; toy vehicles and accessories; dolls and accessories, including small, large, fashion, and baby dolls based on licenses, as well as infant and pre-school products; private label products; and foot-to-floor ride-on products, inflatable environments, tents, and wagons. The company also provides role and pretend play, dress-up, and novelty products for boys and girls based on various brands and entertainment properties, as well as on its own proprietary brands; and indoor and outdoor kids' furniture, activity trays and tables, room dcor, kiddie pools, and seasonal and outdoor products. In addition, it offers Halloween and everyday costumes for various ages based on licensed and proprietary non-licensed brands, and related Halloween accessories; outdoor activity toys; and junior sports toys, including hyper-charged balls, sport sets, and toy hoops. The company sells its products through in-house sales staff and independent sales representatives to toy and mass-market retail chain stores, department stores, office supply stores, drug and grocery store chains, club stores, toy specialty stores, and wholesalers. It offers its products under the Perfectly Cute, Real Workin' Buddies, XPV, Disguise, Moose Mountain, Maui, and Kids Only! proprietary brands. JAKKS Pacific, Inc. was founded in 1995 and is headquartered in Santa Monica, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Leisure", "Address": "2951 28th Street, Santa Monica, CA, United States, 90405", "FullTimeEmployees": "637", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17996086", "EBITDA": "25927000", "PERatio": "0.0644", "PEGRatio": "2.37", "BookValue": "0.711", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.682", "RevenuePerShareTTM": "196.55", "ProfitMargin": "-0.0678", "OperatingMarginTTM": "0.0196", "ReturnOnAssetsTTM": "0.0225", "ReturnOnEquityTTM": "-5.0508", "RevenueTTM": "577955968", "GrossProfitTTM": "159345000", "DilutedEPSTTM": "-13.722", "QuarterlyEarningsGrowthYOY": "0.351", "QuarterlyRevenueGrowthYOY": "-0.173", "AnalystTargetPrice": "6.5", "TrailingPE": "0.0644", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.0244", "PriceToBookRatio": "6.3474", "EVToRevenue": "0.3089", "EVToEBITDA": "0", "Beta": "2.9879", "52WeekHigh": "9", "52WeekLow": "0.3", "50DayMovingAverage": "5.518", "200DayMovingAverage": "6.1709", "SharesOutstanding": "4244360", "SharesFloat": "2020885", "SharesShort": "5565038", "SharesShortPriorMonth": "2211238", "ShortRatio": "0.77", "ShortPercentOutstanding": "0.09", "ShortPercentFloat": "0.1241", "PercentInsiders": "40.707", "PercentInstitutions": "38.577", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2013-07-01", "ExDividendDate": "2013-06-12", "LastSplitFactor": "1:10", "LastSplitDate": "2020-07-10"}