{"Symbol": "JBHT", "AssetType": "Common Stock", "Name": "J.B. Hunt Transport Services, Inc", "Description": "J.B. Hunt Transport Services, Inc., together with its subsidiaries, provides surface transportation and delivery services in the continental United States, Canada, and Mexico. It operates in four segments: Intermodal (JBI), Dedicated Contract Services (DCS), Integrated Capacity Solutions (ICS), and Truckload (JBT). The JBI segment offers intermodal freight solutions, including origin and destination pickup, and delivery services. It operates 96,743 pieces of company-owned trailing equipment; owns and maintains its own chassis fleet of 82,731 units; and manages a fleet of 4,989 company-owned tractors, 570 independent contractor trucks, and 6,376 company drivers. The DCS segment designs, develops, and executes supply-chain solutions that support various transportation networks. As of December 31, 2019, it operated 10,542 company-owned trucks, 505 customer-owned trucks, and 40 independent contractor trucks, as well as 20,860 owned pieces of trailing equipment and 7,258 customer-owned trailers. The ICS segment offers traditional freight brokerage and transportation logistics solutions; and flatbed, refrigerated, expedited, and less-than-truckload solutions, as well as various dry-van and intermodal solutions. It also provides an online multimodal marketplace; and single-source logistics management for customers that desire to outsource their transportation functions. This segment operates 37 remote sales offices or branches. The JBT segment offers full-load and dry-van freight services by utilizing tractors operating over roads and highways. As of December 31, 2019, it operated 845 company-owned tractors. The company also transports or arranges for the transportation of freight, including general merchandise, specialty consumer items, appliances, forest and paper products, food and beverages, building materials, soaps and cosmetics, automotive parts, agricultural products, electronics, and chemicals. J.B. Hunt Transport Services, Inc. was incorporated in 1961 and is headquartered in Lowell, Arkansas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Integrated Freight & Logistics", "Address": "615 J.B. Hunt Corporate Drive, Lowell, AR, United States, 72745-0130", "FullTimeEmployees": "29056", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14955617280", "EBITDA": "1234174976", "PERatio": "31.116", "PEGRatio": "2.7091", "BookValue": "22.66", "DividendPerShare": "1.08", "DividendYield": "0.0076", "EPS": "4.572", "RevenuePerShareTTM": "87.031", "ProfitMargin": "0.053", "OperatingMarginTTM": "0.0778", "ReturnOnAssetsTTM": "0.0818", "ReturnOnEquityTTM": "0.2164", "RevenueTTM": "9240382464", "GrossProfitTTM": "1637490000", "DilutedEPSTTM": "4.572", "QuarterlyEarningsGrowthYOY": "-0.073", "QuarterlyRevenueGrowthYOY": "-0.051", "AnalystTargetPrice": "138.15", "TrailingPE": "31.116", "ForwardPE": "31.4465", "PriceToSalesRatioTTM": "1.6494", "PriceToBookRatio": "6.2752", "EVToRevenue": "1.7354", "EVToEBITDA": "13.1414", "Beta": "1.0055", "52WeekHigh": "144.35", "52WeekLow": "75.29", "50DayMovingAverage": "134.6039", "200DayMovingAverage": "112.1699", "SharesOutstanding": "105507000", "SharesFloat": "83633466", "SharesShort": "3074021", "SharesShortPriorMonth": "3750308", "ShortRatio": "2.74", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0384", "PercentInsiders": "20.665", "PercentInstitutions": "77.553", "ForwardAnnualDividendRate": "1.08", "ForwardAnnualDividendYield": "0.0076", "PayoutRatio": "0.2319", "DividendDate": "2020-08-21", "ExDividendDate": "2020-08-06", "LastSplitFactor": "2:1", "LastSplitDate": "2005-05-24"}