{"Symbol": "JCOM", "AssetType": "Common Stock", "Name": "J2 Global, Inc", "Description": "J2 Global, Inc., together with its subsidiaries, provides Internet services worldwide. The company operates through three segments: Fax and Martech; Voice, Backup, Security, and Consumer Privacy and Protection; and Digital Media. It offers cloud services, which includes online fax services under the eFax, sFax, MyFax, eFax Plus, eFax Pro, eFax Secure, eFax Corporate, and eFax Developer brands; on-demand voice, cloud phone, and unified communications services under the eVoice, Line2, and Onebox names; online backup and disaster recovery, sync storage, veeam services, and synchronization and sharing solutions under the KeepItSafe, LiveDrive, LiveVault, OffsiteDataSync, and SugarSync names; email security, web security, and endpoint protection services under the VIPRE and Excel Micro brands; email marketing and delivery services under the Campaigner and SMTP names; virtual private network services under the IPVanish and Encrypt.me; IP licensing services; and customer support services. The company also operates a portfolio of Web properties and applications, including IGN, Mashable, PC Mag, Humble Bundle, Speedtest, Offers, Black Friday, AskMen, MedPageToday, Everyday Health, What to Expect, and others that offer technology products, gaming and lifestyle products and services, news and commentary related products, speed testing for Internet and network connections, online deals and discounts for consumers, interactive tools and mobile applications, and tools and information for healthcare professionals, as well as professional networking tools, targeted emails, and white papers for IT professionals. It serves sole proprietors, small to medium-sized businesses and enterprises, and government organizations. The company was formerly known as j2 Global Communications, Inc. and changed its name to j2 Global, Inc. in December 2011. J2 Global, Inc. was founded in 1995 and is headquartered in Los Angeles, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "700 South Flower Street, Los Angeles, CA, United States, 90017", "FullTimeEmployees": "3090", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3375770112", "EBITDA": "525390016", "PERatio": "19.8844", "PEGRatio": "0.84", "BookValue": "26.937", "DividendPerShare": "None", "DividendYield": "0.0064", "EPS": "3.736", "RevenuePerShareTTM": "29.785", "ProfitMargin": "0.1313", "OperatingMarginTTM": "0.2091", "ReturnOnAssetsTTM": "0.0593", "ReturnOnEquityTTM": "0.1588", "RevenueTTM": "1413106048", "GrossProfitTTM": "1134731000", "DilutedEPSTTM": "3.736", "QuarterlyEarningsGrowthYOY": "0.212", "QuarterlyRevenueGrowthYOY": "0.027", "AnalystTargetPrice": "97.5", "TrailingPE": "19.8844", "ForwardPE": "33.3333", "PriceToSalesRatioTTM": "2.5525", "PriceToBookRatio": "2.7878", "EVToRevenue": "3.1738", "EVToEBITDA": "8.5518", "Beta": "0.6604", "52WeekHigh": "104.57", "52WeekLow": "53.245", "50DayMovingAverage": "62.5833", "200DayMovingAverage": "73.1843", "SharesOutstanding": "47606400", "SharesFloat": "42381166", "SharesShort": "4679420", "SharesShortPriorMonth": "4300111", "ShortRatio": "7.53", "ShortPercentOutstanding": "0.14", "ShortPercentFloat": "0.1738", "PercentInsiders": "5.763", "PercentInstitutions": "107.896", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0.0064", "PayoutRatio": "0", "DividendDate": "2019-06-04", "ExDividendDate": "2019-05-17", "LastSplitFactor": "2:1", "LastSplitDate": "2006-05-25"}