{"Symbol": "JD", "AssetType": "Common Stock", "Name": "JD.com, Inc", "Description": "JD.com, Inc., through its subsidiaries, operates as an e-commerce company and retail infrastructure service provider in the People's Republic of China. It operates in two segments, JD Retail and New Businesses. The company offers home appliances; mobile handsets and other digital products; desktop, laptop, and other computers, as well as printers and other office equipment; furniture and household goods; apparel; cosmetics, personal care items, and pet products; women's shoes, bags, jewelry, and luxury goods; men's shoes, sports gears, and fitness equipment; automobiles and accessories; maternal and childcare products, toys, and musical instruments; and food, beverage, and fresh produce. It also provides gifts, flowers, and plants; nutritional supplements, healthcare services, and other healthcare equipment; books, e-books, music, movie, and other media products; and virtual goods, such as online travel agency, attraction tickets, and prepaid phone and game cards, as well as industrial products and installation and maintenance services. In addition, the company offers an online marketplace for third-party merchants to sell products to customers; and transaction processing and billing and other services. Further, it provides online marketing services for suppliers, third-party merchants, and other business partners; supply chain and logistics services for various industries; and consumer financing services to individual customers, as well as online-to-offline solutions. JD.com, Inc. offers its products through its website jd.com and mobile apps, as well as directly to customers. As of December 31, 2019, JD.com, Inc. operated fulfillment centers in seven cities; and 700 warehouses in 89 cities covering various counties and districts. The company has strategic cooperation agreement with Tencent Holdings Limited. JD.com, Inc. is headquartered in Beijing, China.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Internet Retail", "Address": "Building A, Beijing, China, 101111", "FullTimeEmployees": "240000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "128094322688", "EBITDA": "None", "PERatio": "38.5564", "PEGRatio": "1.417", "BookValue": "6.719", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.147", "RevenuePerShareTTM": "0", "ProfitMargin": "0.0333", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0.0185", "ReturnOnEquityTTM": "0.1768", "RevenueTTM": "0", "GrossProfitTTM": "47453052000", "DilutedEPSTTM": "0.147", "QuarterlyEarningsGrowthYOY": "24.065", "QuarterlyRevenueGrowthYOY": "0.338", "AnalystTargetPrice": "77.27", "TrailingPE": "38.5564", "ForwardPE": "54.6448", "PriceToSalesRatioTTM": "1.259", "PriceToBookRatio": "6.2535", "EVToRevenue": "0.1762", "EVToEBITDA": "4.658", "Beta": "0.9885", "52WeekHigh": "81.45", "52WeekLow": "27.47", "50DayMovingAverage": "66.2208", "200DayMovingAverage": "52.6286", "SharesOutstanding": "1555139968", "SharesFloat": "872836690", "SharesShort": "37901900", "SharesShortPriorMonth": "38188075", "ShortRatio": "3.36", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0", "PercentInsiders": "7.6", "PercentInstitutions": "50.209", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}