{"Symbol": "JJSF", "AssetType": "Common Stock", "Name": "J & J Snack Foods Corp", "Description": "J & J Snack Foods Corp. manufactures, markets, and distributes nutritional snack foods and beverages in the United States, Mexico, and Canada. It operates in three segments: Food Service, Retail Supermarkets, and Frozen Beverages. The company offers soft pretzels under the SUPERPRETZEL, PRETZEL FILLERS, PRETZELFILS, GOURMET TWISTS, MR. TWISTER, SOFT PRETZEL BITES, SOFTSTIX, SOFT PRETZEL BUNS, TEXAS TWIST, BAVARIAN BAKERY, SUPERPRETZEL BAVARIAN, NEW YORK PRETZEL, KIM & SCOTT'S GOURMET PRETZELS, SERIOUSLY TWISTED!, BRAUHAUS, AUNTIE ANNE'S, and LABRIOLA brands, as well as under the private labels. It also provides frozen juice treats and desserts under the LUIGI'S, WHOLE FRUIT, PHILLY SWIRL, SOUR PATCH KIDS, ICEE, and MINUTE MAID brands; churros under the TIO PEPE'S and CALIFORNIA CHURROS brands; and dough enrobed handheld products under the PATIO, SUPREME STUFFERS, and SWEET STUFFERS brands. In addition, the company offers bakery products, including biscuits, fig and fruit bars, cookies, breads, rolls, crumb, muffins, and donuts under the MRS. GOODCOOKIE, READI-BAKE, COUNTRY HOME, MARY B'S, DADDY RAY'S, and HILL & VALLEY brands, as well as under private labels; and frozen beverages under the ICEE, SLUSH PUPPIE, and PARROT ICE brands. Further, it provides funnel cakes under the FUNNEL CAKE FACTORY brand, as well as various other food products; and sells machines and machine parts to other food and beverage companies. The company serves snack bars and food stands in chain, department and mass merchandising stores, malls and shopping centers, fast food and casual dining restaurants, stadiums and sports arenas, leisure and theme parks, convenience stores, movie theatres, warehouse club stores, schools, colleges and other institutions, and independent retailers. It sells its products through a network of food brokers and independent sales distributors; and direct sales force. The company was founded in 1971 and is headquartered in Pennsauken, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Defensive", "Industry": "Packaged Foods", "Address": "6000 Central Highway, Pennsauken, NJ, United States, 08109", "FullTimeEmployees": "4600", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2592946944", "EBITDA": "101984000", "PERatio": "68.6212", "PEGRatio": "5.25", "BookValue": "42.916", "DividendPerShare": "2.3", "DividendYield": "0.0169", "EPS": "1.982", "RevenuePerShareTTM": "57.237", "ProfitMargin": "0.0349", "OperatingMarginTTM": "0.0458", "ReturnOnAssetsTTM": "0.0301", "ReturnOnEquityTTM": "0.0466", "RevenueTTM": "1081373952", "GrossProfitTTM": "350401000", "DilutedEPSTTM": "1.982", "QuarterlyEarningsGrowthYOY": "-0.648", "QuarterlyRevenueGrowthYOY": "-0.343", "AnalystTargetPrice": "127.33", "TrailingPE": "68.6212", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.3938", "PriceToBookRatio": "3.1671", "EVToRevenue": "2.2289", "EVToEBITDA": "24.2196", "Beta": "0.5527", "52WeekHigh": "196.58", "52WeekLow": "105.67", "50DayMovingAverage": "128.9128", "200DayMovingAverage": "132.027", "SharesOutstanding": "18894900", "SharesFloat": "14419271", "SharesShort": "1331063", "SharesShortPriorMonth": "1426615", "ShortRatio": "12.76", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.1072", "PercentInsiders": "19.948", "PercentInstitutions": "75.459", "ForwardAnnualDividendRate": "2.3", "ForwardAnnualDividendYield": "0.0169", "PayoutRatio": "1.1237", "DividendDate": "2020-07-07", "ExDividendDate": "2020-06-12", "LastSplitFactor": "2:1", "LastSplitDate": "2006-01-06"}