{"Symbol": "JOBS", "AssetType": "Common Stock", "Name": "51job, Inc", "Description": "51job, Inc., through its subsidiaries, provides integrated human resource services in the People's Republic of China. The company offers online recruitment services through its Websites comprising 51job.com, yingjiesheng.com, 51jingying.com, lagou.com, and 51mdd.com; and mobile applications that enable job seekers to access their accounts through mobile devices and utilize functions available on their Websites. It also provides other human resource related services, such as business process outsourcing that consist of social insurance, benefits, and payroll processing, as well as compliance services with local governmental employment regulations; and conducts training seminars in the business management, leadership, sales and marketing, human resource, negotiation skills, financial planning and analysis, public administration, manufacturing, secretarial, and other skills. In addition, the company offers campus recruitment services to corporations that seek to recruit college and university students; and placement and executive search services to employers seeking to attract talent and fill job vacancies. Further, it provides professional and scientific assessment tools that assist human resource departments in evaluating capabilities and dispositions of job candidates and existing employees, as well as offers talent assessment services; conducts general and customized surveys on salary, employee retention, and other human resource related topics; organizes and hosts annual human resource conferences and events; and provides support and administrative services to employers on select recruitment projects. The company serves multinational corporations, large national Chinese corporations, and the local Chinese enterprises. It offers its services through sales offices, and a national sales and customer service call center in Wuhan. 51job, Inc. was founded in 1998 and is headquartered in Shanghai, the People's Republic of China.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Staffing & Employment Services", "Address": "Building 3, Shanghai, China, 201203", "FullTimeEmployees": "8180", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4505059840", "EBITDA": "None", "PERatio": "27.2402", "PEGRatio": "64.66", "BookValue": "16.052", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.692", "RevenuePerShareTTM": "0", "ProfitMargin": "0.3022", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0.0439", "ReturnOnEquityTTM": "0.1002", "RevenueTTM": "0", "GrossProfitTTM": "2828056000", "DilutedEPSTTM": "1.692", "QuarterlyEarningsGrowthYOY": "4.55", "QuarterlyRevenueGrowthYOY": "-0.14", "AnalystTargetPrice": "68.28", "TrailingPE": "27.2402", "ForwardPE": "0", "PriceToSalesRatioTTM": "8.4179", "PriceToBookRatio": "2.6302", "EVToRevenue": "0.7769", "EVToEBITDA": "2.9456", "Beta": "1.161", "52WeekHigh": "92.61", "52WeekLow": "55.13", "50DayMovingAverage": "68.0428", "200DayMovingAverage": "67.3809", "SharesOutstanding": "67159504", "SharesFloat": "27811815", "SharesShort": "1851930", "SharesShortPriorMonth": "2243631", "ShortRatio": "15.12", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0", "PercentInsiders": "57.209", "PercentInstitutions": "53.097", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2014-08-08"}