{"Symbol": "JOUT", "AssetType": "Common Stock", "Name": "Johnson Outdoors Inc", "Description": "Johnson Outdoors Inc. designs, manufactures, and markets camping, diving, watercraft, and marine electronics products worldwide. The company's Fishing segment offers electric motors for trolling or primary propulsion, marine battery chargers, and shallow water anchors; sonar and GPS equipment for fish finding, navigation, and marine cartography; and downriggers for controlled-depth fishing. This segment sells its products under the Minn Kota, Humminbird, and Cannon brands through outdoor specialty and Internet retailers, retail store chains, marine products distributors, original equipment manufacturers, and distributors. Its Camping segment offers consumer, commercial, and military tents and accessories; sleeping bags; camping furniture and stoves; other recreational camping products; and portable outdoor cooking systems, as well as acts as a subcontract manufacturer for other providers of military tents. This segment sells its products under the Eureka! and Jetboil brands through independent sales representatives and Internet retailers. The company's Watercraft Recreation segment provides kayaks, canoes, and paddles through independent specialty and outdoor retailers under the Ocean Kayaks, Old Town, and Carlisle brands. Its Diving segment manufactures and markets underwater diving and snorkeling equipment, including regulators, buoyancy compensators, dive computers and gauges, wetsuits, masks, fins, snorkels, and accessories under the SCUBAPRO brand name. This segment also provides regular maintenance, product repair, diving education, and travel program services; and sells diving gear to dive training centers, resorts, public safety units, and armed forces. It sells its products through specialty dive stores and diving magazines, as well as through Websites. Johnson Outdoors Inc. was founded in 1970 and is headquartered in Racine, Wisconsin.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Leisure", "Address": "555 Main Street, Racine, WI, United States, 53403", "FullTimeEmployees": "1200", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "848736832", "EBITDA": "64403000", "PERatio": "19.4051", "PEGRatio": "1.37", "BookValue": "36.125", "DividendPerShare": "0.68", "DividendYield": "0.0082", "EPS": "4.32", "RevenuePerShareTTM": "53.231", "ProfitMargin": "0.0817", "OperatingMarginTTM": "0.0999", "ReturnOnAssetsTTM": "0.0692", "ReturnOnEquityTTM": "0.1274", "RevenueTTM": "533547008", "GrossProfitTTM": "249756000", "DilutedEPSTTM": "4.32", "QuarterlyEarningsGrowthYOY": "-0.42", "QuarterlyRevenueGrowthYOY": "-0.215", "AnalystTargetPrice": "99", "TrailingPE": "19.4051", "ForwardPE": "12.2399", "PriceToSalesRatioTTM": "1.5785", "PriceToBookRatio": "2.3384", "EVToRevenue": "1.3164", "EVToEBITDA": "9.8917", "Beta": "0.8725", "52WeekHigh": "97", "52WeekLow": "48.76", "50DayMovingAverage": "87.8233", "200DayMovingAverage": "74.1286", "SharesOutstanding": "8873200", "SharesFloat": "7108549", "SharesShort": "137629", "SharesShortPriorMonth": "131510", "ShortRatio": "3.91", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0382", "PercentInsiders": "9.69", "PercentInstitutions": "74.488", "ForwardAnnualDividendRate": "0.68", "ForwardAnnualDividendYield": "0.0082", "PayoutRatio": "0.1505", "DividendDate": "2020-07-23", "ExDividendDate": "2020-07-08", "LastSplitFactor": "None", "LastSplitDate": "None"}