{"Symbol": "JRJC", "AssetType": "Common Stock", "Name": "China Finance Online Co. Limited", "Description": "China Finance Online Co. Limited; together with its subsidiaries, provides web-based financial services in the People's Republic of China (PRC) and Hong Kong. The company operates through three segments: Commodities Brokerage Services; Online Financial Information and Advisory Service, and Other Related Services; and Hong Kong Brokerage Services. It provides online access to securities trading services, wealth management products, and securities investment advisory services to retail investors; and financial database and analytics to institutional investors, including financial, research, academic, and regulatory institutions, as well as financial software products. The company is involved in the operation of Yinglibao, an Internet-based financial platform that integrates cash management solutions and mutual fund distribution into iTougu, which facilitates communication between securities investment advisors and their clients; JRJ mobile app for financial information, securities trading, investment advisory, and wealth management; jrj.com.cn to provide access for wealth management solutions and mutual fund distribution; and jrj.com, a financial information website. In addition, it provides securities and futures contracts brokerage and related services to its customers, who invest in stocks listed on Hong Kong Stock Exchanges; subscription to financial data and information services; and asset management and insurance brokerage services, as well as online P2P lending services. China Finance Online Co. Limited has a strategic partnership agreement with Citic Securities; China Investment Securities; YonYou Network to provide corporate cash management solutions; and Orient Securities to provide a cloud-based investor education platform. The company was incorporated in 1998 and is based in Beijing, the People's Republic of China.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Capital Markets", "Address": "Fuzhuo Plaza A, Beijing, China, 100052", "FullTimeEmployees": "493", "FiscalYearEnd": "December", "LatestQuarter": "2020-03-31", "MarketCapitalization": "19291484", "EBITDA": "None", "PERatio": "None", "PEGRatio": "0", "BookValue": "10.155", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.75", "RevenuePerShareTTM": "15.395", "ProfitMargin": "-0.293", "OperatingMarginTTM": "-0.318", "ReturnOnAssetsTTM": "-0.1284", "ReturnOnEquityTTM": "-0.6122", "RevenueTTM": "35498792", "GrossProfitTTM": "22544655", "DilutedEPSTTM": "-4.6", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.002", "AnalystTargetPrice": "8.3", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.508", "PriceToBookRatio": "0.8082", "EVToRevenue": "0.3503", "EVToEBITDA": "0", "Beta": "1.6874", "52WeekHigh": "16.5", "52WeekLow": "0.4568", "50DayMovingAverage": "10.0047", "200DayMovingAverage": "6.7658", "SharesOutstanding": "2441960", "SharesFloat": "1397327", "SharesShort": "11115", "SharesShortPriorMonth": "7580", "ShortRatio": "0.01", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "10.759", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:10", "LastSplitDate": "2020-01-06"}