{"Symbol": "JUNO", "AssetType": "Common Stock", "Name": "Juno Therapeutics, Inc", "Description": "Juno Therapeutics, Inc., a biopharmaceutical company, engages in developing cell-based cancer immunotherapies. The company develops cell-based cancer immunotherapies based on its chimeric antigen receptor and T cell receptor technologies to genetically engineer T cells to recognize and kill cancer cells. Its CD19 product candidates include JCAR017 that is in Phase I/II trials for adults with relapsed or refractory (r/r) B cell aggressive non-Hodgkin lymphoma (NHL) and pediatric patients with r/r B cell acute lymphoblastic leukemia (ALL); JCAR014, which is in Phase I/II trials to treat various B cell malignancies in patients relapsed or refractory to standard therapies; and JCAR015 that is in Phase II trials for adult patients with r/r ALL. The company's CD22 product candidate comprise JCAR018, which is in Phase I trial for pediatric and young adult patients with CD22-positive r/r ALL or r/r NHL. Its additional product candidates include CD171, a cell-surface adhesion molecule to treat neuroblastoma; Lewis Y for the treatment of lung cancer; JCAR023, which is in Phase I trial for patients with refractory or recurrent pediatric neuroblastoma; MUC-16, a protein for treating ovarian cancers; IL-12, a cytokine to overcome the inhibitory effects; ROR-1, a protein for the treatment of non-small cell lung, triple negative breast, pancreatic, and prostate cancers; WT-1, an intracellular protein that is in Phase I/II clinical trials to treat adult myeloid leukemia and non-small cell lung, breast, pancreatic, ovarian, and colorectal cancers; and IL13ra2 for treating glioblastoma. Juno Therapeutics, Inc. has collaboration agreements with Celgene Corporation, Fate Therapeutics, Inc., Editas Medicine, Inc., MedImmune Limited, and Memorial Sloan Kettering Cancer Center. The company was formerly known as FC Therapeutics, Inc. and changed its name to Juno Therapeutics, Inc. in October 2013. Juno Therapeutics, Inc. was founded in 2013 and is headquartered in Seattle, Washington.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "400 Dexter Avenue North, Suite 1200\n98109,Seattle,USA\n", "FullTimeEmployees": "589", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "10096490496", "EBITDA": "-350851008", "PERatio": "None", "PEGRatio": "0", "BookValue": "10.117", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-2.83", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "29.64", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}