{"Symbol": "KELYB", "AssetType": "Common Stock", "Name": "Kelly Services, Inc", "Description": "Kelly Services, Inc., together with its subsidiaries, provides workforce solutions to various industries worldwide. The company operates through three segments: Americas Staffing, Global Talent Solutions, and International Staffing. It provides trained employees for data entry, clerical, and administrative support roles across various industries; schools with instructional and non-instructional employees; support staff for seminars, sales, and trade shows; assemblers, quality control inspectors, and technicians for electronic assembly; maintenance workers, material handlers, and assemblers for light industrial works; scientists, and scientific and clinical research workforce solutions; engineering professionals across various disciplines, including 5G, aeronautical, chemical, civil/structural, electrical/instrumentation, environmental, industrial, mechanical, petroleum, pharmaceutical, quality, and telecommunications. The company also provides temporary staffing and direct-hire placement services across various disciplines, such as corporate finance departments, accounting firms, and financial institutions with various levels of financial professionals, as well as places creative talent in the spectrum of creative services positions. In addition, it provides chefs, porters, and hospitality representatives; and manual workers and semi-skilled professionals in various trade, non-trade, and operational positions. Further, the company provides centrally delivered staffing for large accounts; contingent workforce outsourcing, recruitment process outsourcing, business process outsourcing, and payroll process outsourcing services; contact center staffing solutions; and executive placement, career transition/outplacement, and talent advisory services. Kelly Services, Inc. was founded in 1946 and is headquartered in Troy, Michigan.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Staffing & Employment Services", "Address": "999 West Big Beaver Road, Troy, MI, United States, 48084-4782", "FullTimeEmployees": "7700", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "820903360", "EBITDA": "97200000", "PERatio": "3.9929", "PEGRatio": "3.3905", "BookValue": "29.167", "DividendPerShare": "0.3", "DividendYield": "0.0265", "EPS": "1.801", "RevenuePerShareTTM": "123.518", "ProfitMargin": "-0.0218", "OperatingMarginTTM": "0.0143", "ReturnOnAssetsTTM": "0.0178", "ReturnOnEquityTTM": "-0.0875", "RevenueTTM": "4841900032", "GrossProfitTTM": "968400000", "DilutedEPSTTM": "-2.7", "QuarterlyEarningsGrowthYOY": "-0.51", "QuarterlyRevenueGrowthYOY": "-0.287", "AnalystTargetPrice": "None", "TrailingPE": "3.9929", "ForwardPE": "33.8983", "PriceToSalesRatioTTM": "0.2361", "PriceToBookRatio": "1.0064", "EVToRevenue": "0.1382", "EVToEBITDA": "4.6765", "Beta": "1.0478", "52WeekHigh": "45", "52WeekLow": "10.35", "50DayMovingAverage": "21.3617", "200DayMovingAverage": "16.3584", "SharesOutstanding": "3427540", "SharesFloat": "33552712", "SharesShort": "138", "SharesShortPriorMonth": "94", "ShortRatio": "0.59", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0768", "PercentInsiders": "91.692", "PercentInstitutions": "5.72", "ForwardAnnualDividendRate": "0.3", "ForwardAnnualDividendYield": "0.0265", "PayoutRatio": "0.1056", "DividendDate": "2020-03-09", "ExDividendDate": "2020-02-21", "LastSplitFactor": "5:4", "LastSplitDate": "1993-06-14"}