{"Symbol": "KLXI", "AssetType": "Common Stock", "Name": "KLX Inc", "Description": "KLX Inc., together with its subsidiaries, provides aerospace fasteners, consumables, and logistics services worldwide. The Aerospace Solutions Group segment distributes bolts, clips, hinges, rings, screws, carbon-faced seals, gaskets, O-rings, and others; chemicals, sealants and adhesives, lubricants, paints, cleaners, and degreasers; Honeywell proprietary parts; bearings, tooling, electrical components, and clamps; and hydraulics, pneumatics, fluid connectors, filtration, electrical control systems seals, and compressors and engineered systems. This segment also provides inventory management services and technical support services, as well as operates an e-commerce site that provides customized solutions for customers. It serves commercial airlines; business jet and defense original equipment manufacturers and their subcontractors; airlines; maintenance, repair, and overhaul operators; fixed base operators; and military depots. The Energy Services Group segment offers fishing (retrieval) services and equipment; wireline services, including composite frac plug pump downs, pipe recovery and perforation, and evaluation and logging services; pressure control services and rental equipment; and onshore completion services, such as placement and removal of flow control nipples and valves, completion packers, bridge plugs, and composite flow through frac plugs, as well as downhole services tools. This segment also provides down-hole completion and production services; and mobile, customizable workforce accommodations and offices, and associated rental equipment to its customers at their remote field locations. In addition, it offers machine shop services, which consist of CNC lathes, milling machines, spindle lathes, and other machining equipment to rework and rectify damaged equipment, as well as to design/build specialized fit-for-purpose tools. It primarily serves regional or independent oil companies. KLX Inc. is headquartered in Wellington, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "1300 Corporate Center Way\n33414,Wellington,USA\n", "FullTimeEmployees": "3000", "FiscalYearEnd": "January", "LatestQuarter": "None", "MarketCapitalization": "3196528384", "EBITDA": "311700000", "PERatio": "39.9429", "PEGRatio": "0.65", "BookValue": "45.661", "DividendPerShare": "None", "DividendYield": "None", "EPS": "1.23", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "55.6", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}