{"Symbol": "KMDA", "AssetType": "Common Stock", "Name": "Kamada Ltd", "Description": "Kamada Ltd. develops, produces, and markets plasma-derived protein therapeutics for orphan indications. It operates in two segments, Proprietary Products and Distribution. The company offers respiratory products, including Glassia for use in chronic augmentation and maintenance therapy in adults with emphysema due to congenital Alpha-1 Antitrypsin (AAT) deficiency. It also provides KamRAB for prophylaxis of rabies disease; KamRho (D) IM to treat prophylaxis of hemolytic disease of newborns; KamRho (D) IV for immune thermobocytopunic purpura; and snake bite antiserum to treat snake bites by the vipera palaestinae and echis coloratus, as well as human transferrin that is used as a cultural medium for diagnostic assays and cell cultures. In addition, the company distributes Bramitob to manage chronic pulmonary infection; FOSTER to treat asthma; PROVOCHOLINE for the diagnosis of bronchial airway hyperactivity; IVIG 5% for the treatment of various immunodeficiency-related conditions; Varitect, a varicella zoster immunoglobulin; Zutectra and Hepatect CP for the prevention of hepatitis B virus; Megalotect, a CMV immunoglobulin; and RUCONEST for the treatment of acute angioedema attacks in adults with hereditary angioedema. Further, it distributes Heparin sodium injection to treat thrombo-embolic disorders; Albumin and Albumin 4% for maintenance of blood plasma; and coagulation factors comprising Factor VIII and Factor IX, as well as IXIARO vaccine. The company's products in pipeline are G1-AAT (IV) for graft versus host disease and L1-AAT (1V) for lung transparent that are in Phase II stage; and Inhaled AAT for AAT deficiency, which is in Phase II and III stages. It markets its products through strategic partners in the United States, as well as through distributors internationally. Kamada Ltd. has strategic partnerships with Takeda Pharmaceutical Company Limited; PARI GmbH; and Kedrion Biopharma. The company was founded in 1990 and is headquartered in Rehovot, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersSpecialty & Generic", "Address": "2 Holzman Street, Rehovot, Israel, 7670402", "FullTimeEmployees": "429", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "476418592", "EBITDA": "23699000", "PERatio": "21", "PEGRatio": "8.75", "BookValue": "3.927", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.477", "RevenuePerShareTTM": "3.168", "ProfitMargin": "0.151", "OperatingMarginTTM": "0.1521", "ReturnOnAssetsTTM": "0.069", "ReturnOnEquityTTM": "0.1352", "RevenueTTM": "131516000", "GrossProfitTTM": "49737000", "DilutedEPSTTM": "0.477", "QuarterlyEarningsGrowthYOY": "-0.467", "QuarterlyRevenueGrowthYOY": "-0.061", "AnalystTargetPrice": "11", "TrailingPE": "21", "ForwardPE": "26.5252", "PriceToSalesRatioTTM": "3.2021", "PriceToBookRatio": "2.6437", "EVToRevenue": "2.8165", "EVToEBITDA": "14.2718", "Beta": "0.5295", "52WeekHigh": "13.33", "52WeekLow": "4.4", "50DayMovingAverage": "9.3475", "200DayMovingAverage": "7.5566", "SharesOutstanding": "44524000", "SharesFloat": "27197170", "SharesShort": "133576", "SharesShortPriorMonth": "89827", "ShortRatio": "0.63", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0093", "PercentInsiders": "19.821", "PercentInstitutions": "38.755", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}