{"Symbol": "KPTI", "AssetType": "Common Stock", "Name": "Karyopharm Therapeutics Inc", "Description": "Karyopharm Therapeutics Inc., a pharmaceutical company, engages in the discovery, development, and commercialization of various drugs directed against nuclear export and related targets for the treatment of cancer and other diseases. The company is developing small molecule selective inhibitor of nuclear export (SINE) compounds that inhibit the nuclear export protein exportin 1. Its lead compound is XPOVIO (selinexor) tablets for the treatment of patients with heavily pretreated multiple myeloma. The company develops BOSTON, which is in Phase 3 clinical trial for the treatment of patients with multiple myeloma; STORM, which is in Phase 2b single-arm clinical trial for evaluating oral selinexor in combination with standard, low-dose dexamethasone in heavily pretreated patients, relapsed or refractory myeloma; STOMP, which is in Phase 1b/2 multi-arm clinical trial for the treatment of ow-dose dexamethasone plus standard therapies, including Velcade, Kyprolis, Revlimid, and Pomalyst or Darzalex; and SADAL, which is in Phase 2b clinical trial for the treatment of patients with relapsed or refractory diffuse large B-cell lymphoma. It also develops SEAL, which is in Phase 3 clinical trial for the treartment of liposarcoma; SIENDO, which is in Phase 2/3 clinical trial for treatment of endometrial cancer; and KING, which is in Phase 2 for the treatment of glioblastoma multiforme brain tumor. In addition, the company has various investigational programs in clinical or preclinical development, such as Eltanexor (KPT-8602), KPT-9274, and Verdinexor (KPT-335). The company has collaboration with PROMETRIKA, LLC to conduct the first randomized clinical trial for low-dose selinexor (XPOVIO), an XPO1 inhibitor for hospitalized patients with COVID-19; and a cooperative research and development agreement with the National Cancer Institute for cancer therapy evaluation program. Karyopharm Therapeutics Inc. was founded in 2008 and is headquartered in Newton, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "85 Wells Avenue, Newton, MA, United States, 02459", "FullTimeEmployees": "347", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1086742528", "EBITDA": "-212348000", "PERatio": "None", "PEGRatio": "-0.15", "BookValue": "1.769", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-3.55", "RevenuePerShareTTM": "1.242", "ProfitMargin": "-2.2844", "OperatingMarginTTM": "-2.0549", "ReturnOnAssetsTTM": "-0.3445", "ReturnOnEquityTTM": "-1.7843", "RevenueTTM": "82897000", "GrossProfitTTM": "-83854000", "DilutedEPSTTM": "-2.837", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "2.53", "AnalystTargetPrice": "31.44", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "11.3851", "PriceToBookRatio": "8.0045", "EVToRevenue": "10.4961", "EVToEBITDA": "0", "Beta": "1.4242", "52WeekHigh": "29.61", "52WeekLow": "8.02", "50DayMovingAverage": "16.4342", "200DayMovingAverage": "18.6836", "SharesOutstanding": "73478200", "SharesFloat": "48647714", "SharesShort": "15578637", "SharesShortPriorMonth": "14482523", "ShortRatio": "9.06", "ShortPercentOutstanding": "0.21", "ShortPercentFloat": "0.2218", "PercentInsiders": "12.782", "PercentInstitutions": "91.034", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}