{"Symbol": "KVHI", "AssetType": "Common Stock", "Name": "KVH Industries, Inc", "Description": "KVH Industries, Inc. designs, develops, manufactures, and markets mobile connectivity products and services for the marine and land mobile markets in the United States and internationally. The company operates through Mobile Connectivity and Inertial Navigation segments. The company offers mobile satellite TV and communications products; two-way satellite communications systems; onboard TracPhone terminals and hub equipment; data management software for maritime communications; and Iridium OpenPort hardware products and services. It also offers airtime plans that enable customers to obtain Internet and voice services; and value-added, and news and radio content services to retail customers. In addition, the company provides navigation, guidance, and stabilization products for the commercial and defense markets comprising precision fiber optic gyro-based systems that enable platform and optical stabilization, navigation, pointing, and guidance; tactical navigation systems for tactical trucks and light armored vehicles; and commercial products, such as navigation and positioning systems for various applications consisting of precision mapping, dynamic surveying, autonomous vehicles, train location control and track geometry measurement systems, industrial robotics, and optical stabilization applications. Further, it offers content, maritime news, sporting content, and television programming delivery services; movie distribution services; and services and support for the mini-VSAT Broadband solution, as well as IoT connectivity service. The company sells its mobile communications products through a network of independent retailers, chain stores, distributors, and service providers; and navigation products directly to the United States and foreign governments, and government contractors, as well as through authorized independent sales representatives. The company also sells and leases its products directly to end users. KVH Industries, Inc. was founded in 1978 and is headquartered in Middletown, Rhode Island.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "50 Enterprise Center, Middletown, RI, United States, 02842", "FullTimeEmployees": "581", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "170516144", "EBITDA": "-752000", "PERatio": "4.5794", "PEGRatio": "3.35", "BookValue": "7.716", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.901", "RevenuePerShareTTM": "8.842", "ProfitMargin": "-0.1133", "OperatingMarginTTM": "-0.1241", "ReturnOnAssetsTTM": "-0.0586", "ReturnOnEquityTTM": "-0.1091", "RevenueTTM": "155280992", "GrossProfitTTM": "53750000", "DilutedEPSTTM": "-1.013", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.071", "AnalystTargetPrice": "11", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.0337", "PriceToBookRatio": "1.2228", "EVToRevenue": "0.8828", "EVToEBITDA": "0", "Beta": "0.6769", "52WeekHigh": "11.64", "52WeekLow": "6.36", "50DayMovingAverage": "8.2625", "200DayMovingAverage": "8.8639", "SharesOutstanding": "18595000", "SharesFloat": "12798625", "SharesShort": "152488", "SharesShortPriorMonth": "105410", "ShortRatio": "3.04", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0091", "PercentInsiders": "9.789", "PercentInstitutions": "67.863", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}