{"Symbol": "LBAI", "AssetType": "Common Stock", "Name": "Lakeland Bancorp, Inc", "Description": "Lakeland Bancorp, Inc. operates as the bank holding company for Lakeland Bank that provides various banking products and services for individuals and small to medium sized businesses. It offers commercial banking services, including savings, money market, and time accounts, as well as demand deposits; lending solutions, such as short and medium term loans, lines of credit, letters of credit, inventory and accounts receivable financing, real estate construction loans, mortgage loans, small business administration loans, commercial real estate loans, commercial and industrial loans, and equipment financing, as well as merchant credit card services; and Internet banking, mobile banking, wire transfer, night depository, and cash management services. The company also provides consumer banking services comprising checking accounts, savings accounts, money market accounts, certificates of deposit, secured and unsecured loans, consumer installment loans, mortgage loans, and safe deposit services, as well as Internet banking services. In addition, it offers investment advisory services; and non-deposit products, which include securities brokerage services, including mutual funds and variable annuities, as well as commercial title insurance services and life insurance products. The company operates 52 branch offices throughout Bergen, Essex, Morris, Ocean, Passaic, Somerset, Sussex, and Union counties in New Jersey and Highland Mills, New York; 6 New Jersey regional commercial lending centers in Bernardsville, Iselin, Jackson, Montville, Teaneck, and Waldwick; and 1 commercial lending center in New York to serve the Hudson Valley region. Lakeland Bancorp, Inc. was founded in 1989 and is headquartered in Oak Ridge, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "250 Oak Ridge Road, Oak Ridge, NJ, United States, 07438", "FullTimeEmployees": "692", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "547573504", "EBITDA": "None", "PERatio": "8.875", "PEGRatio": "2.07", "BookValue": "14.773", "DividendPerShare": "0.5", "DividendYield": "0.046", "EPS": "1.2", "RevenuePerShareTTM": "4.084", "ProfitMargin": "0.2995", "OperatingMarginTTM": "0.4036", "ReturnOnAssetsTTM": "0.0089", "ReturnOnEquityTTM": "0.0856", "RevenueTTM": "206483008", "GrossProfitTTM": "220204000", "DilutedEPSTTM": "1.2", "QuarterlyEarningsGrowthYOY": "-0.324", "QuarterlyRevenueGrowthYOY": "-0.154", "AnalystTargetPrice": "13.5", "TrailingPE": "8.875", "ForwardPE": "9.6805", "PriceToSalesRatioTTM": "2.4051", "PriceToBookRatio": "0.721", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.9577", "52WeekHigh": "17.63", "52WeekLow": "8.31", "50DayMovingAverage": "10.7006", "200DayMovingAverage": "11.3733", "SharesOutstanding": "50467600", "SharesFloat": "48570052", "SharesShort": "1254367", "SharesShortPriorMonth": "875964", "ShortRatio": "7.6", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0235", "PercentInsiders": "4.532", "PercentInstitutions": "58.411", "ForwardAnnualDividendRate": "0.5", "ForwardAnnualDividendYield": "0.046", "PayoutRatio": "0.4167", "DividendDate": "2020-08-17", "ExDividendDate": "2020-07-31", "LastSplitFactor": "105:100", "LastSplitDate": "2014-05-30"}