{"Symbol": "LBRDK", "AssetType": "Common Stock", "Name": "Liberty Broadband Corporation", "Description": "Liberty Broadband Corporation, a cable operator, provides video, Internet, and voice services to residential, and small and medium business customers in the United States. The company operates through Skyhook and Charter segments. The Skyhook segment offers Precision Location Solution, a location determination service for mobile device makers, wireless carriers, and asset tracking platforms to understand the precise geographic location and movement of mobile devices, as well as for enhancing the location determination capabilities of a hybrid location system. It also provides Geospatial Insights, a location intelligence and data insights service for enterprises, research and consulting firms, financial institutions, and advertisers to understand, measure, and optimize the performance of businesses; benchmark performance against competitors; enhance customer experience; advertise to, and target existing and prospective customers; and measure the efficacy of advertising campaigns in driving real-world actions. The Charter segment offers subscription-based video services comprising video on demand, high definition television, and digital video recorder service; and local and long distance calling, voicemail, call waiting, caller ID, call forwarding, and other voice services, as well as international calling services. It also provides Internet services, including an in-home Wi-Fi product that provides customers with high performance wireless routers; and a security suite that offers protection against computer viruses and spyware. In addition, this segment offers Internet access, data networking, fiber connectivity to cellular towers and office buildings, video entertainment, and business telephone services; advertising services on cable television networks and digital outlets; and regional sports networks and local sports, news, and community channels. The company is based in Englewood, Colorado.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Entertainment", "Address": "12300 Liberty Boulevard, Englewood, CO, United States, 80112", "FullTimeEmployees": "0", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "25683871744", "EBITDA": "-20648000", "PERatio": "141.23", "PEGRatio": "0", "BookValue": "58.928", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1", "RevenuePerShareTTM": "0.087", "ProfitMargin": "11.5825", "OperatingMarginTTM": "-2.0802", "ReturnOnAssetsTTM": "-0.0017", "ReturnOnEquityTTM": "0.0173", "RevenueTTM": "15872000", "GrossProfitTTM": "5409000", "DilutedEPSTTM": "1", "QuarterlyEarningsGrowthYOY": "4.872", "QuarterlyRevenueGrowthYOY": "0.098", "AnalystTargetPrice": "180.5", "TrailingPE": "141.23", "ForwardPE": "46.5116", "PriceToSalesRatioTTM": "1626.7699", "PriceToBookRatio": "2.3967", "EVToRevenue": "1649.8155", "EVToEBITDA": "97.0462", "Beta": "1.0692", "52WeekHigh": "146.02", "52WeekLow": "86.2", "50DayMovingAverage": "137.1114", "200DayMovingAverage": "127.0877", "SharesOutstanding": "152984000", "SharesFloat": "172726276", "SharesShort": "2386436", "SharesShortPriorMonth": "2345201", "ShortRatio": "5.2", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0194", "PercentInsiders": "3.008", "PercentInstitutions": "67.349", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1046:1000", "LastSplitDate": "2014-12-11"}