{"Symbol": "LCNB", "AssetType": "Common Stock", "Name": "LCNB Corp", "Description": "LCNB Corp. operates as the financial holding company for LCNB National Bank that provides commercial and personal banking services in Ohio. The company's deposit products include checking, NOW, savings, Christmas and vacation club, money market deposit, lifetime checking, and individual retirement accounts, as well as certificates of deposit. Its loan portfolio comprises commercial and industrial, commercial and residential real estate, agricultural, construction, small business administration, and residential mortgage loans. The company also offers consumer loans, such as automobile, recreational vehicles, boat, home improvement, and personal loans. In addition, it provides trust administration, estate settlement, and fiduciary services; and investment management services for trusts, agency accounts, individual retirement accounts, and foundations/endowments. Further, the company offers investment services and products, including financial needs analysis, mutual funds, securities trading, annuities, and life insurance; and security brokerage services. Additionally, it provides safe deposit boxes, night depositories, cashier's checks, bank-by-mail, ATMs, cash and transaction services, debit cards, wire transfers, electronic funds transfer, utility bill collections, notary public service, personal computer-based cash management services, telephone banking, PC Internet banking, mobile banking, and other services for individuals and businesses. As of December 31, 2019, the company operated 35 offices, including a main office in Warren County; branch offices in Warren, Butler, Clinton, Clermont, Fayette, Franklin, Hamilton, Montgomery, Preble, and Ross Counties; and an operations center in Warren County, Ohio, as well as 38 ATMs. LCNB Corp. was founded in 1877 and is headquartered in Lebanon, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "2 North Broadway, Lebanon, OH, United States, 45036", "FullTimeEmployees": "332", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "194381968", "EBITDA": "None", "PERatio": "9.7351", "PEGRatio": "11.81", "BookValue": "18.268", "DividendPerShare": "0.72", "DividendYield": "0.049", "EPS": "1.51", "RevenuePerShareTTM": "5.252", "ProfitMargin": "0.2893", "OperatingMarginTTM": "0.3652", "ReturnOnAssetsTTM": "0.0116", "ReturnOnEquityTTM": "0.0854", "RevenueTTM": "67891000", "GrossProfitTTM": "66548000", "DilutedEPSTTM": "1.51", "QuarterlyEarningsGrowthYOY": "0.09", "QuarterlyRevenueGrowthYOY": "0.046", "AnalystTargetPrice": "24", "TrailingPE": "9.7351", "ForwardPE": "11.0742", "PriceToSalesRatioTTM": "2.7642", "PriceToBookRatio": "0.8047", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.7264", "52WeekHigh": "19.5", "52WeekLow": "10.03", "50DayMovingAverage": "14.2794", "200DayMovingAverage": "14.3084", "SharesOutstanding": "12976100", "SharesFloat": "11406877", "SharesShort": "144560", "SharesShortPriorMonth": "89919", "ShortRatio": "7.47", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0095", "PercentInsiders": "6.556", "PercentInstitutions": "37.283", "ForwardAnnualDividendRate": "0.72", "ForwardAnnualDividendYield": "0.049", "PayoutRatio": "0.4702", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-31", "LastSplitFactor": "2:1", "LastSplitDate": "2007-05-11"}