{"Symbol": "LHCG", "AssetType": "Common Stock", "Name": "LHC Group, Inc", "Description": "LHC Group, Inc., a health care provider, specializes in the post-acute continuum of care primarily for Medicare beneficiaries in the United States. The company's Home Health Services segment offers home nursing services, including wound care and dressing changes, cardiac rehabilitation, infusion therapy, pain management, pharmaceutical administration, skilled observation and assessment, and patient education; medically-oriented social services; and physical, occupational, and speech therapy services. Its Hospice Services segment provides pain and symptom management accompanied by palliative medication, emotional and spiritual support, inpatient and respite care, homemaker services, dietary counseling, family bereavement counseling, and social worker visits. The company's Home and Community-Based Services segment offers services, such as assistance with grooming, medication reminders, meal preparation, assistance with feeding, light housekeeping, respite care, transportation, and errand services to patients in their home or in a medical facility. Its Facility-Based Services segment serves patients suffering from respiratory failure, neuromuscular disorders, cardiac disorders, non-healing wounds, renal disorders, cancer, head and neck injuries, and mental disorders, as well as treats patients diagnosed with musculoskeletal impairments; and operates institutional pharmacy, a family health center, a rural health clinic, and a retail pharmacy, as well as offers physical therapy services. The company's Healthcare Innovations (HCI) Services segment provides strategic health management services to Accountable Care Organizations. As of December 31, 2019, it operated 553 home health services locations, 110 hospice locations, 107 community-based service locations, 11 long-term acute care hospitals with 13 locations, and 10 HCI locations. The company was founded in 1994 and is based in Lafayette, Louisiana.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Care Facilities", "Address": "901 Hugh Wallis Road South, Lafayette, LA, United States, 70508", "FullTimeEmployees": "32000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6497472000", "EBITDA": "163620000", "PERatio": "54.0897", "PEGRatio": "3.0472", "BookValue": "47.466", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.79", "RevenuePerShareTTM": "66.424", "ProfitMargin": "0.0576", "OperatingMarginTTM": "0.0696", "ReturnOnAssetsTTM": "0.0409", "ReturnOnEquityTTM": "0.0959", "RevenueTTM": "2060004992", "GrossProfitTTM": "755354000", "DilutedEPSTTM": "3.79", "QuarterlyEarningsGrowthYOY": "0.787", "QuarterlyRevenueGrowthYOY": "-0.059", "AnalystTargetPrice": "225.91", "TrailingPE": "54.0897", "ForwardPE": "45.6621", "PriceToSalesRatioTTM": "3.1114", "PriceToBookRatio": "4.3838", "EVToRevenue": "3.0791", "EVToEBITDA": "30.7943", "Beta": "0.511", "52WeekHigh": "211.85", "52WeekLow": "100", "50DayMovingAverage": "196.0367", "200DayMovingAverage": "157.708", "SharesOutstanding": "31590200", "SharesFloat": "30192027", "SharesShort": "1032984", "SharesShortPriorMonth": "736475", "ShortRatio": "3.75", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.035", "PercentInsiders": "5.313", "PercentInstitutions": "95.151", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}