{"Symbol": "LIVE", "AssetType": "Common Stock", "Name": "Live Ventures Incorporated", "Description": "Live Ventures Incorporated, a holding company, engages in the manufacturing, retail and online, and service businesses in the United States. Its Manufacturing segment manufactures and markets carpets and rugs, and yarn products focusing on the residential, niche commercial, and hospitality end-markets; and resells hard surface flooring products. This segment serves flooring dealers, home centers, and other flooring manufacturers, as well as directly to end users. The company's Retail and Online segment operates 62 specialty entertainment retail storefronts that offer entertainment products, including new and pre-owned movies, video games, and music products, as well as ancillary products, such as books, comics, toys, and collectibles. It buys, sells, and trades in new and pre-owned movies, music, video games, electronics, and collectibles through 35 Vintage Stock, 3 V-Stock, 13 Movie Trading company, and 11 EntertainMart retail locations in Missouri, Texas, Oklahoma, Kansas, Arkansas, Utah, Colorado, Illinois, Idaho, and New Mexico, as well as sells new and used movies, video games, music, and toys through Website, vintagestock.com. This segment also offers services to customers, such as rentals, special orders, disc and video game hardware repair services, and other services. Its Services segment offers InstantProfile line of products and services primarily consisting of directory listing services. The company was formerly known as LiveDeal, Inc. and changed its name to Live Ventures Incorporated in October 2015. Live Ventures Incorporated was founded in 1968 and is based in Las Vegas, Nevada.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Specialty Retail", "Address": "325 East Warm Springs Road, Las Vegas, NV, United States, 89119", "FullTimeEmployees": "650", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14699785", "EBITDA": "13351000", "PERatio": "6.0228", "PEGRatio": "0", "BookValue": "24.538", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.963", "RevenuePerShareTTM": "100.359", "ProfitMargin": "-0.0059", "OperatingMarginTTM": "0.0444", "ReturnOnAssetsTTM": "0.0349", "ReturnOnEquityTTM": "-0.0255", "RevenueTTM": "176980000", "GrossProfitTTM": "70873000", "DilutedEPSTTM": "-0.596", "QuarterlyEarningsGrowthYOY": "1.61", "QuarterlyRevenueGrowthYOY": "-0.097", "AnalystTargetPrice": "49.62", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.0992", "PriceToBookRatio": "0.4033", "EVToRevenue": "0.5524", "EVToEBITDA": "7.66", "Beta": "1.3132", "52WeekHigh": "11.1835", "52WeekLow": "3.49", "50DayMovingAverage": "9.6422", "200DayMovingAverage": "7.7681", "SharesOutstanding": "1603030", "SharesFloat": "1276285", "SharesShort": "15738", "SharesShortPriorMonth": "16379", "ShortRatio": "0.74", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0023", "PercentInsiders": "17.529", "PercentInstitutions": "5.358", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "2005-07-12", "LastSplitFactor": "1:6", "LastSplitDate": "2016-12-08"}