{"Symbol": "LMAT", "AssetType": "Common Stock", "Name": "LeMaitre Vascular, Inc", "Description": "LeMaitre Vascular, Inc. designs, markets, sells, services, and supports medical devices and implants for the treatment of peripheral vascular disease worldwide. The company offers angioscope, a fiber optic catheter used for viewing the lumen of a blood vessel; embolectomy catheters to remove blood clots from arteries or veins; occlusion catheters that temporarily occlude the blood flow; perfusion catheters to temporarily perfuse the blood and other fluids into the vasculature; and thrombectomy catheters, which features a silicone balloon for removing thrombi in the venous system. It also provides carotid shunts that temporarily shunt the blood to the brain during the removal of plaque from the carotid artery in a carotid endarterectomy surgery; powered phlebectomy devices to remove varicose veins; and radiopaque tape, a medical-grade tape applied to the skin that enables interventionists to cross-refer between the inside and the outside of a patient's body, and allows them to locate tributaries or lesions beneath the skin. In addition, the company offers remote endarterectomy devices to remove plaque from arteries in the leg; valvulotomes, which cut valves in the saphenous vein to function as an artery to carry blood past diseased arteries to the lower leg or the foot; and vascular grafts to bypass or replace diseased arteries. Further, it provides vascular patches, which are used for closure of vessels after surgical intervention, as well as endarterectomy and other vascular reconstruction; vessel closure systems to attach vessels to one another with titanium clips instead of sutures; and surgical glue. The company markets its products through a direct sales force and distributors. The company was formerly known as Vascutech, Inc. and changed its name to LeMaitre Vascular, Inc. in April 2001. LeMaitre Vascular, Inc. was founded in 1983 and is headquartered in Burlington, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "63 Second Avenue, Burlington, MA, United States, 01803", "FullTimeEmployees": "454", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "641000000", "EBITDA": "26021000", "PERatio": "38.8395", "PEGRatio": "5.72", "BookValue": "7.563", "DividendPerShare": "0.38", "DividendYield": "0.0121", "EPS": "0.81", "RevenuePerShareTTM": "5.714", "ProfitMargin": "0.1436", "OperatingMarginTTM": "0.1749", "ReturnOnAssetsTTM": "0.0599", "ReturnOnEquityTTM": "0.1135", "RevenueTTM": "114672000", "GrossProfitTTM": "79853000", "DilutedEPSTTM": "0.81", "QuarterlyEarningsGrowthYOY": "-0.261", "QuarterlyRevenueGrowthYOY": "-0.157", "AnalystTargetPrice": "34.5", "TrailingPE": "38.8395", "ForwardPE": "57.1429", "PriceToSalesRatioTTM": "5.6023", "PriceToBookRatio": "4.1692", "EVToRevenue": "6.0398", "EVToEBITDA": "26.4816", "Beta": "1.3676", "52WeekHigh": "38.64", "52WeekLow": "21.22", "50DayMovingAverage": "29.2228", "200DayMovingAverage": "27.1156", "SharesOutstanding": "20227200", "SharesFloat": "16944711", "SharesShort": "1943935", "SharesShortPriorMonth": "1557404", "ShortRatio": "14.96", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1365", "PercentInsiders": "17.291", "PercentInstitutions": "89.017", "ForwardAnnualDividendRate": "0.38", "ForwardAnnualDividendYield": "0.0121", "PayoutRatio": "0.4444", "DividendDate": "2020-09-10", "ExDividendDate": "2020-08-26", "LastSplitFactor": "None", "LastSplitDate": "None"}