{"Symbol": "LOGM", "AssetType": "Common Stock", "Name": "LogMeIn, Inc", "Description": "LogMeIn, Inc. provides a portfolio of cloud-based communication and collaboration, identity and access, and customer engagement and support solutions. It enables people to connect with each other worldwide to drive meaningful interactions, deepen relationships, and create better outcomes for individuals and businesses. The company offers GoToConnect, a video and audio conferencing solution; GoToMeeting, an online meeting and collaboration solution; GoToRoom for configuration of video and audio conferencing solution in their physical conference or huddle rooms; GoToTraining, an online training product for interactive training sessions; GoToWebinar, a do-it-yourself Webinar product for organizations; Grasshopper telephony solution; Jive, a cloud-based phone service; join.me, an online meeting and screen sharing services; and OpenVoice, a reservation-less audio conferencing service. It also provides Bold360, an omni-channel engagement platform solution; Bold360 service, an automated digital engagement solution; RescueAssist, GoToAssist Corporate, and GoToAssist Seeit, which are easy-to-use cloud-based remote support solutions; LogMeIn Rescue, a remote support and customer care service; and LogMeIn Rescue+Mobile and Rescue Lens that are Web-based remote support services. In addition, the company offers LogMeIn Central, a Web-based management console; GoToMyPC that enables mobile workstyles; LogMeIn Pro, a remote access service; and LastPass, a password management and single sign on solution. It serves enterprise customers, small and medium businesses, IT service providers, mobile carriers, customer service centers, OEMs, and consumers. The company was formerly known as 3am Labs, Inc. and changed its name to LogMeIn, Inc. in March 2006. LogMeIn, Inc. was founded in 2003 and is headquartered in Boston, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "320 Summer Street, Boston, MA, United States, 02210", "FullTimeEmployees": "3875", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4218386432", "EBITDA": "344491008", "PERatio": "477.8889", "PEGRatio": "3.5056", "BookValue": "56.522", "DividendPerShare": "1.3", "DividendYield": "0.0151", "EPS": "0.179", "RevenuePerShareTTM": "26.869", "ProfitMargin": "0.0067", "OperatingMarginTTM": "0.0673", "ReturnOnAssetsTTM": "0.0141", "ReturnOnEquityTTM": "0.0031", "RevenueTTM": "1312731008", "GrossProfitTTM": "937220000", "DilutedEPSTTM": "0.179", "QuarterlyEarningsGrowthYOY": "-0.583", "QuarterlyRevenueGrowthYOY": "0.12", "AnalystTargetPrice": "82.82", "TrailingPE": "477.8889", "ForwardPE": "17.5131", "PriceToSalesRatioTTM": "3.2161", "PriceToBookRatio": "1.5219", "EVToRevenue": "3.2543", "EVToEBITDA": "13.3861", "Beta": "0.7467", "52WeekHigh": "86.63", "52WeekLow": "65.04", "50DayMovingAverage": "85.8131", "200DayMovingAverage": "84.6634", "SharesOutstanding": "49028200", "SharesFloat": "47994166", "SharesShort": "4188076", "SharesShortPriorMonth": "4283055", "ShortRatio": "10.89", "ShortPercentOutstanding": "0.08", "ShortPercentFloat": "0.083", "PercentInsiders": "2.016", "PercentInstitutions": "96.264", "ForwardAnnualDividendRate": "1.3", "ForwardAnnualDividendYield": "0.0151", "PayoutRatio": "3.6111", "DividendDate": "2019-11-29", "ExDividendDate": "2019-11-12", "LastSplitFactor": "1:2", "LastSplitDate": "2009-06-25"}