{"Symbol": "LQDT", "AssetType": "Common Stock", "Name": "Liquidity Services, Inc", "Description": "Liquidity Services, Inc. provides e-commerce marketplace that enable buyers and sellers to transact in an automated environment offering approximately 500 product categories. The company's marketplaces include liquidation.com that enable corporations to sell surplus and salvage consumer goods and capital assets; govdeals.com and auctionDeals.com provides self-directed service solutions in which sellers list their own assets that enables local and state government entities, including city, county, state agencies, as well as commercial businesses located in the United States and Canada to sell surplus and salvage assets, as well as offers a suite of services that includes asset sales and marketing. It also operates networkintl.com, which enables corporations to sell idle, surplus, and scrap equipment in the oil and gas, petrochemical, and power generation industries; go-dove.com marketplace for corporations located in the United States, Europe, and Asia to sell manufacturing surplus and salvage capital assets, and scrap material; secondipity.com that provides consumers a source of products through donating a portion of the proceeds of sale to charity; and machinio.com, a search engine for used machinery and equipment. The company's marketplaces provide professional buyers access to supply of new, surplus, and scrap assets presented with digital images and other relevant product information; and enable corporate and government sellers to enhance their financial return on assets offered for sale by providing a liquid marketplace and value-added services. It offers approximately 500 product categories in industry verticals, such as consumer electronics, general merchandise, apparel, scientific equipment, aerospace parts and equipment, technology hardware, energy equipment, industrial capital assets, fleet and transportation equipment, and specialty equipment. The company was founded in 1999 and is headquartered in Bethesda, Maryland.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Internet Retail", "Address": "6931 Arlington Road, Bethesda, MD, United States, 20814", "FullTimeEmployees": "687", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "264870880", "EBITDA": "-13086000", "PERatio": "None", "PEGRatio": "0.39", "BookValue": "3.24", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.459", "RevenuePerShareTTM": "6.227", "ProfitMargin": "-0.0692", "OperatingMarginTTM": "-0.0581", "ReturnOnAssetsTTM": "-0.039", "ReturnOnEquityTTM": "-0.1249", "RevenueTTM": "208840000", "GrossProfitTTM": "113280000", "DilutedEPSTTM": "-0.431", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.161", "AnalystTargetPrice": "8.5", "TrailingPE": "0", "ForwardPE": "400", "PriceToSalesRatioTTM": "1.2655", "PriceToBookRatio": "2.4336", "EVToRevenue": "0.9844", "EVToEBITDA": "0", "Beta": "1.0681", "52WeekHigh": "8.76", "52WeekLow": "3.01", "50DayMovingAverage": "6.3389", "200DayMovingAverage": "5.2795", "SharesOutstanding": "34045100", "SharesFloat": "23187092", "SharesShort": "781403", "SharesShortPriorMonth": "541672", "ShortRatio": "2.49", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0339", "PercentInsiders": "19.879", "PercentInstitutions": "71.837", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}