{"Symbol": "LUNA", "AssetType": "Common Stock", "Name": "Luna Innovations Incorporated", "Description": "Luna Innovations Incorporated develops, manufactures, and markets fiber optic sensing, and test and measurement products worldwide. It operates in two segments, Products and Licensing, and Technology Development. The Products and Licensing segment offers test and measurement products, which include optical vector analyzer, optical backscatter reflectometers, and the Phoenix family of tunable lasers; optical distributed sensor interrogator sensing solutions for distributed strain and temperature measurements; and Hyperion sensing solution that enable full-spectrum data acquisition and flexible peak detect algorithms of fiber-bragg grating (FBG), long period FBGs and fabry-perot sensors with low-latency access to data for closed loop feedback applications. This segment also provides general photonics comprising components, modules, and instruments to measure, manage, and control polarization and group delay in fiber optic networks; tunable lasers; and TeraMetrix products to measure and verify physical properties online and in real-time to reduce raw materials and rework costs in manufacturing processes as well as to conduct quality control monitoring utilizing terahertz measurement technologies. The Technology Development segment provides applied research for customers principally in the areas of sensing and instrumentation, advanced materials, and health sciences. The company sells its products to telecommunications companies, defense agencies, government system integrators, researchers, original equipment manufacturers, distributors, testing labs, and strategic partners directly, as well as through manufacturer representative organizations, partner and distribution channels, technical sales engineers, value added resellers, and independent sales representatives. Luna Innovations Incorporated was founded in 1990 and is headquartered in Roanoke, Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "301 1st Street, SW, Roanoke, VA, United States, 24011", "FullTimeEmployees": "289", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "192490624", "EBITDA": "9117312", "PERatio": "38.25", "PEGRatio": "0", "BookValue": "2.266", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.104", "RevenuePerShareTTM": "2.464", "ProfitMargin": "0.0493", "OperatingMarginTTM": "0.0872", "ReturnOnAssetsTTM": "0.0463", "ReturnOnEquityTTM": "0.075", "RevenueTTM": "73585712", "GrossProfitTTM": "35182382", "DilutedEPSTTM": "0.104", "QuarterlyEarningsGrowthYOY": "1", "QuarterlyRevenueGrowthYOY": "0.043", "AnalystTargetPrice": "9", "TrailingPE": "38.25", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.6026", "PriceToBookRatio": "2.7003", "EVToRevenue": "2.2134", "EVToEBITDA": "19.6104", "Beta": "0.9846", "52WeekHigh": "9.32", "52WeekLow": "4.5", "50DayMovingAverage": "5.8419", "200DayMovingAverage": "6.3842", "SharesOutstanding": "30798500", "SharesFloat": "27841260", "SharesShort": "1221006", "SharesShortPriorMonth": "534597", "ShortRatio": "4.32", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0319", "PercentInsiders": "6.361", "PercentInstitutions": "41.192", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}