{"Symbol": "MAGS", "AssetType": "Common Stock", "Name": "Magal Security Systems Ltd", "Description": "Magal Security Systems Ltd. develops, manufactures, markets, and sells perimeter intrusion detection sensors, physical barriers, video analytics and management systems, cyber security products and systems, and security video observation and surveillance systems. It operates through three segments: Perimeter Products, Turnkey Projects, and Video and Cyber Security. The company offers perimeter security products that enable customers to monitor, limit, and control access by unauthorized personnel to specific regions or areas. Its perimeter security systems include fence mounted detection systems; detection grids, gates, and fences to protect water passages, VIP residences, and other outdoor applications; buried sensors; hybrid perimeter intrusion detection and intelligent lighting systems; electrical field disturbance sensors; and microwave sensors. The company also provides integrated intelligent video management solutions for security surveillance and business intelligence applications; and cyber-security products for monitoring, securing, and the active management of wired, wireless, and fiber optic communication networks, as well as turnkey solutions. In addition, it offers RoboGuard, a platform that runs on a rail along the perimeter of protected sites; and life safety/duress alarm to protect personnel in prisons. Further, the company provides closed circuit television and intelligent video analytics solutions; Fortis4G, a fourth generation command and control system; StarNet 2, a security management system; and Network Manager, a middleware package. Its products are used to protect borders, military bases, power plants, air and sea ports, postal facilities, prisons, banks, retail operations, hospitals, municipal security, sporting events, and industrial locations from terrorism, theft, and security threats. The company sells its products through system integrators and distribution channels. The company was founded in 1965 and is headquartered in Yehud, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Security & Protection Services", "Address": "17 Altalef Street, Yehud, Israel, 5621617", "FullTimeEmployees": "421", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "77102816", "EBITDA": "8433500", "PERatio": "25.5385", "PEGRatio": "0", "BookValue": "3.724", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.13", "RevenuePerShareTTM": "3.444", "ProfitMargin": "0.0461", "OperatingMarginTTM": "0.0803", "ReturnOnAssetsTTM": "0.0331", "ReturnOnEquityTTM": "0.0509", "RevenueTTM": "79754000", "GrossProfitTTM": "38761000", "DilutedEPSTTM": "0.13", "QuarterlyEarningsGrowthYOY": "-0.066", "QuarterlyRevenueGrowthYOY": "-0.169", "AnalystTargetPrice": "None", "TrailingPE": "25.5385", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.9645", "PriceToBookRatio": "0.8914", "EVToRevenue": "0.2961", "EVToEBITDA": "4.6317", "Beta": "1.1022", "52WeekHigh": "4.4", "52WeekLow": "2.46", "50DayMovingAverage": "3.2189", "200DayMovingAverage": "3.1271", "SharesOutstanding": "23154000", "SharesFloat": "13285988", "SharesShort": "9811", "SharesShortPriorMonth": "2265", "ShortRatio": "0.09", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0005", "PercentInsiders": "0.06", "PercentInstitutions": "62.22", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "2004-01-08", "LastSplitFactor": "1:1", "LastSplitDate": "2004-08-01"}