{"Symbol": "MANT", "AssetType": "Common Stock", "Name": "ManTech International Corporation", "Description": "ManTech International Corporation provides technology solutions and services for U.S. defense, intelligence community, and federal civilian agencies worldwide. The company offers cyber solutions and services, including security operations, threat intelligence, incident response and forensics, boundary defense, security systems engineering, infrastructure security, and computer forensics and exploitation. It also provides solutions involving hardware and software to support the technology infrastructure for various applications, including IT service management, help desk, data center consolidation, enterprise architecture, mobile computing and device management, network operations and infrastructure, virtualization/cloud computing and migration, network and database administration, enterprise systems development and management, infrastructure as a managed service, and data collection and analytics; and designs, develops, integrates, operates, and sustains software applications and systems. In addition, the company offers professional and technical solutions, and mission support services; command-and-control infrastructure, intelligence, surveillance and reconnaissance platforms and sensors, and data services; and vulnerability assessment, insider threat protection, exposure analysis, secrecy architecture design, security policy development and implementation, lifecycle acquisition program security, anti-tamper, export compliance support, foreign disclosure, system security engineering, security awareness and training, security support services, and technical certification and accreditation services. Further, it provides requirement analysis, development, and management; systems development and integration; enterprise architecture and concept of operations; systems engineering and technical assistance; test and evaluation; training; and supply chain management and logistics services. The company was founded in 1968 and is headquartered in Herndon, Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "2251 Corporate Park Drive, Herndon, VA, United States, 20171", "FullTimeEmployees": "8900", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3030599168", "EBITDA": "219583008", "PERatio": "23.965", "PEGRatio": "10.12", "BookValue": "38.012", "DividendPerShare": "1.28", "DividendYield": "0.017", "EPS": "3.141", "RevenuePerShareTTM": "60.454", "ProfitMargin": "0.0524", "OperatingMarginTTM": "0.0644", "ReturnOnAssetsTTM": "0.0463", "ReturnOnEquityTTM": "0.0858", "RevenueTTM": "2426995968", "GrossProfitTTM": "329098000", "DilutedEPSTTM": "3.141", "QuarterlyEarningsGrowthYOY": "0.222", "QuarterlyRevenueGrowthYOY": "0.178", "AnalystTargetPrice": "82.43", "TrailingPE": "23.965", "ForwardPE": "27.248", "PriceToSalesRatioTTM": "1.2553", "PriceToBookRatio": "1.9797", "EVToRevenue": "1.2953", "EVToEBITDA": "14.3795", "Beta": "0.7148", "52WeekHigh": "88.55", "52WeekLow": "55.2475", "50DayMovingAverage": "70.3658", "200DayMovingAverage": "72.8814", "SharesOutstanding": "27145600", "SharesFloat": "26947114", "SharesShort": "618082", "SharesShortPriorMonth": "681121", "ShortRatio": "3.51", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0366", "PercentInsiders": "0.664", "PercentInstitutions": "101.548", "ForwardAnnualDividendRate": "1.28", "ForwardAnnualDividendYield": "0.017", "PayoutRatio": "0.3758", "DividendDate": "2020-09-25", "ExDividendDate": "2020-09-10", "LastSplitFactor": "None", "LastSplitDate": "None"}