{"Symbol": "MASI", "AssetType": "Common Stock", "Name": "Masimo Corporation", "Description": "Masimo Corporation, a medical technology company, develops, manufactures, and markets noninvasive monitoring technologies and hospital automation solutions worldwide. The company offers Masimo Signal Extraction Technology (SET) pulse oximetry with measure-through motion and low perfusion pulse oximetry monitoring to address the primary limitations of conventional pulse oximetry. It also provides Masimo rainbow SET platform that includes rainbow SET Pulse CO-Oximetry products that noninvasively monitor hemoglobin species, including oxygen saturation, pulse rate, perfusion index, pleth variability index, and respiration rate from the pleth; noninvasively monitor hemoglobin concentration, and carboxyhemoglobin and methemoglobin; monitor arterial oxygen saturation and acoustic respiration rate; and calculates oxygen content and oxygen reserve index. In addition, the company offers SedLine brain function monitoring technology to measure the brain's electrical activity by detecting EEG signals; capnography and gas monitoring products comprising external plug-in-and-measure capnography and gas analyzers, integrated modules, handheld capnograph and capnometer devices, and capnography sampling lines; and O3 regional oximetry for tissue oxygen saturation measurement. Further, it provides Patient SafetyNet, a surveillance, remote monitoring, and clinician notification solution; MyView, a wireless presence-detection system; and connectivity devices. Additionally, the company offers Trace, a patient data visualization and reporting software for Masimo Root and Radical-7 monitors. The company provides its products directly, as well as through distributors and original equipment manufacturers partners to hospitals, emergency medical service providers, physician offices, home care providers, long term care facilities, veterinarians, and consumers. Masimo Corporation was founded in 1989 and is headquartered in Irvine, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "52 Discovery, Irvine, CA, United States, 92618", "FullTimeEmployees": "1600", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "12076493824", "EBITDA": "269377984", "PERatio": "56.8191", "PEGRatio": "3.624", "BookValue": "24.469", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.871", "RevenuePerShareTTM": "19.409", "ProfitMargin": "0.2122", "OperatingMarginTTM": "0.233", "ReturnOnAssetsTTM": "0.1064", "ReturnOnEquityTTM": "0.1864", "RevenueTTM": "1047099008", "GrossProfitTTM": "629172000", "DilutedEPSTTM": "3.871", "QuarterlyEarningsGrowthYOY": "0.215", "QuarterlyRevenueGrowthYOY": "0.31", "AnalystTargetPrice": "251.8", "TrailingPE": "56.8191", "ForwardPE": "60.6061", "PriceToSalesRatioTTM": "12.0931", "PriceToBookRatio": "8.9863", "EVToRevenue": "10.8879", "EVToEBITDA": "40.6481", "Beta": "0.8676", "52WeekHigh": "258", "52WeekLow": "140.1601", "50DayMovingAverage": "223.6081", "200DayMovingAverage": "209.7666", "SharesOutstanding": "54948100", "SharesFloat": "50762156", "SharesShort": "1353416", "SharesShortPriorMonth": "1696398", "ShortRatio": "2.6", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0284", "PercentInsiders": "7.805", "PercentInstitutions": "85.838", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2012-12-11", "ExDividendDate": "2012-11-23", "LastSplitFactor": "None", "LastSplitDate": "None"}