{"Symbol": "MATW", "AssetType": "Common Stock", "Name": "Matthews International Corporation", "Description": "Matthews International Corporation provides brand solutions, memorialization products, and industrial products worldwide. The company's SGK Brand Solutions segment provides brand development and graphic design services, such as visual intellectual properties, packaging, and content creation; brand deployment and activation services, including design and production of merchandising exhibits and shopper experiences in digital and printed media channels; and consulting services to brand owners on workflow best practices, management and technologies, printing quality, measurement, and consistency. This segment also produces digital packaging artwork files, and pre-media graphics services for print and digital channels, as well as image carriers comprising printing plates and gravure cylinders; and develops digital tools. Its Memorialization segment manufactures and markets a range of memorialization products for use in cemeteries, funeral homes, and crematories. This segment offers cast bronze memorials, flush bronze and granite memorials, upright granite memorials and monuments, cremation memorialization products, granite benches, flower vases, crypt plates and letters, cremation urns, niche units, cemetery features and statues, caskets, community and family mausoleums, bronze plaques, letters, emblems, vases, lights, and photo ceramics, as well as architectural products to identify or commemorate people, places, events, and accomplishments. The company's Industrial Technologies segment designs, manufactures, and distributes marking and coding equipment and consumables, industrial automation products, and order fulfillment systems for identifying, tracking, picking, and conveying consumer and industrial products. This segment serves manufacturers, suppliers, and distributors of durable goods and building products; consumer goods manufacturers; and pharmaceutical producers. Matthews International Corporation was founded in 1850 and is based in Pittsburgh, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Conglomerates", "Address": "Two NorthShore Center, Pittsburgh, PA, United States, 15212", "FullTimeEmployees": "11000", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "696269312", "EBITDA": "141612992", "PERatio": "18.5938", "PEGRatio": "1.9187", "BookValue": "19.226", "DividendPerShare": "0.84", "DividendYield": "0.038", "EPS": "1.984", "RevenuePerShareTTM": "47.871", "ProfitMargin": "-0.1111", "OperatingMarginTTM": "0.041", "ReturnOnAssetsTTM": "0.0173", "ReturnOnEquityTTM": "-0.2297", "RevenueTTM": "1491570944", "GrossProfitTTM": "544866000", "DilutedEPSTTM": "-5.324", "QuarterlyEarningsGrowthYOY": "-0.848", "QuarterlyRevenueGrowthYOY": "-0.052", "AnalystTargetPrice": "45", "TrailingPE": "0", "ForwardPE": "11.5075", "PriceToSalesRatioTTM": "0.4477", "PriceToBookRatio": "1.1146", "EVToRevenue": "1.0476", "EVToEBITDA": "19.4742", "Beta": "1.1747", "52WeekHigh": "40.36", "52WeekLow": "17.03", "50DayMovingAverage": "21.2522", "200DayMovingAverage": "22.6966", "SharesOutstanding": "31264900", "SharesFloat": "30029943", "SharesShort": "1037606", "SharesShortPriorMonth": "1081308", "ShortRatio": "3.58", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0422", "PercentInsiders": "3.299", "PercentInstitutions": "88.208", "ForwardAnnualDividendRate": "0.84", "ForwardAnnualDividendYield": "0.038", "PayoutRatio": "0", "DividendDate": "2020-08-17", "ExDividendDate": "2020-07-31", "LastSplitFactor": "2:1", "LastSplitDate": "2001-09-04"}