{"Symbol": "MBII", "AssetType": "Common Stock", "Name": "Marrone Bio Innovations, Inc", "Description": "Marrone Bio Innovations, Inc. discovers, develops, produces, and promotes biological products for pest management, plant nutrition, and plant health in the United States and internationally. Its products include Regalia, a plant extract-based fungicidal biopesticide for plant disease and plant health; Grandevo, a bioinsecticide for insect and mite control; Venerate, a bioinsecticide, which controls chewing and sucking insects and mites, as well as flies and plant parasitic nematodes; and Majestene, a bionematicide to control soil-dwelling nematodes by preventing and reducing root galls, and reducing adult reproduction and egg hatch, as well as controls soil borne insects. The company also provides Stargus, a biofungicide to control plant diseases, such as Sclerotinia white molds, gray mold/bunch rot, and downy mildews; and Haven, a plant health product that is applied to the leaves of plants to reduce sun stress. In addition, it offers Zequanox, a biomolluscicide that controls invasive mussels, which cause infrastructure and ecological damage primarily to power and industrial companies. Additionally, the company provides Pro Farm products for increasing plant health, yield and quality; and Jet-Ag and Jet-Oxide, peroxyacetic acid-based plant health product lines that stops molds and bacteria on plants and other surfaces. Marrone Bio Innovations, Inc. serves agricultural and water treatment markets. The company provides its products directly through sales force, as well as through distributors. The company formerly known as Marrone Organic Innovations, Inc. Marrone Bio Innovations, Inc. was founded in 2006 and is headquartered in Davis, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Basic Materials", "Industry": "Agricultural Inputs", "Address": "1540 Drew Avenue, Davis, CA, United States, 95618", "FullTimeEmployees": "133", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "201654896", "EBITDA": "-18152000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.175", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.187", "RevenuePerShareTTM": "0.263", "ProfitMargin": "-1.0257", "OperatingMarginTTM": "-0.5708", "ReturnOnAssetsTTM": "-0.2014", "ReturnOnEquityTTM": "-2.4597", "RevenueTTM": "35488000", "GrossProfitTTM": "16113000", "DilutedEPSTTM": "-0.27", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.74", "AnalystTargetPrice": "1.9", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "4.947", "PriceToBookRatio": "7.4398", "EVToRevenue": "6.0834", "EVToEBITDA": "0", "Beta": "0.2429", "52WeekHigh": "1.68", "52WeekLow": "0.6101", "50DayMovingAverage": "1.2394", "200DayMovingAverage": "1.0325", "SharesOutstanding": "149374000", "SharesFloat": "81355191", "SharesShort": "2365458", "SharesShortPriorMonth": "2155073", "ShortRatio": "15.28", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0358", "PercentInsiders": "0.796", "PercentInstitutions": "73.294", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}