{"Symbol": "MCRL", "AssetType": "Common Stock", "Name": "Micrel Inc", "Description": "DELISTED - Micrel, Incorporated, together with its subsidiaries, designs, develops, manufactures, and markets analog, mixed-signal, and digital semiconductor devices primarily in North America, Asia, and Europe. It offers power conversion products, including LDOs, DC/DC converters, analog power switches, PMICs, solid state lighting products, and FET drivers; supervisory and reference products that protect, monitor, and enhance the interface of circuitry around microcontroller and processor circuits; and general linear parts, such as op amps, thermal measurement devices, timers, and other general devices. The company also offers radio frequency data communication products, including QwikRadio family of RF receivers and transmitters for use in garage door openers, lighting and fan controls, automotive keyless entry, and remote controls, as well as RadioWire transceivers for applications, such as remote metering, security systems, and factory automation. In addition, it offers system timing, and clock generation and distribution products, as well as high speed physical media devices and fiber optic modules that are used primarily in communications infrastructure markets; and physical layer transceivers, media access controllers, switches, application specific standard products, and system-on-a-chip products for use in automotive, industrial automation and control, unified communications, and digital home network markets. Further, the company manufactures custom analog and mixed-signal circuits; and provides custom and foundry services, including silicon wafer fabrication, integrated circuit assembly, and testing for customers who produce electronic systems for communications, consumer, automotive, and military applications. Its products are used in mobility, enterprise/cloud infrastructure, wire line communications, and industrial and automotive markets. Micrel, Incorporated was founded in 1978 and is headquartered in San Jose, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "2180 Fortune Drive\n95131,San Jose,USA\n", "FullTimeEmployees": "None", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "None", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}