{"Symbol": "MEIP", "AssetType": "Common Stock", "Name": "MEI Pharma, Inc", "Description": "MEI Pharma, Inc., a late-stage pharmaceutical company, focuses on the development of various therapies for the treatment of cancer. The company's clinical drug candidate includes Pracinostat, an oral available histone deacetylase inhibitor for the treatment of patients with acute myeloid leukemia (AML) and myelodysplastic syndrome. Its clinical development portfolio also includes ME-401, an oral inhibitor of phosphatidylinositide 3-kinase delta for the treatment of patients with relapsed/refractory follicular lymphoma and B-cell malignancies; and Voruciclib, an oral cyclin-dependent kinase inhibitor for B-cell malignancies and AML. In addition, the company engages in the development of ME-344, a mitochondrial inhibitor targeting the oxidative phosphorylation complex for the treatment of HER2-negative breast cancer. MEI Pharma, Inc. has a license, development, and commercialization agreement with Helsinn Healthcare SA for the development, manufacture, and commercialization of Pracinostat; and a license agreement with Presage Biosciences, Inc. to develop, manufacture, and commercialize Voruciclib, a clinical-stage, oral, and selective cyclin-dependent kinase inhibitor, as well as related compounds. The company also has a license agreement with CyDex Pharmaceuticals, Inc. for Captisol to use with ME-344, which are isoflavone-based drug compounds; a clinical collaboration agreement with BeiGene, Ltd. to evaluate the safety and efficacy of ME-401 in combination with BeiGene's zanubrutinib, an investigational BTK inhibitor for the treatment of patients with B-cell malignancies; and a license agreement with Kyowa Kirin Co., Ltd. for ME-401. The company was formerly known as Marshall Edwards, Inc. and changed its name to MEI Pharma, Inc. in July 2012. MEI Pharma, Inc. was founded in 2000 and is based in San Diego, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "3611 Valley Centre Drive, San Diego, CA, United States, 92130", "FullTimeEmployees": "40", "FiscalYearEnd": "June", "LatestQuarter": "2020-03-31", "MarketCapitalization": "280897376", "EBITDA": "-46165000", "PERatio": "None", "PEGRatio": "20.6", "BookValue": "0.703", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.754", "RevenuePerShareTTM": "0.055", "ProfitMargin": "0", "OperatingMarginTTM": "-10.7784", "ReturnOnAssetsTTM": "-0.335", "ReturnOnEquityTTM": "-0.4358", "RevenueTTM": "4539000", "GrossProfitTTM": "652000", "DilutedEPSTTM": "-0.472", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.004", "AnalystTargetPrice": "9.44", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "47.2882", "PriceToBookRatio": "3.6852", "EVToRevenue": "40.0393", "EVToEBITDA": "0", "Beta": "1.7582", "52WeekHigh": "4.46", "52WeekLow": "0.72", "50DayMovingAverage": "2.94", "200DayMovingAverage": "2.7142", "SharesOutstanding": "105999000", "SharesFloat": "84124790", "SharesShort": "6405672", "SharesShortPriorMonth": "5163382", "ShortRatio": "5.48", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0613", "PercentInsiders": "3.001", "PercentInstitutions": "69.396", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:6", "LastSplitDate": "2012-12-19"}