{"Symbol": "MGCD", "AssetType": "Common Stock", "Name": "MGC Diagnostics Corp", "Description": "MGC Diagnostics Corporation, a medical technology company, designs, markets, and sells non-invasive cardiorespiratory diagnostic products in the United States, the Americas, Europe, the Middle East, Africa, and the Asia Pacific. Its pulmonary function products comprise the Medical Graphics CPF S/D USB, and Medisoft Micro 5000 and Micro 6000 spirometers; Medical Graphics Ultima PF Series, Medisoft SpiroAir, and Medisoft HypAir; Medical Graphics Platinum Elite and Medisoft BodyBox Series body plethysmographs; and Medisoft FeNO and FeNO+, and HypAir Muscle Study systems. These products include applications that enable the early detection of lung disease; evaluate the effect of medication; monitor patients with chronic disease; diagnose lung diseases; manage treatment; assess the surgical risk of lung transplant and lung reduction candidates; and evaluate the impact of diseases, such as neuromuscular disease on breathing. The company??s gas exchange testing products comprise the Ultima CPX metabolic stress testing system, Ultima CardiO2 gas exchange analysis system, CCM Express indirect calorimeter, Face Tent fans, Ergocard Clinical, Ergocard Professional gas exchange analysis system, and Ergocard ECG. These products applications consist of screening for early signs of cardiac and pulmonary dysfunction through diagnosis, evaluating the efficacy of prescribed therapy, and determining appropriate nutritional support requirements. It sells its products under the MGC Diagnostics and Medisoft brand names through direct sales force and distributors to hospitals, university-based medical centers, medical clinics, physician offices, pharmaceutical companies, medical device manufacturers, and clinical research organizations. The company was formerly known as Angeion Corporation and changed its name to MGC Diagnostics Corporation in August 2012. MGC Diagnostics Corporation was founded in 1986 and is headquartered in Saint Paul, Minnesota. As of December 27, 2017, MGC Diagnostics Corporation was taken private.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "350 Oak Grove Parkway\n55127,Saint Paul,USA\n", "FullTimeEmployees": "155", "FiscalYearEnd": "October", "LatestQuarter": "None", "MarketCapitalization": "48351548", "EBITDA": "1794000", "PERatio": "None", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "0", "DividendYield": "0", "EPS": "-0.827", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "10", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}