{"Symbol": "MGLN", "AssetType": "Common Stock", "Name": "Magellan Health, Inc", "Description": "Magellan Health, Inc. provides healthcare management services in the United States. The company operates in Healthcare and Pharmacy Management segments. The Healthcare segment offers carve-out management services for behavioral health; employee assistance plans (EAP); and other areas of specialty healthcare, including diagnostic imaging, musculoskeletal management, cardiac, and physical medicine. It also contracts with state Medicaid agencies, and the centers for Medicare and Medicaid services to manage care for beneficiaries under Medicaid and Medicare programs, such as healthcare and long-term support services through its network of medical and behavioral health professionals, clinics, hospitals, nursing facilities, home care agencies, and ancillary service providers. The Pharmacy Management segment comprises products and solutions that provide clinical and financial management of pharmaceuticals paid under medical and pharmacy benefit programs. It offers pharmacy benefit management services, such as pharmaceutical dispensing services; pharmacy benefit administration for state Medicaid and other government sponsored programs; clinical and formulary management programs; medical pharmacy management programs; and programs for the integrated management of specialty drugs that treat complex conditions. The company provides services to health plans and other managed care organizations, employers, labor unions, various military and governmental agencies, and third party administrators. Magellan Health, Inc. was founded in 1969 and is based in Phoenix, Arizona.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Healthcare Plans", "Address": "4801 East Washington Street, Phoenix, AZ, United States, 85034", "FullTimeEmployees": "10100", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1915744256", "EBITDA": "197106000", "PERatio": "17.5745", "PEGRatio": "0.93", "BookValue": "60.962", "DividendPerShare": "None", "DividendYield": "0", "EPS": "5.766", "RevenuePerShareTTM": "288.071", "ProfitMargin": "0.0202", "OperatingMarginTTM": "0.0167", "ReturnOnAssetsTTM": "0.0231", "ReturnOnEquityTTM": "0.0715", "RevenueTTM": "7108581888", "GrossProfitTTM": "227166000", "DilutedEPSTTM": "5.766", "QuarterlyEarningsGrowthYOY": "4.842", "QuarterlyRevenueGrowthYOY": "-0.047", "AnalystTargetPrice": "88.33", "TrailingPE": "17.5745", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.2565", "PriceToBookRatio": "1.1993", "EVToRevenue": "0.3398", "EVToEBITDA": "9.4737", "Beta": "1.2077", "52WeekHigh": "80.18", "52WeekLow": "30.6", "50DayMovingAverage": "74.5456", "200DayMovingAverage": "65.096", "SharesOutstanding": "25310400", "SharesFloat": "22647511", "SharesShort": "695964", "SharesShortPriorMonth": "539339", "ShortRatio": "3.27", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0195", "PercentInsiders": "1.151", "PercentInstitutions": "100.143", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}