{"Symbol": "MGRC", "AssetType": "Common Stock", "Name": "McGrath RentCorp", "Description": "McGrath RentCorp operates as a business to business rental company in the United States and internationally. It rents and sells relocatable modular buildings, portable storage containers, electronic test equipment and related accessories, and liquid and solid containment tanks and boxes. The company operates through four segments: Mobile Modular, TRS-RenTelco, Adler Tanks, and Enviroplex. The Mobile Modular segment rents and sells modular buildings designed for use as classrooms, temporary offices adjacent to existing facilities, sales offices, construction field offices, restroom buildings, health care clinics, child care facilities, office spaces, and various other purposes; and portable storage containers. The TRS-RenTelco segment rents and sells general purpose electronic test equipment, such as oscilloscopes, amplifiers, analyzers, signal source, and power source test equipment primarily to aerospace, defense, electronics, industrial, research, and semiconductor industries. It also provides communications test equipment, including network and transmission test equipment for various fiber, copper, and wireless networks to the manufacturers of communications equipment and products, electrical and communications installation contractors, field technicians, and service providers. The Adler Tanks segment rents fixed axle steel tanks for storing groundwater, wastewater, volatile organic liquids, sewage, slurry and bio sludge, oil and water mixtures, and chemicals; vacuum containers for sludge and solid materials; dewatering boxes for the separation of water contained in sludge and slurry; and roll-off and trash boxes for temporary storage and transportation of solid waste. The Enviroplex segment manufactures and sells portable classrooms directly to public school districts and other educational institutions in California. McGrath RentCorp was founded in 1979 and is headquartered in Livermore, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Rental & Leasing Services", "Address": "5700 Las Positas Road, Livermore, CA, United States, 94551-7800", "FullTimeEmployees": "1099", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1621515136", "EBITDA": "156516992", "PERatio": "16.3366", "PEGRatio": "2.4446", "BookValue": "26.732", "DividendPerShare": "1.68", "DividendYield": "0.0249", "EPS": "4.129", "RevenuePerShareTTM": "24.251", "ProfitMargin": "0.1728", "OperatingMarginTTM": "0.2507", "ReturnOnAssetsTTM": "0.0711", "ReturnOnEquityTTM": "0.1643", "RevenueTTM": "587908992", "GrossProfitTTM": "266165000", "DilutedEPSTTM": "4.129", "QuarterlyEarningsGrowthYOY": "0.165", "QuarterlyRevenueGrowthYOY": "0.08", "AnalystTargetPrice": "76.67", "TrailingPE": "16.3366", "ForwardPE": "24.4499", "PriceToSalesRatioTTM": "2.8287", "PriceToBookRatio": "2.5238", "EVToRevenue": "3.2256", "EVToEBITDA": "7.8647", "Beta": "0.9027", "52WeekHigh": "82.77", "52WeekLow": "44.32", "50DayMovingAverage": "60.6681", "200DayMovingAverage": "57.9536", "SharesOutstanding": "24083100", "SharesFloat": "23811198", "SharesShort": "217180", "SharesShortPriorMonth": "174153", "ShortRatio": "2.71", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0146", "PercentInsiders": "0.954", "PercentInstitutions": "88.426", "ForwardAnnualDividendRate": "1.68", "ForwardAnnualDividendYield": "0.0249", "PayoutRatio": "0.3741", "DividendDate": "2020-07-31", "ExDividendDate": "2020-07-16", "LastSplitFactor": "2:1", "LastSplitDate": "2005-03-28"}