{"Symbol": "MICTW", "AssetType": "Common Stock", "Name": "Micronet Enertec Technologies, Inc", "Description": "Micronet Enertec Technologies, Inc. develops, manufactures, integrates, and markets rugged computers, tablets, and computer-based systems and instruments for the commercial, defense, and aerospace markets in the United States, Israel, and internationally. The company, through its subsidiary, Micronet Ltd., sells rugged mobile computing devices that provide computing solutions to fleet operators and field workforces in work environments. Its vehicle cabin installed and portable tablets offer computing power and communication capabilities that provide fleet operators with visibility into vehicle location, fuel usage, speed, and mileage. The company, through its subsidiary, Enertec Systems 2001 Ltd, designs, develops, manufactures, and supplies various customized military computer-based systems, simulators, automatic test equipment, and electronic instruments for the defense and aerospace markets. Its solutions and systems are integrated into critical systems, such as command and control, missile fire control, maintenance of military aircraft, and missiles for use by the Israeli Air Force and Navy, and by foreign defense entities. Micronet Enertec Technologies, Inc. primarily serves application service providers, and solution providers specializing in the mobile resource management markets. The company was formerly known as Lapis Technologies, Inc. and changed its name to Micronet Enertec Technologies, Inc. in March 2013. Micronet Enertec Technologies, Inc. was founded in 2002 and is based in Montvale, New Jersey.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "82", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}