{"Symbol": "MIDD", "AssetType": "Common Stock", "Name": "The Middleby Corporation", "Description": "The Middleby Corporation designs, manufactures, markets, distributes, and services a range of foodservice, food processing, and residential kitchen equipment in the United States, Canada, Asia, Europe, the Middle East, and Latin America. Its Commercial Foodservice Equipment Group segment offers conveyor, combi, convection, baking, proofing, deck, speed cooking, and hydrovection ovens; ranges, fryers, rethermalizers; steam cooking, food warming, catering, induction cooking, countertop cooking, and kitchen ventilation equipment; heated cabinets, charbroilers, ventless cooking systems, toasters, griddles, charcoal grills, professional mixers, stainless steel fabrication, custom millwork, professional refrigerators, blast chillers, cold rooms, ice machines, freezers; and soft serve ice cream, coffee and beverage dispensing, and home and professional craft brewing equipment for quick and full-service restaurants, convenience stores, retail outlets, hotels, and other institutions. The company's Food Processing Equipment Group segment provides batch, baking, proofing, conveyor belt, and continuous processing ovens; frying and automated thermal processing systems; grinders, slicers, reduction and emulsion systems, mixers, blenders; battering, breading, and seeding equipment; water cutting systems, food presses, food suspension equipment, filling and depositing solutions, and forming equipment; and food safety, food handling, freezing, and defrosting and packaging equipment for customers producing hot dog, dinner sausage, poultry, and lunchmeat, as well as muffin, cookie, and bread products. Its Residential Kitchen Equipment Group segment offers kitchen equipment comprising cookers, stoves, dishwashers, microwaves, cooktops, wine coolers, ice machines, and ventilation and outdoor equipment. The company was formerly known as Middleby Marshall Oven Company and changed its name to The Middleby Corporation in 1985. The company was founded in 1888 and is based in Elgin, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "1400 Toastmaster Drive, Elgin, IL, United States, 60120", "FullTimeEmployees": "9778", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "5551758848", "EBITDA": "555139968", "PERatio": "18.7573", "PEGRatio": "1.1643", "BookValue": "34.899", "DividendPerShare": "None", "DividendYield": "0", "EPS": "5.158", "RevenuePerShareTTM": "48.021", "ProfitMargin": "0.1075", "OperatingMarginTTM": "0.1682", "ReturnOnAssetsTTM": "0.0543", "ReturnOnEquityTTM": "0.153", "RevenueTTM": "2661075968", "GrossProfitTTM": "1103497000", "DilutedEPSTTM": "5.158", "QuarterlyEarningsGrowthYOY": "-0.767", "QuarterlyRevenueGrowthYOY": "-0.38", "AnalystTargetPrice": "109", "TrailingPE": "18.7573", "ForwardPE": "22.0264", "PriceToSalesRatioTTM": "2.0122", "PriceToBookRatio": "2.7701", "EVToRevenue": "2.6841", "EVToEBITDA": "12.8523", "Beta": "1.6165", "52WeekHigh": "125.4", "52WeekLow": "41.73", "50DayMovingAverage": "91.1533", "200DayMovingAverage": "77.7646", "SharesOutstanding": "55617700", "SharesFloat": "54297855", "SharesShort": "9983795", "SharesShortPriorMonth": "9044921", "ShortRatio": "15.1", "ShortPercentOutstanding": "0.18", "ShortPercentFloat": "0.2062", "PercentInsiders": "2.124", "PercentInstitutions": "100.526", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "2004-06-02", "LastSplitFactor": "3:1", "LastSplitDate": "2014-06-27"}