{"Symbol": "MIND", "AssetType": "Common Stock", "Name": "MIND Technology, Inc", "Description": "Mitcham Industries, Inc., through its subsidiaries, provides technology to the oceanographic, hydrographic, defense, seismic and maritime security industries worldwide. The company operates in two segments, Marine Technology Products, and Equipment Leasing. The Marine Technology Products segment develops, manufactures, and sells proprietary products. Its products include the GunLink seismic source acquisition and control systems that provide operators of marine seismic surveys with precise monitoring and control of energy sources; the BuoyLink RGPS tracking system, which is used to offer precise positioning of marine seismic energy sources and streamers; Digishot energy source controllers; Sleeve Gun energy sources; SeaLink product line of marine sensors and solid streamer systems; and HarborGuard, an integrated waterside surveillance and security system that combines radar, video, and other surveillance technology to provide security for various waterside installations. This segment also provides streamer weight collars, depth and pressure transducers, air control valves, and source array systems; spare and replacement parts; repair and engineering services, training and field service operations, and umbilical termination; and equipment, consumables, systems integration, engineering hardware, and software maintenance support services. The Equipment Leasing segment leases seismic equipment for short-term primarily to seismic data acquisition contractors and oil field service providers. This segment also sells used equipment from its lease pool. Mitcham Industries, Inc. was founded in 1987 and is headquartered in The Woodlands, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "2002 Timberloch Place, The Woodlands, TX, United States, 77380", "FullTimeEmployees": "232", "FiscalYearEnd": "January", "LatestQuarter": "2020-04-30", "MarketCapitalization": "28628168", "EBITDA": "-5691000", "PERatio": "None", "PEGRatio": "-0.19", "BookValue": "1.516", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.39", "RevenuePerShareTTM": "3.306", "ProfitMargin": "-0.386", "OperatingMarginTTM": "-0.2689", "ReturnOnAssetsTTM": "-0.1169", "ReturnOnEquityTTM": "-0.3284", "RevenueTTM": "40193000", "GrossProfitTTM": "16621000", "DilutedEPSTTM": "-1.452", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.252", "AnalystTargetPrice": "6", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.6805", "PriceToBookRatio": "1.486", "EVToRevenue": "1.1635", "EVToEBITDA": "0", "Beta": "2.017", "52WeekHigh": "3.66", "52WeekLow": "0.7", "50DayMovingAverage": "2.3389", "200DayMovingAverage": "1.7453", "SharesOutstanding": "12182200", "SharesFloat": "11412560", "SharesShort": "107589", "SharesShortPriorMonth": "83999", "ShortRatio": "0.45", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0077", "PercentInsiders": "5.702", "PercentInstitutions": "71.685", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}