{"Symbol": "MINI", "AssetType": "Common Stock", "Name": "Mobile Mini, Inc", "Description": "Mobile Mini, Inc., together with its subsidiaries, provides portable storage and specialty containment solutions in the United States, the United Kingdom, and Canada. It operates through three segments: Storage Solutions North America, Storage Solutions United Kingdom, and Tank & Pump Solutions. The company offers various portable storage and office products, including steel storage containers and steel ground level offices to construction companies, retailers, medical centers, schools, utilities, distributors, military, hotels, restaurants, entertainment complexes, and households for various applications, such as storage of construction materials and equipment, retail and manufacturing inventory, documents and records, and other goods. It also provides a range of specialty containment equipment, such as steel tanks, stainless steel tank trailers, and pumps and filtration equipment, as well as roll-off, vacuum, and dewatering boxes. In addition, the company offers specialty containment services comprising transportation of containers for waste management; waste management oversight and services; system design services, including pumping assessment, filtration, and temporary storage; and field services to install and connect customer containment equipment. It primarily leases its specialty products for chemical, refinery, oil and natural gas drilling, mining, and environmental service customers. As of December 31, 2019, the company operated a rental fleet of approximately 200,200 storage solution containers and units; and 12,700 units of tank and pump solutions. Its network also consisted of 120 storage solutions locations, 20 tank and pump solutions locations and 16 combined locations. Mobile Mini, Inc. was founded in 1983 and is based in Phoenix, Arizona.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Rental & Leasing Services", "Address": "4646 East Van Buren Street, Phoenix, AZ, United States, 85008", "FullTimeEmployees": "2042", "FiscalYearEnd": "December", "LatestQuarter": "2020-03-31", "MarketCapitalization": "1308248320", "EBITDA": "235987008", "PERatio": "17.6647", "PEGRatio": "1.1247", "BookValue": "18.761", "DividendPerShare": "1.21", "DividendYield": "0.0352", "EPS": "1.671", "RevenuePerShareTTM": "13.898", "ProfitMargin": "0.1208", "OperatingMarginTTM": "0.27", "ReturnOnAssetsTTM": "0.0493", "ReturnOnEquityTTM": "0.0897", "RevenueTTM": "612003968", "GrossProfitTTM": "231627000", "DilutedEPSTTM": "1.671", "QuarterlyEarningsGrowthYOY": "-0.527", "QuarterlyRevenueGrowthYOY": "-0.004", "AnalystTargetPrice": "33.5", "TrailingPE": "17.6647", "ForwardPE": "15.748", "PriceToSalesRatioTTM": "2.1415", "PriceToBookRatio": "1.587", "EVToRevenue": "3.7111", "EVToEBITDA": "10.6617", "Beta": "1.5477", "52WeekHigh": "56.6", "52WeekLow": "18.41", "50DayMovingAverage": "29.5", "200DayMovingAverage": "31.0983", "SharesOutstanding": "44359900", "SharesFloat": "43122871", "SharesShort": "551203", "SharesShortPriorMonth": "557153", "ShortRatio": "2.23", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0194", "PercentInsiders": "1.745", "PercentInstitutions": "103.337", "ForwardAnnualDividendRate": "1.21", "ForwardAnnualDividendYield": "0.0352", "PayoutRatio": "0.6754", "DividendDate": "2020-06-30", "ExDividendDate": "2020-06-18", "LastSplitFactor": "2:1", "LastSplitDate": "2006-03-13"}