{"Symbol": "MKSI", "AssetType": "Common Stock", "Name": "MKS Instruments, Inc", "Description": "MKS Instruments, Inc. provides instruments, systems, subsystems, and process control solutions that measure, monitor, deliver, analyze, power, and control critical parameters of manufacturing processes worldwide. Its Vacuum & Analysis segment offers pressure and vacuum control solutions, including direct and indirect pressure measurement; materials delivery solutions comprising flow and valve technologies, as well as integrated pressure measurement and control subsystems, which provide customers with precise control capabilities; power delivery products, such as microwave, power delivery systems, radio frequency matching networks, and metrology products used in providing energy to etching, stripping, and deposition processes; and plasma and reactive gas products. The company's Light & Motion segment offers lasers and laser-based systems, such as amplifiers, fiber lasers, diode-pumped solid-state lasers, high-energy pulsed lasers, and tunable lasers; and photonics products comprising optical components, lens assemblies, and vibration isolation solutions, as well as instruments and motion products, such as high-precision motion stages and controls, hexapods, photonics instruments for measurement and analysis, and production equipment for test and measurement. Its Equipment & Solutions segment provides laser-based systems for printed circuit board (PCB) manufacturing, including flexible interconnect PCB processing systems and HDI solutions for rigid PCB manufacturing and substrate processing, as well as passive component MLCC testing. The company serves semiconductor, industrial technologies, life and health sciences, research, and defense markets. It markets and sells its products and services through its direct sales organization, independent distributors, and sales representatives, as well as through its websites and product catalogs. MKS Instruments, Inc. was founded in 1961 and is headquartered in Andover, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "2 Tech Drive, Andover, MA, United States, 01810", "FullTimeEmployees": "5500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6713159168", "EBITDA": "446380000", "PERatio": "28.1019", "PEGRatio": "0.61", "BookValue": "38.61", "DividendPerShare": "0.8", "DividendYield": "0.0067", "EPS": "4.218", "RevenuePerShareTTM": "37.147", "ProfitMargin": "0.1141", "OperatingMarginTTM": "0.1648", "ReturnOnAssetsTTM": "0.06", "ReturnOnEquityTTM": "0.1144", "RevenueTTM": "2042072960", "GrossProfitTTM": "838055000", "DilutedEPSTTM": "4.218", "QuarterlyEarningsGrowthYOY": "0.934", "QuarterlyRevenueGrowthYOY": "0.148", "AnalystTargetPrice": "148.6", "TrailingPE": "28.1019", "ForwardPE": "22.9885", "PriceToSalesRatioTTM": "3.2092", "PriceToBookRatio": "3.0741", "EVToRevenue": "3.3981", "EVToEBITDA": "16.0405", "Beta": "1.5236", "52WeekHigh": "129.97", "52WeekLow": "66.87", "50DayMovingAverage": "122.207", "200DayMovingAverage": "104.8614", "SharesOutstanding": "55125300", "SharesFloat": "54507862", "SharesShort": "1360601", "SharesShortPriorMonth": "1416817", "ShortRatio": "2.21", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.015", "PercentInsiders": "1.064", "PercentInstitutions": "97.747", "ForwardAnnualDividendRate": "0.8", "ForwardAnnualDividendYield": "0.0067", "PayoutRatio": "0.1896", "DividendDate": "2020-09-04", "ExDividendDate": "2020-08-21", "LastSplitFactor": "None", "LastSplitDate": "None"}