{"Symbol": "MLAB", "AssetType": "Common Stock", "Name": "Mesa Laboratories, Inc", "Description": "Mesa Laboratories, Inc. designs, manufactures, and markets quality control instruments and disposable products in the United States, Canada, Europe, and Japan. The company's Sterilization and Disinfection Control segment manufactures and markets biological indicators comprising spore strips, self-contained products, and culture media, as well as process challenge devices; and offers testing services. This segment also provides chemical and cleaning indicators that are used to assess the effectiveness of sterilization and cleaning processes. Its Instruments segment offers data loggers used in critical manufacturing, quality control, and validation applications; medical meters and calibration solutions used to test various parameters of the dialysis fluid, and the calibration and operation of the dialysis machine; gas flow calibration and air sampling equipment that are used for industrial hygiene assessments, calibration of gas metering equipment, and environmental air sampling; and torque testing systems used for measure bottle cap tightness. This segment's products are used in healthcare, pharmaceutical, medical device, food and beverage, industrial hygiene, and environmental air sampling industries. The company's Biopharmaceutical Development segment develops, manufactures, and commercializes automated solutions for protein analysis, which include analysis equipment, CDs, kits, and buffers; and peptide synthesizers to automate chemically synthesized peptides that are used in the creation of peptide therapies, biomaterials, cosmetics, and general research. Its Continuous Monitoring segment offers systems, which are used to monitor temperature, humidity, and differential pressure for use in hospitals, pharmaceutical and medical device manufacturers, blood banks, pharmacies, and laboratory environments. The company was founded in 1982 and is headquartered in Lakewood, Colorado.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "12100 West Sixth Avenue, Lakewood, CO, United States, 80228", "FullTimeEmployees": "460", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1250294272", "EBITDA": "29830000", "PERatio": "736.3871", "PEGRatio": "0", "BookValue": "74.905", "DividendPerShare": "0.64", "DividendYield": "0.0027", "EPS": "0.31", "RevenuePerShareTTM": "27.851", "ProfitMargin": "-0.0183", "OperatingMarginTTM": "0.1246", "ReturnOnAssetsTTM": "0.0257", "ReturnOnEquityTTM": "-0.0089", "RevenueTTM": "121340000", "GrossProfitTTM": "73435000", "DilutedEPSTTM": "-0.513", "QuarterlyEarningsGrowthYOY": "-0.805", "QuarterlyRevenueGrowthYOY": "0.139", "AnalystTargetPrice": "263.67", "TrailingPE": "736.3871", "ForwardPE": "35.2113", "PriceToSalesRatioTTM": "8.9751", "PriceToBookRatio": "3.2192", "EVToRevenue": "9.4129", "EVToEBITDA": "56.5426", "Beta": "0.383", "52WeekHigh": "271.46", "52WeekLow": "181.9", "50DayMovingAverage": "235.8631", "200DayMovingAverage": "232.6692", "SharesOutstanding": "5103450", "SharesFloat": "4820363", "SharesShort": "384330", "SharesShortPriorMonth": "439747", "ShortRatio": "10.98", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.0854", "PercentInsiders": "8.898", "PercentInstitutions": "94.942", "ForwardAnnualDividendRate": "0.64", "ForwardAnnualDividendYield": "0.0027", "PayoutRatio": "2.0645", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-28", "LastSplitFactor": "None", "LastSplitDate": "None"}