{"Symbol": "MLVF", "AssetType": "Common Stock", "Name": "Malvern Bancorp, Inc", "Description": "Malvern Bancorp, Inc. operates as the bank holding company for Malvern Bank that provides various banking products and services to consumer and business customers in Pennsylvania. The company accepts checking accounts, retirement accounts, money market accounts, time and savings accounts, interest and non-interest bearing accounts, NOW accounts, and CDARS/ICS reciprocal deposits. Its loan products include residential mortgage loans, such as one class and one-to four-family first lien residential mortgage loans; residential and commercial construction loans, and land loans; commercial loans, such as commercial real estate loans, multi-family real estate loans, industrial loans, and commercial business loans; and consumer loans comprising home equity lines of credit, second mortgage loans, and unsecured consumer lines of credit. The company also offers credit cards; wealth management and advisory services, such as liquidity management, investment, 401(k) accounts and planning, custody, lending, wealth planning, trust and fiduciary, family wealth advisory, and philanthropic advisory services; insurance services; and wire transfer, automated teller, Internet banking, ACH origination, telephone and mobile banking, safe deposit box, and remote deposit capture banking services. As of September 30, 2019, it owns and maintains its headquarters and five full-service financial centers; leases financial centers in Glen Mills and Villanova, Pennsylvania; private banking offices in Morristown, New Jersey and Palm Beach, Florida; and leases representative office in Montchanin, Delaware. Malvern Bancorp, Inc. was founded in 1887 and is headquartered in Paoli, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "42 East Lancaster Avenue, Paoli, PA, United States, 19301", "FullTimeEmployees": "88", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "96494168", "EBITDA": "None", "PERatio": "13.7528", "PEGRatio": "0", "BookValue": "19.086", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.89", "RevenuePerShareTTM": "3.52", "ProfitMargin": "0.2548", "OperatingMarginTTM": "0.3336", "ReturnOnAssetsTTM": "0.0055", "ReturnOnEquityTTM": "0.0484", "RevenueTTM": "26867000", "GrossProfitTTM": "29288000", "DilutedEPSTTM": "0.89", "QuarterlyEarningsGrowthYOY": "-0.451", "QuarterlyRevenueGrowthYOY": "-0.162", "AnalystTargetPrice": "15", "TrailingPE": "13.7528", "ForwardPE": "0", "PriceToSalesRatioTTM": "3.1063", "PriceToBookRatio": "0.649", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.7934", "52WeekHigh": "23.75", "52WeekLow": "10.06", "50DayMovingAverage": "12.2744", "200DayMovingAverage": "13.3171", "SharesOutstanding": "7609950", "SharesFloat": "3751846", "SharesShort": "40519", "SharesShortPriorMonth": "100130", "ShortRatio": "0.4", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0023", "PercentInsiders": "4.263", "PercentInstitutions": "63.005", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2011-01-20", "ExDividendDate": "2010-12-29", "LastSplitFactor": "2687:2500", "LastSplitDate": "2012-10-12"}