{"Symbol": "MNDO", "AssetType": "Common Stock", "Name": "MIND C.T.I. Ltd", "Description": "MIND C.T.I. Ltd., together with its subsidiaries, designs, develops, markets, supports, implements, and operates real-time and offline convergent billing and customer care software solutions in the United States, the United Kingdom, Europe, Israel, and internationally. The company offers billing and customer care solutions that support various services, such as voice, data, and content services, as well as prepaid, postpaid, and pay-in-advance payment models in a single platform. Its solutions also include a workflow engine to support the implementation of business processes, including subscriber registration, order management, trouble ticket, and debt collection; and an integral point of sale solution that covers all dealer, store and cashier management, and sales processes. In addition, the company offers professional services comprising installation, turnkey project implementation services, customer support, training and maintenance services, software and process customization, and project management, as well as managed services, including day to day billing operational tasks primarily to its billing and customer care customers. Further, it provides PhonEX ONE, a call management system that collects, records, and stores call information, which is used by corporations for telecom expense management, call accounting, traffic analysis, and fraud detection. The company offers its products directly, as well as through network equipment vendors and systems integrators, and resellers primarily to communication providers, such as traditional wireline and wireless, voice over IP, broadband IP network operators, LTE operators, cable operators, and mobile virtual network operators. The company was founded in 1995 and is headquartered in Yokne'am Illit, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "Building #7, Yokne'am Illit, Israel, 20692", "FullTimeEmployees": "214", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "46159416", "EBITDA": "5411000", "PERatio": "9.24", "PEGRatio": "0", "BookValue": "0.999", "DividendPerShare": "0.24", "DividendYield": "0.1048", "EPS": "0.25", "RevenuePerShareTTM": "1.213", "ProfitMargin": "0.212", "OperatingMarginTTM": "0.2163", "ReturnOnAssetsTTM": "0.1164", "ReturnOnEquityTTM": "0.2608", "RevenueTTM": "24112000", "GrossProfitTTM": "12538000", "DilutedEPSTTM": "0.25", "QuarterlyEarningsGrowthYOY": "0.4", "QuarterlyRevenueGrowthYOY": "-0.068", "AnalystTargetPrice": "None", "TrailingPE": "9.24", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.9226", "PriceToBookRatio": "2.3122", "EVToRevenue": "1.4276", "EVToEBITDA": "6.3614", "Beta": "0.6187", "52WeekHigh": "2.64", "52WeekLow": "1.45", "50DayMovingAverage": "2.1603", "200DayMovingAverage": "2.0441", "SharesOutstanding": "19896300", "SharesFloat": "16581799", "SharesShort": "9098", "SharesShortPriorMonth": "4145", "ShortRatio": "0.43", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0009", "PercentInsiders": "16.668", "PercentInstitutions": "16.582", "ForwardAnnualDividendRate": "0.24", "ForwardAnnualDividendYield": "0.1048", "PayoutRatio": "0.96", "DividendDate": "2020-04-16", "ExDividendDate": "2020-03-24", "LastSplitFactor": "None", "LastSplitDate": "None"}