{"Symbol": "MNTA", "AssetType": "Common Stock", "Name": "Momenta Pharmaceuticals, Inc", "Description": "Momenta Pharmaceuticals, Inc., a biotechnology company, focuses on the discovery and development of novel biologic therapies for the treatment of rare immune-mediated diseases in the United States. Its novel therapeutic programs include M281, a fully-human anti-neonatal Fc receptor (FcRn), aglycosylated immunoglobulin G (IgG1), and monoclonal antibody to reduce circulating IgG antibodies by blocking endogenous IgG recycling via FcRn; M230, a recombinant trivalent human IgG1 Fc multimer containing three IgG Fc regions joined to maximize activity; and M254, a hyper-sialylated immunoglobulin to treat various inflammatory diseases, including idiopathic thrombocytopenic purpura and chronic inflammatory demyelinating polyneuropathy. The company's biosimilar programs comprise M923, a biosimilar of HUMIRA for the treatment of patients with rheumatoid arthritis, crohn's disease, ulcerative colitis, and psoriasis; and M710, a biosimilar of EYLEA for the treatment of neovascular age-related macular degeneration, macular edema following retinal vein occlusion, diabetic macular edema (DME), and diabetic retinopathy in patients with DME. Its complex generics programs include Enoxaparin sodium injection, a generic version of LOVENOX that is indicated for the prevention and treatment of deep vein thrombosis, as well as supports the treatment of acute coronary syndromes; GLATOPA, a generic version of once-daily COPAXONE for the treatment of patients with relapsing forms of multiple sclerosis; and GLATOPA, a generic version of three-times-weekly COPAXONE. The company has collaboration and license agreements with Sandoz AG, Mylan Ireland Limited, and CSL Behring Recombinant Facility AG. The company was formerly known as Mimeon, Inc. and changed its name to Momenta Pharmaceuticals, Inc. in September 2002. Momenta Pharmaceuticals, Inc. was founded in 2001 and is headquartered in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Drug ManufacturersSpecialty & Generic", "Address": "301 Binney Street, Cambridge, MA, United States, 02142", "FullTimeEmployees": "118", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6225438720", "EBITDA": "-190824000", "PERatio": "None", "PEGRatio": "0", "BookValue": "3.406", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-2.441", "RevenuePerShareTTM": "0.276", "ProfitMargin": "0", "OperatingMarginTTM": "-8.1534", "ReturnOnAssetsTTM": "-0.3056", "ReturnOnEquityTTM": "-0.6436", "RevenueTTM": "30072000", "GrossProfitTTM": "-73756000", "DilutedEPSTTM": "-2.092", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.276", "AnalystTargetPrice": "50.79", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "188.6503", "PriceToBookRatio": "15.6788", "EVToRevenue": "192.8331", "EVToEBITDA": "0", "Beta": "1.4324", "52WeekHigh": "52.33", "52WeekLow": "12.09", "50DayMovingAverage": "36.1208", "200DayMovingAverage": "32.2519", "SharesOutstanding": "118965000", "SharesFloat": "114557626", "SharesShort": "8146960", "SharesShortPriorMonth": "6192438", "ShortRatio": "6.61", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0952", "PercentInsiders": "0.984", "PercentInstitutions": "103.484", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}