{"Symbol": "MOBL", "AssetType": "Common Stock", "Name": "MobileIron, Inc", "Description": "MobileIron, Inc., together with its subsidiaries, provides mobile IT platform that enables enterprises to manage and secure mobile applications, content, and devices while offering their employees with device choice, privacy, and a native user experience worldwide. It offers MobileIron security platform, which includes MobileIron unified endpoint management, a security platform that provides the fundamental visibility and IT controls to secure, manage, and monitor various corporate or employee-owned mobile devices or desktops that access business-critical data; MobileIron Access to block untrusted devices and applications from accessing cloud services based on security posture and compliance, as well as provide zero sign-on; and MobileIron Tunnel that provides connectivity through a per-app VPN to connect applications to back-end services. The company's MobileIron security platform also comprises MobileIron Threat Defense to identify zero-day threats on the device across networks and within client apps; and MobileIron secure applications for end-user productivity, such as enterprise app store, secure content, secure email and PIM, remote troubleshooting, and secure browsing applications, as well as MobileIron AppConnect, an SDK and wrapper that third-party developers integrate into their applications to provide security through additional encryption and advanced security controls. It serves various industries, including financial services, government, healthcare, legal, manufacturing, professional services, retail, technology, and telecommunications primarily through distributors, resellers, service providers, system vendors, and system integrators. MobileIron, Inc. was founded in 2007 and is headquartered in Mountain View, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "401 East Middlefield Road, Mountain View, CA, United States, 94043", "FullTimeEmployees": "870", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "767343488", "EBITDA": "-40423000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.304", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.444", "RevenuePerShareTTM": "1.897", "ProfitMargin": "-0.1737", "OperatingMarginTTM": "-0.1587", "ReturnOnAssetsTTM": "-0.1061", "ReturnOnEquityTTM": "-1.0238", "RevenueTTM": "214912000", "GrossProfitTTM": "163147000", "DilutedEPSTTM": "-0.329", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.158", "AnalystTargetPrice": "7.31", "TrailingPE": "0", "ForwardPE": "62.5", "PriceToSalesRatioTTM": "3.3902", "PriceToBookRatio": "21.1779", "EVToRevenue": "3.1473", "EVToEBITDA": "0", "Beta": "1.6016", "52WeekHigh": "7.79", "52WeekLow": "2.94", "50DayMovingAverage": "5.8058", "200DayMovingAverage": "4.7376", "SharesOutstanding": "116884000", "SharesFloat": "93125763", "SharesShort": "3490262", "SharesShortPriorMonth": "3442014", "ShortRatio": "3.1", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0413", "PercentInsiders": "2.293", "PercentInstitutions": "80.79", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "5:7", "LastSplitDate": "2014-05-27"}