{"Symbol": "MOFG", "AssetType": "Common Stock", "Name": "MidWestOne Financial Group, Inc", "Description": "MidWestOne Financial Group, Inc. operates as the bank holding company for MidWestOne Bank that provides commercial and retail banking products and services to individuals, businesses, institutional customers, and government agencies in Iowa, Minnesota, Wisconsin, Florida, and Colorado. It offers deposit products, such as non-interest-bearing and interest-bearing demand deposit accounts, interest checking accounts, savings accounts, money market accounts, certificates of deposit, and time deposits. The company also provides commercial and residential real estate, commercial and industrial, agricultural, consumer, and credit card loans. In addition, it offers various trust and investment services, including administering estates, personal trusts, and conservatorships, as well as property management, farm management, investment advisory, retail securities brokerage, financial planning, securities trading, mutual funds sales, fixed and variable annuities and tax-exempt, conventional unit trusts, and custodial services. Further, the company provides other products and services comprising treasury management, debit cards, automated teller machines, online banking, mobile banking, and safe deposit boxes. It offers its products and services primarily through a network of full-service branches, including 34 branches located throughout central and eastern Iowa; 13 branches located in the Minneapolis-St. Paul metropolitan area of Minnesota; seven branches in western Wisconsin; one branch in each of Naples and Fort Myers, Florida; and one branch in Denver, Colorado. MidWestOne Financial Group, Inc. was incorporated in 1983 and is headquartered in Iowa City, Iowa.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "102 South Clinton Street, Iowa City, IA, United States, 52240", "FullTimeEmployees": "771", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "313775360", "EBITDA": "None", "PERatio": "8.5727", "PEGRatio": "2.52", "BookValue": "32.348", "DividendPerShare": "0.88", "DividendYield": "0.0459", "EPS": "2.181", "RevenuePerShareTTM": "10.095", "ProfitMargin": "0.217", "OperatingMarginTTM": "0.3237", "ReturnOnAssetsTTM": "0.0072", "ReturnOnEquityTTM": "0.0702", "RevenueTTM": "163138000", "GrossProfitTTM": "167738000", "DilutedEPSTTM": "2.181", "QuarterlyEarningsGrowthYOY": "0.015", "QuarterlyRevenueGrowthYOY": "-0.015", "AnalystTargetPrice": "23.5", "TrailingPE": "8.5727", "ForwardPE": "9.6712", "PriceToSalesRatioTTM": "1.569", "PriceToBookRatio": "0.583", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.0137", "52WeekHigh": "37.385", "52WeekLow": "15.25", "50DayMovingAverage": "19.0672", "200DayMovingAverage": "20.8611", "SharesOutstanding": "16099300", "SharesFloat": "14774994", "SharesShort": "285633", "SharesShortPriorMonth": "161378", "ShortRatio": "5.51", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0128", "PercentInsiders": "7.98", "PercentInstitutions": "75.416", "ForwardAnnualDividendRate": "0.88", "ForwardAnnualDividendYield": "0.0459", "PayoutRatio": "0.3841", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-31", "LastSplitFactor": "None", "LastSplitDate": "None"}