{"Symbol": "MORN", "AssetType": "Common Stock", "Name": "Morningstar, Inc", "Description": "Morningstar, Inc. provides independent investment research services in North America, Europe, Australia, Canada, Asia, the United Kingdom, and internationally. It offers web-based tools; investment data, fundamental equity research, manager research, credit ratings, and private capital markets research services; and investment offerings, including managed investment products, publicly listed companies, fixed income securities, private capital markets, and real-time global market data for financial advisors, asset managers, retirement plan providers and sponsors, and individual and institutional investors. The company offers Morningstar Data, an investment data spanning various investment databases, including equity fundamentals, managed investments, and real-time pricing and market data; Morningstar Direct, an investment-analysis platform; Morningstar Managed Portfolios, an advisor service consisting of model portfolio that offers services for independent financial advisors, as well as offers asset allocation services for asset managers, broker-dealers, and insurance providers; Morningstar Advisor Workstation, a web-based research and proposal generation platform; and Morningstar.com, a Website for individual investors. It also provides Morningstar Enterprise Components; Morningstar Credit Ratings that provides new issue and surveillance ratings for structured finance securities; operational risk assessment services, deal monitoring, and corporate credit estimation; Morningstar Indexes for creating investment products; Morningstar workplace solutions, such as retirement accounts, fiduciary services, allocation funds, and custom models; and PitchBook Platform, research and analysis workstation for investment and research professionals. In addition, the company's PitchBook offers a mobile application, excel plug-in, data feeds, and data solutions. Morningstar, Inc. was founded in 1984 and is headquartered in Chicago, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Financial Data & Stock Exchanges", "Address": "22 West Washington Street, Chicago, IL, United States, 60602", "FullTimeEmployees": "6914", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "6942503936", "EBITDA": "270200000", "PERatio": "47.2064", "PEGRatio": "0", "BookValue": "25.323", "DividendPerShare": "1.2", "DividendYield": "0.0074", "EPS": "3.44", "RevenuePerShareTTM": "30.329", "ProfitMargin": "0.1146", "OperatingMarginTTM": "0.1503", "ReturnOnAssetsTTM": "0.0622", "ReturnOnEquityTTM": "0.1424", "RevenueTTM": "1298099968", "GrossProfitTTM": "695900000", "DilutedEPSTTM": "3.44", "QuarterlyEarningsGrowthYOY": "0.143", "QuarterlyRevenueGrowthYOY": "0.197", "AnalystTargetPrice": "75", "TrailingPE": "47.2064", "ForwardPE": "0", "PriceToSalesRatioTTM": "5.4105", "PriceToBookRatio": "6.4127", "EVToRevenue": "5.5881", "EVToEBITDA": "20.8325", "Beta": "1.1956", "52WeekHigh": "170", "52WeekLow": "102.59", "50DayMovingAverage": "159.3319", "200DayMovingAverage": "144.8067", "SharesOutstanding": "42921200", "SharesFloat": "22481686", "SharesShort": "325651", "SharesShortPriorMonth": "332865", "ShortRatio": "3.63", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0127", "PercentInsiders": "49.061", "PercentInstitutions": "46.739", "ForwardAnnualDividendRate": "1.2", "ForwardAnnualDividendYield": "0.0074", "PayoutRatio": "0.343", "DividendDate": "2020-07-31", "ExDividendDate": "2020-10-15", "LastSplitFactor": "None", "LastSplitDate": "None"}