{"Symbol": "MRCY", "AssetType": "Common Stock", "Name": "Mercury Systems, Inc", "Description": "Mercury Systems, Inc., a technology company, manufactures and sells components, modules, and subsystems in the United States, Europe, and the Asia Pacific. The company's products and solutions are deployed in approximately 300 programs with 25 defense prime contractors and commercial aviation customers. It offers components, including power amplifiers and limiters, switches, oscillators, filters, equalizers, digital and analog converters, chips, monolithic microwave integrated circuits, and memory and storage devices; modules and sub-assemblies, such as embedded processing modules and boards, switch fabric boards, high speed input/output boards, digital receiver boards, multi-chip modules, integrated radio frequency and microwave multi-function assemblies, tuners, and transceivers, as well as graphics and video processing, and Ethernet and input-output boards; and integrated subsystems. The company also designs, develops, and manufactures digital radio frequency memory units for various modern electronic warfare applications; radar environment simulation and test systems for defense and intelligence applications; and signals intelligence payloads and EO/IR technologies for small UAV platforms, as well as onboard UAV processor systems for real-time wide area motion imagery. In addition, it designs, markets and sells products intended to protect electronic systems that are critical to national security. The company serves the aerospace and defense electronics industries. The company was formerly known as Mercury Computer Systems, Inc. and changed its name to Mercury Systems, Inc. in November 2012. Mercury Systems, Inc. was founded in 1981 and is headquartered in Andover, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Aerospace & Defense", "Address": "50 Minuteman Road, Andover, MA, United States, 01810", "FullTimeEmployees": "1947", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4173210112", "EBITDA": "146676992", "PERatio": "47.6859", "PEGRatio": "1.5873", "BookValue": "25.315", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.56", "RevenuePerShareTTM": "14.604", "ProfitMargin": "0.1076", "OperatingMarginTTM": "0.1222", "ReturnOnAssetsTTM": "0.0402", "ReturnOnEquityTTM": "0.0642", "RevenueTTM": "796609984", "GrossProfitTTM": "358645000", "DilutedEPSTTM": "1.56", "QuarterlyEarningsGrowthYOY": "0.998", "QuarterlyRevenueGrowthYOY": "0.228", "AnalystTargetPrice": "92.5", "TrailingPE": "47.6859", "ForwardPE": "31.5457", "PriceToSalesRatioTTM": "5.1468", "PriceToBookRatio": "2.9891", "EVToRevenue": "4.9954", "EVToEBITDA": "27.5833", "Beta": "0.9676", "52WeekHigh": "96.29", "52WeekLow": "52.24", "50DayMovingAverage": "76.8389", "200DayMovingAverage": "78.8196", "SharesOutstanding": "55598700", "SharesFloat": "54568381", "SharesShort": "1548989", "SharesShortPriorMonth": "1953814", "ShortRatio": "4.5", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0325", "PercentInsiders": "1.958", "PercentInstitutions": "98.269", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "1999-12-21"}