{"Symbol": "MTRX", "AssetType": "Common Stock", "Name": "Matrix Service Company", "Description": "Matrix Service Company provides engineering, fabrication, infrastructure, construction, and maintenance services primarily to the oil, gas, power, petrochemical, industrial, agricultural, mining, and minerals markets in the United States, Canada, and internationally. The company's Electrical Infrastructure segment offers power delivery services, including construction of new substations, upgrades of existing substations, short-run transmission line installations, distribution upgrades, and maintenance; and emergency and storm restoration services. It also provides construction and maintenance services to combined cycle plants and other natural gas fired power stations. The company's Oil Gas & Chemical segment offers plant maintenance, turnarounds, engineering, and capital construction services; and hydro-blasting and excavating, advanced chemical cleaning, and vacuum services, as well as performs work in the petrochemical, upstream petroleum, sulfur extraction, and recovery and processing markets. Its Storage Solutions segment undertakes work related to aboveground storage tanks and terminals; and liquefied natural gas, liquid nitrogen/liquid oxygen, liquid petroleum, and other specialty vessels, which comprise spheres, as well as marine structures and truck and rail loading/offloading facilities. Its services include engineering, fabrication and construction, and maintenance and repair, including planned and emergency services, as well as geodesic domes, aluminum internal floating roofs, floating suction and skimmer systems, roof drain systems, and floating roof seals. The company's Industrial segment offers engineering, fabrication and construction, and maintenance and repair, which include planned and emergency services; designs instrumentation and control systems; and offer specialized expertise in the design and construction of bulk material handling systems. The company was founded in 1984 and is headquartered in Tulsa, Oklahoma.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Energy", "Industry": "Oil & Gas Equipment & Services", "Address": "5100 East Skelly Drive, Tulsa, OK, United States, 74135", "FullTimeEmployees": "5000", "FiscalYearEnd": "June", "LatestQuarter": "2020-03-31", "MarketCapitalization": "240747552", "EBITDA": "52747000", "PERatio": "18.6139", "PEGRatio": "2.28", "BookValue": "11.918", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.15", "RevenuePerShareTTM": "48.671", "ProfitMargin": "-0.0112", "OperatingMarginTTM": "0.0259", "ReturnOnAssetsTTM": "0.0352", "ReturnOnEquityTTM": "-0.0449", "RevenueTTM": "1303815040", "GrossProfitTTM": "131951000", "DilutedEPSTTM": "-0.546", "QuarterlyEarningsGrowthYOY": "1.75", "QuarterlyRevenueGrowthYOY": "-0.308", "AnalystTargetPrice": "13.5", "TrailingPE": "18.6139", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.1798", "PriceToBookRatio": "0.7294", "EVToRevenue": "0.1379", "EVToEBITDA": "20.2407", "Beta": "1.3434", "52WeekHigh": "23.83", "52WeekLow": "7.11", "50DayMovingAverage": "9.415", "200DayMovingAverage": "10.1171", "SharesOutstanding": "26139800", "SharesFloat": "25536194", "SharesShort": "426716", "SharesShortPriorMonth": "409076", "ShortRatio": "3.88", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0183", "PercentInsiders": "1.928", "PercentInstitutions": "100.934", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2003-11-24"}