{"Symbol": "MTSC", "AssetType": "Common Stock", "Name": "MTS Systems Corporation", "Description": "MTS Systems Corporation supplies test systems, motion simulators, and sensors in the Americas, Europe, and Asia. The company's Test & Simulation segment offers road simulators and component test systems, vehicle performance test systems, vehicle dynamics simulators, electrical motors and energy recovery systems, tire performance and rolling resistance measurement systems, and moving ground-plane systems and balances. It also provides systems for the physical characterization of material properties; systems to test durability and performance of implants, prostheses, and other medical and dental materials and devices; products, systems, and software to perform static and fatigue testing of aircraft; products for blades, bearings, and wind turbines; structural engineering systems, such as static and dynamic testing; and seismic simulation tables. In addition, this segment offers installation, product life cycle management, professional training, calibration and metrology, technical consulting, and onsite and factory repair and maintenance services, as well as accessories and spare parts. It serves automobile, truck, motorcycle, motorsports vehicles, construction and agricultural equipment, rail and off-road vehicle manufacturers, and their suppliers, as well as the power generation, aerospace, vehicles, biomedical, structural engineering, oil and gas, wind energy, and other industries. The company's Sensors segment offers sensors for measurements of vibration, pressure, position, force, and sound; and piezoelectric sensors and components. It serves the automotive, aerospace, industrial, defense, and research and development markets. The company sells its products through direct sales and service organizations, and independent representatives and distributors, as well as through catalogs, Internet, etc. It has a strategic alliance with Auburn University. The company was founded in 1966 and is headquartered in Eden Prairie, Minnesota.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Scientific & Technical Instruments", "Address": "14000 Technology Drive, Eden Prairie, MN, United States, 55344", "FullTimeEmployees": "3500", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "486153312", "EBITDA": "142402000", "PERatio": "34.9855", "PEGRatio": "2.47", "BookValue": "25.435", "DividendPerShare": "1.2", "DividendYield": "0.0632", "EPS": "0.691", "RevenuePerShareTTM": "43.606", "ProfitMargin": "0.0161", "OperatingMarginTTM": "0.1172", "ReturnOnAssetsTTM": "0.0458", "ReturnOnEquityTTM": "0.0273", "RevenueTTM": "837612992", "GrossProfitTTM": "356356000", "DilutedEPSTTM": "0.691", "QuarterlyEarningsGrowthYOY": "-0.674", "QuarterlyRevenueGrowthYOY": "-0.155", "AnalystTargetPrice": "34.17", "TrailingPE": "34.9855", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.5586", "PriceToBookRatio": "0.9519", "EVToRevenue": "1.1883", "EVToEBITDA": "10.589", "Beta": "1.444", "52WeekHigh": "61.1", "52WeekLow": "13.15", "50DayMovingAverage": "21.1792", "200DayMovingAverage": "22.4288", "SharesOutstanding": "19276500", "SharesFloat": "19036722", "SharesShort": "355542", "SharesShortPriorMonth": "307707", "ShortRatio": "1.51", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.02", "PercentInsiders": "1.329", "PercentInstitutions": "101.621", "ForwardAnnualDividendRate": "1.2", "ForwardAnnualDividendYield": "0.0632", "PayoutRatio": "1.3043", "DividendDate": "2020-03-30", "ExDividendDate": "2020-03-13", "LastSplitFactor": "2:1", "LastSplitDate": "1998-02-03"}