{"Symbol": "MYGN", "AssetType": "Common Stock", "Name": "Myriad Genetics, Inc", "Description": "Myriad Genetics, Inc., a molecular diagnostic company, develops and markets predictive, personalized, and prognostic medicine tests in the United States and internationally. The company offers myRisk Hereditary Cancer, a DNA sequencing test for hereditary cancers; BRACAnalysis, a DNA sequencing test to assess the risk of developing breast and ovarian cancer; and riskScore, a personalized medicine tool. It also provides BRACAnalysis CDx, a DNA sequencing test for use in identifying ovarian and HER2 negative metastatic breast cancer patients with deleterious or suspected deleterious germline; GeneSight, a DNA genotyping test to aid psychotropic drug selection for depressed patients; and Vectra, a protein quantification test for assessing the disease activity of rheumatoid arthritis. In addition, the company offers Foresight, a prenatal test for future parents to assess their risk of passing on a recessive genetic condition to their offspring; Prequel, a non-invasive prenatal screening test to screen for severe chromosomal disorders in a fetus; and Prolaris, a RNA expression test for assessing the aggressiveness of prostate cancer. Further, it provides EndoPredict, a RNA expression test for assessing the aggressiveness of breast cancer; myPath Melanoma, a RNA expression test for diagnosing melanoma; and myChoice CDx, a companion diagnostic to measure three modes of homologous recombination deficiency comprising loss of heterozygosity, telomeric allelic imbalance, and large-scale state transitions in cancer cells. Additionally, the company offers biomarker discovery, and pharmaceutical and clinical services to the pharmaceutical, biotechnology, and medical research industries; and operates an internal medicine emergency hospital primarily for internal medicine and hemodialysis. Myriad Genetics, Inc. was founded in 1991 and is headquartered in Salt Lake City, Utah.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "320 Wakara Way, Salt Lake City, UT, United States, 84108", "FullTimeEmployees": "2700", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1039953408", "EBITDA": "14300000", "PERatio": "563.3333", "PEGRatio": "1.4001", "BookValue": "12.292", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.06", "RevenuePerShareTTM": "8.595", "ProfitMargin": "-0.3124", "OperatingMarginTTM": "-0.2111", "ReturnOnAssetsTTM": "-0.0568", "ReturnOnEquityTTM": "-0.1989", "RevenueTTM": "638600000", "GrossProfitTTM": "452500000", "DilutedEPSTTM": "-2.69", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.567", "AnalystTargetPrice": "15.86", "TrailingPE": "0", "ForwardPE": "17.4216", "PriceToSalesRatioTTM": "1.6207", "PriceToBookRatio": "1.1334", "EVToRevenue": "1.7502", "EVToEBITDA": "27.939", "Beta": "1.2896", "52WeekHigh": "35.29", "52WeekLow": "9.24", "50DayMovingAverage": "12.7067", "200DayMovingAverage": "14.1385", "SharesOutstanding": "74554704", "SharesFloat": "69496097", "SharesShort": "10925515", "SharesShortPriorMonth": "8914021", "ShortRatio": "14.09", "ShortPercentOutstanding": "0.14", "ShortPercentFloat": "0.3016", "PercentInsiders": "1.759", "PercentInstitutions": "107.181", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2009-03-26"}