{"Symbol": "NATI", "AssetType": "Common Stock", "Name": "National Instruments Corporation", "Description": "National Instruments Corporation provides a software-centric platform and systems to engineers and scientists worldwide. Its programming environments software includes NI LabVIEW, a graphical software platform to visualize hardware configuration, measurement data, and debugging of application; NI LabWindows/CVI, an ANSI C integrated development environment and engineering toolbox with built-in libraries for measurement, analysis, and engineering UI design; and NI Measurement Studio, a suite of .NET tools designed for building engineering applications in Microsoft Visual Studio to acquire, analyze, and display measurement data. The company's application software comprises NI TestStand that is used for automated test and measurement applications in a manufacturing environment; NI VeriStand, a ready-to-use software environment for configuring real-time testing applications; Flexlogger for quick sensor configuration and data logging of mixed signals to verify electromechanical systems; and NI InsightCM Enterprise, a software solution with integrated hardware options for monitoring ancillary rotating equipment. Its systems and data management software include NI DIAdem, which is configuration-based technical data management, analysis, and report generation tools to mine and analyze engineering and measurement data; and NI SystemLink, a systems management software that enables the mass coordination of connected devices, software deployments, and data communications throughout a distributed system. The company also offers PXI hardware form factor that combines PC software and PCI hardware with advanced instrumentation capabilities; NI C-series data acquisition and control products; and NI semiconductor test systems, as well as software and hardware maintenance, and training and certification services. It serves semiconductor, transportation, aerospace, and defense industries; and government agencies. The company was founded in 1976 and is headquartered in Austin, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "11500 North MoPac Expressway, Austin, TX, United States, 78759-3504", "FullTimeEmployees": "7300", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4721180672", "EBITDA": "204187008", "PERatio": "18.5104", "PEGRatio": "2.19", "BookValue": "9.66", "DividendPerShare": "1.04", "DividendYield": "0.0293", "EPS": "1.921", "RevenuePerShareTTM": "10.062", "ProfitMargin": "0.1925", "OperatingMarginTTM": "0.1192", "ReturnOnAssetsTTM": "0.0563", "ReturnOnEquityTTM": "0.2077", "RevenueTTM": "1318619008", "GrossProfitTTM": "1016324000", "DilutedEPSTTM": "1.921", "QuarterlyEarningsGrowthYOY": "-0.632", "QuarterlyRevenueGrowthYOY": "-0.098", "AnalystTargetPrice": "40.4", "TrailingPE": "18.5104", "ForwardPE": "0", "PriceToSalesRatioTTM": "3.555", "PriceToBookRatio": "3.6792", "EVToRevenue": "3.1849", "EVToEBITDA": "21.3831", "Beta": "0.9797", "52WeekHigh": "47.89", "52WeekLow": "20.42", "50DayMovingAverage": "36.5006", "200DayMovingAverage": "37.1491", "SharesOutstanding": "131436000", "SharesFloat": "115377244", "SharesShort": "1302175", "SharesShortPriorMonth": "1031222", "ShortRatio": "2.73", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0172", "PercentInsiders": "7.873", "PercentInstitutions": "84.653", "ForwardAnnualDividendRate": "1.04", "ForwardAnnualDividendYield": "0.0293", "PayoutRatio": "0.5313", "DividendDate": "2020-09-08", "ExDividendDate": "2020-08-14", "LastSplitFactor": "3:2", "LastSplitDate": "2011-02-23"}