{"Symbol": "NAVG", "AssetType": "Common Stock", "Name": "The Navigators Group, Inc", "Description": "The Navigators Group, Inc., together with its subsidiaries, underwrites marine, property and casualty, and professional liability insurance products and services in the United States and internationally. The company operates through the U.S. Insurance, International Insurance, and Global Reinsurance segments. It offers marine insurance products comprising cargo, craft, inland marine, and marine liability; fishing vessels, transport, war, hull, and other marine; and protection and indemnity, specie and fine arts, writing banks and cash in transit risks, and energy liability insurance products. The company also provides commercial retail excess casualty and specialty wholesale excess casualty; general liability; contractors pollution liability, site pollution liability, and integrated casualty; auto, life sciences, surety, media, arts and entertainment, and other property and casualty; onshore and offshore energy, and other energy and engineering products that includes power station insurance; and political violence and terrorism insurance products. In addition, it offers directors and officers; architects and engineers, accountants, miscellaneous professional liability, real estate errors and omissions (E&O), and other E&O; and warranties and indemnity insurance products, as well as cyber and run-off insurance products. Further, the company offers accident and health, management liability, specialty casualty, agriculture, and other reinsurance products. The Navigators Group, Inc. distributes its products through international, national, and regional retail and wholesale insurance brokers. The company was founded in 1982 and is headquartered in Stamford, Connecticut. As of May 23, 2019, The Navigators Group, Inc. operates as a subsidiary of The Hartford Financial Services Group, Inc.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "400 Atlantic Street\n06901,Stamford,USA\n", "FullTimeEmployees": "838", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "2096680192", "EBITDA": "None", "PERatio": "1320", "PEGRatio": "5.54", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0.003", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "70", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}