{"Symbol": "NBIX", "AssetType": "Common Stock", "Name": "Neurocrine Biosciences, Inc", "Description": "Neurocrine Biosciences, Inc., a commercial-stage biopharmaceutical company, discovers and develops therapeutics for the treatment of neurological, endocrine, and psychiatric disorders in the United States. The company offers INGREZZA (valbenazine), a vesicular monoamine transporter 2 inhibitor (VMAT2) for the treatment of tardive dyskinesia; and ORILISSA, a gonadotropin-releasing hormone antagonist for use in the treatment of endometriosis. Its product candidates in clinical development include elagolix that has completed Phase III clinical trial for uterine fibroids; opicapone, a catechol-O-methyltransferase inhibitor used as an adjunct therapy to levodopa/DOPA decarboxylase inhibitors for adult patients with Parkinson's disease; and NBI-74788, which is in Phase III clinical trial for the treatment of congenital adrenal hyperplasia. The company's products under development include NBIb-1817, an AADC gene replacement therapy, which is in Phase II clinical trial for the treatment of Parkinson's disease; NBI-921352, a Nav1.6 sodium channel inhibitor for the treatment of pediatric patients with SCN8A-DEE, as well as other indications, such as adult focal epilepsy; ACT-709478, an orally active and brain penetrating T-type calcium channel blocker for use in certain forms of generalized epilepsy; and VMAT2 inhibitor for the treatment of various neurology and/or psychiatry disorders. Neurocrine Biosciences, Inc. has collaborations and agreements with AbbVie Inc.; BIAL ? Portela & Ca, S.A.; Voyager Therapeutics, Inc.; Xenon Pharmaceuticals Inc.; Mitsubishi Tanabe Pharma Corporation; Idorsia Pharmaceuticals Ltd; and Takeda Pharmaceutical Company Limited. The company was founded in 1992 and is headquartered in San Diego, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "12780 El Camino Real, San Diego, CA, United States, 92130", "FullTimeEmployees": "780", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "10660899840", "EBITDA": "364807008", "PERatio": "53.1023", "PEGRatio": "1.87", "BookValue": "8.918", "DividendPerShare": "None", "DividendYield": "0", "EPS": "2.077", "RevenuePerShareTTM": "10.881", "ProfitMargin": "0.2037", "OperatingMarginTTM": "0.3545", "ReturnOnAssetsTTM": "0.1726", "ReturnOnEquityTTM": "0.3115", "RevenueTTM": "1005686976", "GrossProfitTTM": "580617000", "DilutedEPSTTM": "2.077", "QuarterlyEarningsGrowthYOY": "0.5", "QuarterlyRevenueGrowthYOY": "0.648", "AnalystTargetPrice": "140.29", "TrailingPE": "53.1023", "ForwardPE": "60.9756", "PriceToSalesRatioTTM": "11.2312", "PriceToBookRatio": "12.8091", "EVToRevenue": "10.1447", "EVToEBITDA": "39.2314", "Beta": "1.2973", "52WeekHigh": "136.2618", "52WeekLow": "72.14", "50DayMovingAverage": "120.6525", "200DayMovingAverage": "109.2975", "SharesOutstanding": "93254896", "SharesFloat": "92024840", "SharesShort": "4824040", "SharesShortPriorMonth": "4626505", "ShortRatio": "7.32", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0575", "PercentInsiders": "1.043", "PercentInstitutions": "99.052", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "1995-12-29", "LastSplitFactor": "None", "LastSplitDate": "None"}