{"Symbol": "NDSN", "AssetType": "Common Stock", "Name": "Nordson Corporation", "Description": "Nordson Corporation engineers, manufactures, and markets products and systems to dispense, apply, and control adhesives, coatings, polymers, sealants, biomaterials, and other fluids worldwide. Its Adhesive Dispensing Systems segment provides dispensing, coating, and laminating systems for adhesives, lotions, liquids, and fibers to disposable products and roll goods; automated adhesive dispensing systems used in packaged goods industries; components and systems used in the thermoplastic melt stream; and product assembly systems for use in paper and paperboard converting applications, and manufacturing roll goods, as well as for the assembly of plastic, metal, and wood products. The company's Advanced Technology Systems segment offers automated dispensing systems for the attachment, protection, and coating of fluids, as well as related gas plasma treatment systems for cleaning and conditioning surfaces; precision manual and semi-automated dispensers, minimally invasive interventional delivery devices, plastic molded syringes, cartridges, tips, fluid connection components, tubing, balloons, and catheters; and bond testing and automated optical, acoustic microscopy, and x-ray inspection systems for use in semiconductor and printed circuit board industries. Its Industrial Coating Systems segment provides automated and manual dispensing products and systems to apply adhesive and sealant materials; dispensing and curing systems to coat and cure containers; systems to apply liquid paints and coatings to consumer and industrial products; and systems to apply powder paints and coatings to metal, plastic, and wood products, as well as ultraviolet equipment for use in curing and drying operations for specialty coatings, semiconductor materials, and paints. The company markets its products through direct sales force, as well as distributors and sales representatives. Nordson Corporation was founded in 1935 and is headquartered in Westlake, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Specialty Industrial Machinery", "Address": "28601 Clemens Road, Westlake, OH, United States, 44145", "FullTimeEmployees": "7579", "FiscalYearEnd": "October", "LatestQuarter": "2020-07-31", "MarketCapitalization": "10841589760", "EBITDA": "555777984", "PERatio": "33.0629", "PEGRatio": "2.3361", "BookValue": "30.678", "DividendPerShare": "1.56", "DividendYield": "0.0082", "EPS": "5.719", "RevenuePerShareTTM": "37.277", "ProfitMargin": "0.1554", "OperatingMarginTTM": "0.207", "ReturnOnAssetsTTM": "0.076", "ReturnOnEquityTTM": "0.2012", "RevenueTTM": "2148026112", "GrossProfitTTM": "1192103000", "DilutedEPSTTM": "5.719", "QuarterlyEarningsGrowthYOY": "-0.08", "QuarterlyRevenueGrowthYOY": "-0.039", "AnalystTargetPrice": "225.83", "TrailingPE": "33.0629", "ForwardPE": "30.03", "PriceToSalesRatioTTM": "5.1389", "PriceToBookRatio": "6.1633", "EVToRevenue": "5.5639", "EVToEBITDA": "21.7892", "Beta": "1.2099", "52WeekHigh": "208.37", "52WeekLow": "96.455", "50DayMovingAverage": "195.1172", "200DayMovingAverage": "169.9366", "SharesOutstanding": "57680300", "SharesFloat": "52401975", "SharesShort": "815131", "SharesShortPriorMonth": "997971", "ShortRatio": "2.7", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0119", "PercentInsiders": "6.605", "PercentInstitutions": "73.89", "ForwardAnnualDividendRate": "1.56", "ForwardAnnualDividendYield": "0.0082", "PayoutRatio": "0.2657", "DividendDate": "2020-09-08", "ExDividendDate": "2020-08-24", "LastSplitFactor": "2:1", "LastSplitDate": "2011-04-13"}