{"Symbol": "NEO", "AssetType": "Common Stock", "Name": "NeoGenomics, Inc", "Description": "NeoGenomics, Inc. operates a network of cancer-focused testing laboratories in the United States, as well as laboratories in Switzerland and Singapore. It operates in two segments, Clinical Services and Pharma Services. The company's laboratories provide genetic and molecular testing services to hospitals, pathologists, oncologists, urologists, other clinicians and researchers, pharmaceutical firms, academic centers, and other clinical laboratories. It offers cytogenetics testing services to study normal and abnormal chromosomes and their relationship to diseases; fluorescence in-situ hybridization testing services that focus on detecting and locating the presence or absence of specific DNA sequences and genes on chromosomes; flow cytometry testing services to measure the characteristics of cell populations; immunohistochemistry and digital imaging testing services to localize proteins in cells of a tissue section, as well as to allow clients to see and utilize scanned slides, and perform quantitative analysis for various stains; and molecular testing services, which focus on the analysis of DNA and RNA, and the structure and function of genes at the molecular level. The company also provides morphologic analysis which is the process of analyzing cells under the microscope by a pathologist for the purpose of diagnosis; and testing services in support of its pharmaceutical clients' oncology programs covering discovery and commercialization, as well as acts as a reference laboratory supplying anatomic pathology testing services. NeoGenomics, Inc. has a strategic collaboration with Inivata Limited for the commercialization of its InVisionFirst-Lung liquid biopsy test in the United States. NeoGenomics, Inc. was founded in 2001 and is headquartered in Fort Myers, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "12701 Commonwealth Drive, Fort Myers, FL, United States, 33913", "FullTimeEmployees": "1700", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4262084608", "EBITDA": "18294000", "PERatio": "882.75", "PEGRatio": "3.02", "BookValue": "5.926", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.034", "RevenuePerShareTTM": "3.845", "ProfitMargin": "-0.0133", "OperatingMarginTTM": "-0.0337", "ReturnOnAssetsTTM": "-0.0104", "ReturnOnEquityTTM": "-0.0094", "RevenueTTM": "404547008", "GrossProfitTTM": "196836000", "DilutedEPSTTM": "-0.051", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.145", "AnalystTargetPrice": "40.93", "TrailingPE": "882.75", "ForwardPE": "312.5", "PriceToSalesRatioTTM": "10.1028", "PriceToBookRatio": "6.367", "EVToRevenue": "10.1103", "EVToEBITDA": "241.389", "Beta": "0.8242", "52WeekHigh": "41.03", "52WeekLow": "18.52", "50DayMovingAverage": "38.1233", "200DayMovingAverage": "30.9406", "SharesOutstanding": "110431000", "SharesFloat": "106530220", "SharesShort": "5542271", "SharesShortPriorMonth": "4835319", "ShortRatio": "7.48", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.064", "PercentInsiders": "5.885", "PercentInstitutions": "85.085", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:100", "LastSplitDate": "2003-04-16"}