{"Symbol": "NEOG", "AssetType": "Common Stock", "Name": "Neogen Corporation", "Description": "Neogen Corporation, together with its subsidiaries, develops, manufactures, and markets various products for food and animal safety worldwide. It operates through two segments, Food Safety and Animal Safety. The Food Safety segment offers diagnostic test kits and related products to detect dangerous and unintended substances in food and animal feed, including foodborne pathogens, spoilage organisms, natural toxins, food allergens, genetic modifications, ruminant by-products, meat speciation, drug residues, pesticide residues, and general sanitation concerns; and AccuPoint Advanced rapid sanitation test for adenosine triphosphate, a chemical found in living cells. This segment offers its products primarily to food and feed processors; grain producers and processors; producers of cookies, crackers, candy, ice cream, and other processed foods; meat and poultry processors, seafood processors, fruit and vegetable producers, and dairies; laboratories; and producers of pharmaceuticals, cosmetics, veterinary vaccines, and nutraceutical products. The Animal Safety segment provides veterinary instruments, pharmaceuticals, vaccines, topicals, diagnostic products, rodenticides, cleaners, disinfectants, insecticides, and genomics testing services for the animal safety market. This segment offers various products for researchers to detect biologically active substances. Its drug detection immunoassay test kits are used for the detection of abused and therapeutic drugs in farm and racing animals; detection of drug residues in meat and meat products; and human forensic toxicology drug screening applications. In addition, this segment's products are also used to maintain sanitary conditions and limit the potential hazards of bacteria, fungi, and viruses. The company sells its products directly, as well as through distributors and retail chains. Neogen Corporation was founded in 1981 and is headquartered in Lansing, Michigan.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "620 Lesher Place, Lansing, MI, United States, 48912", "FullTimeEmployees": "1764", "FiscalYearEnd": "May", "LatestQuarter": "2020-05-31", "MarketCapitalization": "4019967744", "EBITDA": "85919000", "PERatio": "67.1062", "PEGRatio": "6.2156", "BookValue": "13.697", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.13", "RevenuePerShareTTM": "7.958", "ProfitMargin": "0.1422", "OperatingMarginTTM": "0.1615", "ReturnOnAssetsTTM": "0.0565", "ReturnOnEquityTTM": "0.0873", "RevenueTTM": "418169984", "GrossProfitTTM": "196279000", "DilutedEPSTTM": "1.13", "QuarterlyEarningsGrowthYOY": "0.029", "QuarterlyRevenueGrowthYOY": "-0.006", "AnalystTargetPrice": "81.5", "TrailingPE": "67.1062", "ForwardPE": "62.1118", "PriceToSalesRatioTTM": "9.5855", "PriceToBookRatio": "5.5383", "EVToRevenue": "8.7825", "EVToEBITDA": "42.7448", "Beta": "0.6951", "52WeekHigh": "82.06", "52WeekLow": "48.91", "50DayMovingAverage": "76.9756", "200DayMovingAverage": "69.4249", "SharesOutstanding": "52910800", "SharesFloat": "52704464", "SharesShort": "2711228", "SharesShortPriorMonth": "2514232", "ShortRatio": "13.89", "ShortPercentOutstanding": "0.04", "ShortPercentFloat": "0.07", "PercentInsiders": "0.957", "PercentInstitutions": "97.157", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1333:1000", "LastSplitDate": "2018-01-02"}