{"Symbol": "NETE", "AssetType": "Common Stock", "Name": "Net Element, Inc", "Description": "Net Element, Inc. operates as a financial technology and value-added solutions company in North America, Russia, and the Commonwealth of Independent States. It operates in two segments, North American Transaction Solutions and International Transaction Solutions. The company offers a range of payment acceptance and transaction processing services that enable merchants of various sizes to accept and process approximately 100 payment options, including credit, debit, prepaid, and alternative payments; and value-added services and technologies, such as integrated payment technologies, point-of-sale solutions (POS), fraud management solutions, information solutions, and analytical tools. Its services include Unified Payments that provides integrated payment acceptance solutions, value-added POS, and business process management services; Unified m-POS, a mobile POS application that accepts payments; Aptito POS Platform, an integrated POS platform for the hospitality, retail, service, and on the go industries; Restoactive, a POS restaurant management platform; Zero Pay, a zero-fee payment acceptance program for SMB merchants; transactional services, mobile payment transactions, online payment transactions, and other payment technologies under the PayOnline name; Pay-Travel, an integrated payment processing solutions to the travel industry; and Netevia, a multi-channel payments and merchant management platform that delivers end-to-end payment processing through easy-to-use APIs. Net Element, Inc. offers its services through retail and mobile merchants, as well as online. The company was formerly known as Net Element International, Inc. and changed its name to Net Element, Inc. in December 2013. Net Element, Inc. was founded in 2004 and is based in North Miami Beach, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "3363 NE 163rd Street, North Miami Beach, FL, United States, 33160", "FullTimeEmployees": "82", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "31579398", "EBITDA": "-2655893", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.678", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.283", "RevenuePerShareTTM": "15.147", "ProfitMargin": "-0.0871", "OperatingMarginTTM": "-0.0512", "ReturnOnAssetsTTM": "-0.0898", "ReturnOnEquityTTM": "-1.0634", "RevenueTTM": "63021292", "GrossProfitTTM": "10277901", "DilutedEPSTTM": "-1.32", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.168", "AnalystTargetPrice": "30", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.4509", "PriceToBookRatio": "11.0319", "EVToRevenue": "0.6469", "EVToEBITDA": "0", "Beta": "2.0533", "52WeekHigh": "20.08", "52WeekLow": "1.472", "50DayMovingAverage": "12.1389", "200DayMovingAverage": "5.6741", "SharesOutstanding": "4596710", "SharesFloat": "4060871", "SharesShort": "200068", "SharesShortPriorMonth": "169313", "ShortRatio": "0.08", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0126", "PercentInsiders": "16.33", "PercentInstitutions": "6.616", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:10", "LastSplitDate": "2017-10-05"}