{"Symbol": "NEWT", "AssetType": "Common Stock", "Name": "Newtek Business Services Corp", "Description": "Newtek Business Services Corp. is a business development company specializing in providing financial and business services to the small-and medium-sized business market in the United States. The firm also seeks to invest in early stage businesses. The firm seeks to makes both debt and equity investments. Under debt investments, it focuses on first lien loans, which have terms of 1 to 25 years; second lien loans, which have terms of 5 to 25 years, and unsecured loans, which are provided to meet short-term funding needs and are repaid within 6 to 12 months. It operates through Electronic Payment Processing, Managed Technology Solutions, Small Business Finance, and Capcos segments. The company originates small business administration loans for the purpose of acquiring commercial real estate, machinery, equipment, and inventory, as well as to refinance debt and fund franchises, working capital, and business acquisitions; and offers small business loan servicing and consulting services to the Federal Deposit Insurance Corporation and various other financial institutions, as well as provides management services. Its electronic payment processing services include credit and debit card processing, check approval, ancillary processing equipment and software to merchants, eCommerce, electronic solutions to accept non-cash payments, check conversion, remote deposit capture, ACH processing, and electronic gift and loyalty card programs. The company also provides Website hosting, dedicated server, and cloud hosting services; Web design and development; Internet marketing; data storage and backup and other related services; and ecommerce services, such as payment processing, online shopping cart tools, Website design and Web related services; Accounts Receivable Financing, and The Secure Gateway. In addition, it offers Newtek Advantage, a mobile, real-time operating platform enabling a business to access data on a smartphone, tablet, laptop, or PC for eCommerce, credit/debit transactions, Website statistics, payroll, insurance", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Asset Management", "Address": "4800 T-Rex Avenue, Boca Raton, FL, United States, 33431", "FullTimeEmployees": "109", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "402486496", "EBITDA": "47432000", "PERatio": "8.9856", "PEGRatio": "3.28", "BookValue": "15.664", "DividendPerShare": "2.32", "DividendYield": "0.1241", "EPS": "2.058", "RevenuePerShareTTM": "4.646", "ProfitMargin": "0.443", "OperatingMarginTTM": "0.5003", "ReturnOnAssetsTTM": "0.04", "ReturnOnEquityTTM": "0.134", "RevenueTTM": "93878000", "GrossProfitTTM": "59295000", "DilutedEPSTTM": "2.058", "QuarterlyEarningsGrowthYOY": "1.685", "QuarterlyRevenueGrowthYOY": "2.3", "AnalystTargetPrice": "16.5", "TrailingPE": "8.9856", "ForwardPE": "0", "PriceToSalesRatioTTM": "4.4273", "PriceToBookRatio": "1.2091", "EVToRevenue": "3.5545", "EVToEBITDA": "6.6829", "Beta": "1.3522", "52WeekHigh": "23.99", "52WeekLow": "7.59", "50DayMovingAverage": "18.6197", "200DayMovingAverage": "16.8979", "SharesOutstanding": "21183500", "SharesFloat": "19968440", "SharesShort": "445653", "SharesShortPriorMonth": "388391", "ShortRatio": "2.35", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0204", "PercentInsiders": "6.222", "PercentInstitutions": "18.786", "ForwardAnnualDividendRate": "2.32", "ForwardAnnualDividendYield": "0.1241", "PayoutRatio": "0.8317", "DividendDate": "2020-09-30", "ExDividendDate": "2020-09-18", "LastSplitFactor": "1:5", "LastSplitDate": "2014-10-23"}