{"Symbol": "NGHCP", "AssetType": "Common Stock", "Name": "National General Holdings Corp", "Description": "National General Holdings Corp., a specialty personal lines insurance holding company, provides various insurance products and services in the United States, Bermuda, Luxembourg, and Sweden. The company's Property and Casualty segment offers standard, preferred, and nonstandard automobile insurance products; recreational vehicle (RV) insurance products that carry RV-specific endorsements comprising automatic personal effects coverage, optional replacement cost coverage, RV storage coverage, and full-time liability coverage; and homeowners insurance products consisting of property and liability coverages for one-and two-family, and owner-occupied residences; and additional personal umbrella coverage to the homeowners. It also provides small business automobile insurance products, which covers liability and physical damage caused by light-to-medium duty commercial vehicles; motorcycle insurance products for various types of motorcycles, golf carts, and all-terrain vehicles; and lender-placed insurance products, including fire, home, and flood products, as well as collateral protection insurance and guaranteed asset protection products for automobiles. It sells its products through retail store fronts, web/mobile, phone contact centers, and kiosks; and agents and affinity partners. The company's Accident and Health segment provides accident and non-major medical health insurance products, such as accident/AD&D coverage in the event of bodily injury or death due to accidental means; hospital indemnity; short-term medical plans; cancer/critical illness policies; stop loss programs; medicare supplement insurance policies; basic dental coverage; and life insurance products for individuals. It sells its products through agents, managing general underwriters, employers, Internet; and directly. The company was formerly known as American Capital Acquisition Corporation. National General Holdings Corp. was founded in 1939 and is headquartered in New York, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "InsuranceProperty & Casualty", "Address": "59 Maiden Lane, New York, NY, United States, 10038", "FullTimeEmployees": "9200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2721643264", "EBITDA": "654536000", "PERatio": "7.0957", "PEGRatio": "0", "BookValue": "22.444", "DividendPerShare": "1.88", "DividendYield": "0.0737", "EPS": "3.571", "RevenuePerShareTTM": "46.8", "ProfitMargin": "0.084", "OperatingMarginTTM": "0.1081", "ReturnOnAssetsTTM": "0.0364", "ReturnOnEquityTTM": "0.1618", "RevenueTTM": "5308315136", "GrossProfitTTM": "1471331000", "DilutedEPSTTM": "3.571", "QuarterlyEarningsGrowthYOY": "1.274", "QuarterlyRevenueGrowthYOY": "0.047", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.0797", "52WeekHigh": "26.14", "52WeekLow": "10.46", "50DayMovingAverage": "25.3389", "200DayMovingAverage": "23.3669", "SharesOutstanding": "107133000", "SharesFloat": "60989619", "SharesShort": "764", "SharesShortPriorMonth": "1290", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "4.583", "ForwardAnnualDividendRate": "1.88", "ForwardAnnualDividendYield": "0.0737", "PayoutRatio": "0", "DividendDate": "2020-10-15", "ExDividendDate": "2020-09-30", "LastSplitFactor": "None", "LastSplitDate": "None"}