{"Symbol": "NICE", "AssetType": "Common Stock", "Name": "NICE Ltd", "Description": "NICE Ltd. provides enterprise software solutions worldwide. The company operates in two segments, Customer Engagement, and Financial Crime and Compliance. It offers CXone, a cloud native open platform that supports contact centers ranging from small single sites to distributed remote agents and enterprises; and a digital-first omnichannel customer engagement platform that supports various digital and self-service channels, which allows organizations to add and integrate new and emerging channels. The company also provides AI driven smarter processes and adaptive workforce engagement solutions. In addition, it offers NICE platform, a financial crime and compliance solution that handles various process, including detection, investigation, remediation, and reporting; and X-Sight, a cloud-based financial crime risk management platform-as-a-service. Further, the company provides professional service and support at various stages of the technology lifecycle, including defining requirements, planning, design, implementation, customization, optimization, maintenance, and ongoing support. It serves customers across various verticals, including banking, financial, telecommunications, healthcare, insurance, retail, travel, gaming, public safety, and state and local government. The company sells its solutions and products directly to customers, as well as indirectly through selected partners. NICE Ltd. has a strategic partnership with Information Services Group, Inc. to expand the automation ecosystem. The company was formerly known as NICE-Systems Ltd. and changed its name to NICE Ltd. in June 2016. NICE Ltd. was founded in 1986 and is based in Ra'anana, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "13 Zarchin Street, Ra?anana, Israel, 4310602", "FullTimeEmployees": "5996", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "14239020032", "EBITDA": "427044000", "PERatio": "72.8289", "PEGRatio": "3.4072", "BookValue": "37.919", "DividendPerShare": "None", "DividendYield": "0", "EPS": "3.036", "RevenuePerShareTTM": "25.959", "ProfitMargin": "0.1221", "OperatingMarginTTM": "0.1537", "ReturnOnAssetsTTM": "0.0429", "ReturnOnEquityTTM": "0.0871", "RevenueTTM": "1620078976", "GrossProfitTTM": "1042144000", "DilutedEPSTTM": "3.036", "QuarterlyEarningsGrowthYOY": "0.047", "QuarterlyRevenueGrowthYOY": "0.034", "AnalystTargetPrice": "237.73", "TrailingPE": "72.8289", "ForwardPE": "39.6825", "PriceToSalesRatioTTM": "8.924", "PriceToBookRatio": "5.8393", "EVToRevenue": "8.2558", "EVToEBITDA": "30.3484", "Beta": "0.2534", "52WeekHigh": "238.35", "52WeekLow": "110.59", "50DayMovingAverage": "211.9239", "200DayMovingAverage": "180.1191", "SharesOutstanding": "62732300", "SharesFloat": "62718789", "SharesShort": "1219662", "SharesShortPriorMonth": "1516891", "ShortRatio": "5.06", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0", "PercentInsiders": "0.097", "PercentInstitutions": "53.532", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2017-03-15", "ExDividendDate": "2017-02-23", "LastSplitFactor": "2:1", "LastSplitDate": "2006-05-31"}