{"Symbol": "NKTR", "AssetType": "Common Stock", "Name": "Nektar Therapeutics", "Description": "Nektar Therapeutics, a biopharmaceutical company, researches and develops drug candidates for cancer and auto-immune disease in the United States. The company develops NKTR-181, a novel mu-opioid analgesic drug, which is in Phase III clinical trial for chronic low back pain; ONZEALD, a topoisomerase I inhibitor that is in Phase III clinical trial for advanced metastatic breast cancer in patients with brain metastases; and Bempegaldesleukin, a CD122-preferential interleukin-2 (IL-2) pathway agonist, which is in Phase I is designed to provide rapid activation and proliferation of cancer-killing CD8+ effector T cells and NK cells. It also develops NKTR-358, cytokine Treg stimulant, which is in Phase I to treat autoimmune diseases; NKTR-262, a toll-like receptor agonist that is in Phase I for oncology; and NKTR-255, which is in phase I for immuno-oncology. In addition, the is developing ADYNOVATE and ADYNOVI for hemophilia A; MOVANTIK for opioid-induced constipation in adult patients with chronic non-cancer pain; CIMZIA for crohn's disease, rheumatoid arthritis, and psoriasis/ankylosing spondylitis; and MIRCERA for anemia associated with chronic kidney disease. Further, it is developing Macugen for age-related macular degeneration; Somavert for acromegaly; Neulasta for neutropenia; Dapirolizumab Pegol for systemic lupus erythematosus; PEGPH20 for pancreatic, non-small cell lung cancer, and other tumor types; and longer-acting blood clotting proteins for hemophilia. The company has collaboration agreement with Takeda Pharmaceutical Company Ltd.; AstraZeneca AB; UCB Pharma S.A.; F. Hoffmann-La Roche Ltd; Bausch Health Companies Inc.; Pfizer Inc.; Amgen Inc.; UCB Pharma (Biogen); Halozyme Therapeutics, Inc.; Bristol-Myers Squibb Company; Baxalta Incorporated; and Eli Lilly and Company, as well as with Merck KGaA. Nektar Therapeutics was incorporated in 1990 and is headquartered in San Francisco, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "455 Mission Bay Boulevard South, San Francisco, CA, United States, 94158", "FullTimeEmployees": "723", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3424145920", "EBITDA": "-418699008", "PERatio": "None", "PEGRatio": "3.22", "BookValue": "7.026", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-2.435", "RevenuePerShareTTM": "0.919", "ProfitMargin": "-2.6425", "OperatingMarginTTM": "-2.3048", "ReturnOnAssetsTTM": "-0.1267", "ReturnOnEquityTTM": "-0.3053", "RevenueTTM": "162500000", "GrossProfitTTM": "93243000", "DilutedEPSTTM": "-2.431", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "1.095", "AnalystTargetPrice": "31.36", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "20.8531", "PriceToBookRatio": "2.73", "EVToRevenue": "15.6793", "EVToEBITDA": "0", "Beta": "1.9225", "52WeekHigh": "28.6", "52WeekLow": "13.63", "50DayMovingAverage": "21.7297", "200DayMovingAverage": "20.8119", "SharesOutstanding": "178900000", "SharesFloat": "177150119", "SharesShort": "27355775", "SharesShortPriorMonth": "27699429", "ShortRatio": "34.66", "ShortPercentOutstanding": "0.15", "ShortPercentFloat": "0.2964", "PercentInsiders": "1.174", "PercentInstitutions": "99.491", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "2:1", "LastSplitDate": "2000-08-23"}