{"Symbol": "NRIM", "AssetType": "Common Stock", "Name": "Northrim BanCorp, Inc", "Description": "Northrim BanCorp, Inc. operates as the bank holding company for Northrim Bank that provides commercial banking products and services to businesses and professional individuals in Alaska. It operates in two segments, Community Banking and Home Mortgage Lending. The company offers noninterest-bearing checking accounts and interest-bearing time deposits, checking and savings accounts, money market deposit accounts, certificates of deposit, and courier noncash deposits. It also provides family residential mortgages; commercial loans, such as secured and unsecured loans for working capital and expansion; commercial real estate loans; construction loans for commercial real estate projects, and land development and residential subdivision construction loans; and loans for automobiles, recreational vehicles, boats, and other consumer purchases, as well as home equity and commercial credit lines, and factoring services. In addition, the company offers other services that include consumer online banking, mobile app and mobile deposit, mobile Web and text banking, business online banking, personal finance, online documents, consumer and business debit cards, home equity advantage access cards, and telebanking and automated teller services. Further, it provides personalized checks, overdraft protection for savings accounts, commercial drive-up banking services, automatic transfers and payments, People Pay services, external and wire transfers, bill pay services, direct payroll deposits, electronic tax payments, automated clearing house origination and receipt services, remote deposit capture services, account reconciliation and positive pay services, merchant and cash management programs, annuity products, and long term investment portfolios. As of January 27, 2020, the company operated 16 branches in Anchorage, the Matanuska Valley, Juneau, Fairbanks, Ketchikan, and Sitka. Northrim BanCorp, Inc. was founded in 1990 and is headquartered in Anchorage, Alaska.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "3111 C Street, Anchorage, AK, United States, 99503", "FullTimeEmployees": "431", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "169199088", "EBITDA": "None", "PERatio": "7.4741", "PEGRatio": "0", "BookValue": "32.494", "DividendPerShare": "1.36", "DividendYield": "0.0523", "EPS": "3.493", "RevenuePerShareTTM": "16.763", "ProfitMargin": "0.2116", "OperatingMarginTTM": "0.2633", "ReturnOnAssetsTTM": "0.0129", "ReturnOnEquityTTM": "0.1116", "RevenueTTM": "108925000", "GrossProfitTTM": "102052000", "DilutedEPSTTM": "3.493", "QuarterlyEarningsGrowthYOY": "1.479", "QuarterlyRevenueGrowthYOY": "0.371", "AnalystTargetPrice": "29", "TrailingPE": "7.4741", "ForwardPE": "6.035", "PriceToSalesRatioTTM": "1.5564", "PriceToBookRatio": "0.8005", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.5544", "52WeekHigh": "42.28", "52WeekLow": "17.32", "50DayMovingAverage": "24.2519", "200DayMovingAverage": "25.6186", "SharesOutstanding": "6368050", "SharesFloat": "6242914", "SharesShort": "120882", "SharesShortPriorMonth": "28713", "ShortRatio": "2.71", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0111", "PercentInsiders": "1.816", "PercentInstitutions": "77.77", "ForwardAnnualDividendRate": "1.36", "ForwardAnnualDividendYield": "0.0523", "PayoutRatio": "0.3851", "DividendDate": "2020-06-19", "ExDividendDate": "2020-06-10", "LastSplitFactor": "105:100", "LastSplitDate": "2007-09-19"}