{"Symbol": "NSTG", "AssetType": "Common Stock", "Name": "NanoString Technologies, Inc", "Description": "NanoString Technologies, Inc. provides life science tools for translational research and molecular diagnostic products worldwide. The company offers nCounter Analysis System, an automated, multi-application, digital detection, and counting system. It provides nCounter MAX and FLEX systems that include Prep Station, an automated liquid handling component that processes and prepares samples for data collection; and nCounter Digital Analyzer, which collects data from samples by taking images of the immobilized fluorescent reporters in the sample cartridge and processing the data into output files. The company also offers nCounter SPRINT Profiler, an instrument that provides liquid handling steps and the digital analysis through use of a microfluidic cartridge; and nSolver Analysis Software, a data analysis program that enables researchers to check, normalize, and analyze their data. In addition, it provides custom CodeSets; and pan cancer and 360 gene expression, CAR-T characterization, neuropathology and neuro-inflammation gene expression, autoimmune disease gene expression, miRNA expression, human organ transplant, human and mouse metabolic pathway, and human and mouse fibrosis panels. Further, the company offers nCounter based reagents that allow users to design customized assays; Master Kits, such as ancillary reagents and plasticware to setup and process samples in the nCounter Prep Station and nCounter Digital Analyzer; and Prosigna molecular diagnostic test kits. The company is also developing GeoMx DSP system to enable the field of spatial genomics; and Hyb & Seq molecular profiling system to determine and analyze gene sequences within biological samples. It has collaboration with Celgene Corporation; Merck & Co., Inc.; Medivation, Inc.; and Astellas Pharma, Inc. NanoString Technologies, Inc. was founded in 2003 and is headquartered in Seattle, Washington.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "530 Fairview Avenue North, Seattle, WA, United States, 98109", "FullTimeEmployees": "551", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1537673216", "EBITDA": "-67522000", "PERatio": "None", "PEGRatio": "0", "BookValue": "3.023", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-2.504", "RevenuePerShareTTM": "3.19", "ProfitMargin": "-0.5526", "OperatingMarginTTM": "-0.8122", "ReturnOnAssetsTTM": "-0.2046", "ReturnOnEquityTTM": "-0.643", "RevenueTTM": "116744000", "GrossProfitTTM": "81529000", "DilutedEPSTTM": "-1.763", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.255", "AnalystTargetPrice": "38.4", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "12.7071", "PriceToBookRatio": "13.4273", "EVToRevenue": "12.7712", "EVToEBITDA": "0", "Beta": "1.3473", "52WeekHigh": "42.26", "52WeekLow": "13.85", "50DayMovingAverage": "37.1533", "200DayMovingAverage": "31.7344", "SharesOutstanding": "37986000", "SharesFloat": "37706842", "SharesShort": "2924940", "SharesShortPriorMonth": "2982146", "ShortRatio": "9.52", "ShortPercentOutstanding": "0.09", "ShortPercentFloat": "0.1095", "PercentInsiders": "0.864", "PercentInstitutions": "112.354", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}