{"Symbol": "NTCT", "AssetType": "Common Stock", "Name": "NetScout Systems, Inc", "Description": "NetScout Systems, Inc. provides service assurance, security, and business analytics for digital business services against disruptions in availability, performance, and security. The company offers nGeniusONE management software that enables customers to predict, preempt, and resolve network and service delivery problems, as well as facilitate the optimization and capacity planning of their network infrastructures; and specialized platforms and analytic modules that enable its customers to analyze and troubleshoot traffic in radio access and Wi-Fi networks. It also provides nGeniusPULSE, an active testing tool that enables enterprises to identify infrastructure performance issues and determine application availability, reliability, and performance; and nGenius Business Analytics solution, which enables service providers to analyze their network traffic. In addition, the company offers ISNG, an advanced passive network probe; packet flow systems that deliver targeted network traffic access to various monitoring and security tools and systems; and a suite of test access points that enable non-disruptive access to network traffic. Further, it provides security solutions that enable service providers and enterprises to protect their networks against distributed denial of service attacks under the Arbor brand; and threat detection solutions to identify and investigate potential advanced network threats. The company serves enterprise customers in industries, including financial services, technology, manufacturing, healthcare, utilities, education, transportation, and retail; mobile operators, wireline operators, cable operators, Internet service providers, and cloud providers; and governmental agencies through a direct sales force, and indirect reseller and distribution channels. It has operations in the United States, Asia, Europe, and internationally. The company was founded in 1984 and is headquartered in Westford, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareInfrastructure", "Address": "310 Littleton Road, Westford, MA, United States, 01886", "FullTimeEmployees": "2502", "FiscalYearEnd": "March", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1693278080", "EBITDA": "142520992", "PERatio": "233.2", "PEGRatio": "1.57", "BookValue": "26.635", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.122", "RevenuePerShareTTM": "12.036", "ProfitMargin": "0.0103", "OperatingMarginTTM": "0.034", "ReturnOnAssetsTTM": "0.006", "ReturnOnEquityTTM": "0.0047", "RevenueTTM": "889611008", "GrossProfitTTM": "649628000", "DilutedEPSTTM": "0.122", "QuarterlyEarningsGrowthYOY": "-0.623", "QuarterlyRevenueGrowthYOY": "-0.012", "AnalystTargetPrice": "27.3", "TrailingPE": "233.2", "ForwardPE": "13.1062", "PriceToSalesRatioTTM": "1.9375", "PriceToBookRatio": "0.8756", "EVToRevenue": "2.0161", "EVToEBITDA": "12.6672", "Beta": "1.0462", "52WeekHigh": "29.62", "52WeekLow": "19.11", "50DayMovingAverage": "25.085", "200DayMovingAverage": "25.448", "SharesOutstanding": "72455200", "SharesFloat": "68949064", "SharesShort": "4023120", "SharesShortPriorMonth": "4063831", "ShortRatio": "9.36", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.061", "PercentInsiders": "4.101", "PercentInstitutions": "102.981", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}