{"Symbol": "NTRS", "AssetType": "Common Stock", "Name": "Northern Trust Corporation", "Description": "Northern Trust Corporation, a financial holding company, provides wealth management, asset servicing, asset management, and banking solutions for corporations, institutions, families, and individuals worldwide. It operates in two segments, Corporate & Institutional Services (C&IS) and Wealth Management. The C&IS segment offers asset servicing and related services, including custody, fund administration, investment operations outsourcing, investment management, investment risk and analytical services, employee benefit services, securities lending, foreign exchange, treasury management, brokerage services, transition management services, banking, and cash management services. This segment serves corporate and public retirement funds, foundations, endowments, fund managers, insurance companies, sovereign wealth funds, and other institutional investors. The Wealth Management segment offers trust, investment management, custody, and philanthropic; financial consulting; guardianship and estate administration; family business consulting; family financial education; brokerage services; and private and business banking services. This segment serves high-net-worth individuals and families, business owners, executives, professionals, retirees, and established privately-held businesses. The company also provides asset management services, such as active and passive equity; active and passive fixed income; cash management; alternative asset classes comprising private equity and hedge funds of funds; and multi-manager advisory services and products through separately managed accounts, bank common and collective funds, registered investment companies, exchange traded funds, non-U.S. collective investment funds, and unregistered private investment funds. In addition, it offers overlay and other risk management services. The company was founded in 1889 and is headquartered in Chicago, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Asset Management", "Address": "50 South La Salle Street, Chicago, IL, United States, 60603", "FullTimeEmployees": "20200", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "17461084160", "EBITDA": "None", "PERatio": "13.1277", "PEGRatio": "2.9883", "BookValue": "50.445", "DividendPerShare": "2.8", "DividendYield": "0.0332", "EPS": "6.426", "RevenuePerShareTTM": "28.835", "ProfitMargin": "0.2359", "OperatingMarginTTM": "0.3051", "ReturnOnAssetsTTM": "0.0103", "ReturnOnEquityTTM": "0.1289", "RevenueTTM": "6060400128", "GrossProfitTTM": "6087600000", "DilutedEPSTTM": "6.426", "QuarterlyEarningsGrowthYOY": "-0.163", "QuarterlyRevenueGrowthYOY": "-0.048", "AnalystTargetPrice": "84.87", "TrailingPE": "13.1277", "ForwardPE": "15.2439", "PriceToSalesRatioTTM": "3.2881", "PriceToBookRatio": "1.6707", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.0665", "52WeekHigh": "110.48", "52WeekLow": "60.67", "50DayMovingAverage": "80.7783", "200DayMovingAverage": "80.3393", "SharesOutstanding": "208092992", "SharesFloat": "205031587", "SharesShort": "5887241", "SharesShortPriorMonth": "5737025", "ShortRatio": "3.97", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0232", "PercentInsiders": "0.628", "PercentInstitutions": "86.082", "ForwardAnnualDividendRate": "2.8", "ForwardAnnualDividendYield": "0.0332", "PayoutRatio": "0.4361", "DividendDate": "2020-10-01", "ExDividendDate": "2020-09-10", "LastSplitFactor": "2:1", "LastSplitDate": "1999-12-10"}