{"Symbol": "NTWK", "AssetType": "Common Stock", "Name": "NetSol Technologies, Inc", "Description": "NetSol Technologies, Inc. designs, develops, markets, and exports software products to the automobile financing and leasing, banking, and financial services industries worldwide. It also provides system integration, consulting, and IT products and services. The company offers NetSol Financial Suite (NFS), an end-to-end solution covering leasing and finance cycle for the asset finance industry; and NFS Ascent platform, a lease accounting and contract processing engine. Its NFS includes Point of Sale, a front office processing system for the financial sector; Credit Application Processing System that handles incoming credit applications from dealers, agents, brokers, and the direct sales force; Contract Management System that enables users to manage and maintain a contract; Wholesale Finance System (WFS) to automate and manage the floor plan/bailment activities; and Dealer Auditor Access System, a Web-based solution used with WFS. The company's NFS Ascent comprises LeasePak, which handles various aspects of the lease or loan lifecycle; and LeasePak software-as-a-service to small and mid-sized leasing and finance companies. In addition, it offers LeaseSoft, a full lifecycle lease and finance system for funder market; and LoanSoft for consumer loan market. Further, the company provides NFS Digital that enables a sales force for the finance and leasing company to access channels, such as point of sale, field investigation, and auditing. Its NFS Digital includes mAccount, a self-service mobile solution; mPOS application, a Web and mobile enabled platform; mDealer, a mobile platform; mAuditor, which schedules visits, records audit exceptions, and tracks assets; and Mobile Field Investigator that permits applicants for detail verification. The company was founded in 1997 and is headquartered in Calabasas, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "23975 Park Sorrento, Calabasas, CA, United States, 91302", "FullTimeEmployees": "1360", "FiscalYearEnd": "June", "LatestQuarter": "2020-03-31", "MarketCapitalization": "35153004", "EBITDA": "4735771", "PERatio": "10.8214", "PEGRatio": "0.3276", "BookValue": "4.879", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.278", "RevenuePerShareTTM": "5.136", "ProfitMargin": "0.0542", "OperatingMarginTTM": "0.0141", "ReturnOnAssetsTTM": "0.006", "ReturnOnEquityTTM": "0.0657", "RevenueTTM": "60086228", "GrossProfitTTM": "37971508", "DilutedEPSTTM": "0.278", "QuarterlyEarningsGrowthYOY": "-0.217", "QuarterlyRevenueGrowthYOY": "-0.21", "AnalystTargetPrice": "8", "TrailingPE": "10.8214", "ForwardPE": "8.19", "PriceToSalesRatioTTM": "0.59", "PriceToBookRatio": "0.6341", "EVToRevenue": "0.5428", "EVToEBITDA": "3.2778", "Beta": "0.6247", "52WeekHigh": "5.85", "52WeekLow": "2", "50DayMovingAverage": "3.0075", "200DayMovingAverage": "2.9081", "SharesOutstanding": "12038700", "SharesFloat": "8418323", "SharesShort": "50600", "SharesShortPriorMonth": "46626", "ShortRatio": "0.43", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0029", "PercentInsiders": "14.442", "PercentInstitutions": "31.232", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:10", "LastSplitDate": "2012-08-13"}