{"Symbol": "NUAN", "AssetType": "Common Stock", "Name": "Nuance Communications, Inc", "Description": "Nuance Communications, Inc. provides conversational artificial intelligence (AI) innovations that bring intelligence to everyday work and life. The company delivers solutions that understand, analyze, and respond to people - amplifying human intelligence to increase productivity and security. It offers customers high accuracy in automated speech recognition, natural language understanding capabilities, dialog and information management, biometric speaker authentication, text-to-speech, and domain knowledge along with professional services and implementation support. Its Healthcare segment provides clinical speech and clinical language understanding solutions that improve the clinical documentation process, from capturing the complete patient record to improving clinical documentation and quality measures for reimbursement. The company's Enterprise segment primarily engages in using speech, natural language understanding, and artificial intelligence to provide automated customer solutions and services for voice, mobile, Web, and messaging channels. Its Other segment provides voicemail transcription services to mobile operators. The company serves organizations across healthcare, financial services, telecommunications, government, and retail. Nuance Communications, Inc. markets and sells its solutions and technologies directly through sales force, as well as through a network of resellers, including system integrators, independent software vendors, value-added resellers, distributors, hardware vendors, telecommunications carriers, and e-commerce Website worldwide. Nuance Communications, Inc. has a strategic partnership with Mila to collaborate on research and advance work in machine learning. The company was formerly known as ScanSoft, Inc. and changed its name to Nuance Communications, Inc. in October 2005. Nuance Communications, Inc. was founded in 1992 and is headquartered in Burlington, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "1 Wayside Road, Burlington, MA, United States, 01803", "FullTimeEmployees": "8100", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "8375930368", "EBITDA": "375876000", "PERatio": "47.8387", "PEGRatio": "7.415", "BookValue": "4.088", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.519", "RevenuePerShareTTM": "6.38", "ProfitMargin": "0.0845", "OperatingMarginTTM": "0.1278", "ReturnOnAssetsTTM": "0.0332", "ReturnOnEquityTTM": "0.1134", "RevenueTTM": "1815363968", "GrossProfitTTM": "1080006000", "DilutedEPSTTM": "0.519", "QuarterlyEarningsGrowthYOY": "0.975", "QuarterlyRevenueGrowthYOY": "-0.103", "AnalystTargetPrice": "32.43", "TrailingPE": "47.8387", "ForwardPE": "37.037", "PriceToSalesRatioTTM": "4.7773", "PriceToBookRatio": "7.2789", "EVToRevenue": "5.3542", "EVToEBITDA": "33.2965", "Beta": "1.028", "52WeekHigh": "30.28", "52WeekLow": "13.51", "50DayMovingAverage": "27.83", "200DayMovingAverage": "22.548", "SharesOutstanding": "282303008", "SharesFloat": "265243425", "SharesShort": "17844419", "SharesShortPriorMonth": "12761649", "ShortRatio": "5.29", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0631", "PercentInsiders": "0.711", "PercentInstitutions": "96.612", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1155:1000", "LastSplitDate": "2019-10-02"}