{"Symbol": "NUVA", "AssetType": "Common Stock", "Name": "NuVasive, Inc", "Description": "NuVasive, Inc., a medical device company, develops and markets minimally disruptive surgical products and procedurally integrated solutions for spine surgery. Its products focus on applications for spine fusion surgery, including ancillary products and services used to aid in the surgical procedure. The company's principal products include Maximum Access Surgery, a minimally disruptive surgical platform, which includes its software-driven nerve detection and avoidance systems, and intraoperative monitoring (IOM) services and support; MaXcess, an integrated split-blade retractor system; and various specialized implants and biologics. Its spine surgery product line offerings comprises products for the thoracolumbar and the cervical spine, which are primarily used to enable surgeons to access the spine to perform restorative and fusion procedures in a minimally disruptive fashion. The company's biologics products include Osteocel Plus and Pro, a cellular bone matrix; Formagraft, a collagen-based synthetic bone substitute; AttraX, a synthetic bone graft material; and Propel DBM, a moldable demineralized bone matrix putty and gel. Its IOM services are used for onsite and remote monitoring of the neurological systems of patients undergoing spinal and brain-related surgeries. The company also provides implants used for interbody disc height restoration; and fixation products, including pedicle screws, rods, and plates. In addition, it offers Integrated Global Alignment platform for assessing, preserving, and restoring spinal alignment; MAGEC-early onset scoliosis, a spinal bracing and distraction system; and Precice, a limb lengthening system. The company sells its products to patients, surgeons, hospitals, and insurers through independent sales agents, directly-employed sales personnel, and distributors in the United States and internationally. NuVasive, Inc. was founded in 1997 and is headquartered in San Diego, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Devices", "Address": "7475 Lusk Boulevard, San Diego, CA, United States, 92121", "FullTimeEmployees": "2800", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "2700504576", "EBITDA": "184384000", "PERatio": "49.687", "PEGRatio": "1.85", "BookValue": "17.461", "DividendPerShare": "None", "DividendYield": "0", "EPS": "1.147", "RevenuePerShareTTM": "20.55", "ProfitMargin": "-0.0036", "OperatingMarginTTM": "0.0532", "ReturnOnAssetsTTM": "0.0159", "ReturnOnEquityTTM": "-0.0044", "RevenueTTM": "1064681984", "GrossProfitTTM": "855713000", "DilutedEPSTTM": "-0.074", "QuarterlyEarningsGrowthYOY": "-0.444", "QuarterlyRevenueGrowthYOY": "-0.303", "AnalystTargetPrice": "65.88", "TrailingPE": "49.687", "ForwardPE": "60.6061", "PriceToSalesRatioTTM": "2.611", "PriceToBookRatio": "3.0217", "EVToRevenue": "3.0812", "EVToEBITDA": "18.2869", "Beta": "1.3505", "52WeekHigh": "81.91", "52WeekLow": "28.55", "50DayMovingAverage": "55.2629", "200DayMovingAverage": "57.0747", "SharesOutstanding": "51252700", "SharesFloat": "50845761", "SharesShort": "6830423", "SharesShortPriorMonth": "6577631", "ShortRatio": "6.85", "ShortPercentOutstanding": "0.12", "ShortPercentFloat": "0.1908", "PercentInsiders": "0.721", "PercentInstitutions": "106.826", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}