{"Symbol": "NXST", "AssetType": "Common Stock", "Name": "Nexstar Media Group, Inc", "Description": "Nexstar Media Group, Inc. operates as a television broadcasting and digital media company in the United States. The company focuses on the acquisition, development, and operation of television stations and interactive community websites in small and medium-sized markets. It offers free over-the-air programming to television viewing audiences. As of December 31, 2019, the company provided sales, programming, and other services through various local service agreements to 36 power television stations owned by independent third parties; and owned, operated, programmed, or provided sales and other services to 197 television stations in 115 markets in the states of Alabama, Arkansas, California, Colorado, Connecticut, District of Columbia, Florida, Georgia, Hawaii, Illinois, Indiana, Iowa, Kansas, Louisiana, Maryland, Massachusetts, Michigan, Mississippi, Missouri, Montana, Nevada, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, and Wisconsin. It also offers digital publishing and content management platform, digital video advertising platform, social media advertising platform, and other digital media solutions to media publishers and advertisers, as well as owns WGN America, a national general entertainment cable network. The company affiliates of ABC, NBC, FOX, CBS, The CW, MNTV and other broadcast television networks. The company was formerly known as Nexstar Broadcasting Group, Inc. and changed its name to Nexstar Media Group, Inc. in January 2017. Nexstar Media Group, Inc. was founded in 1996 and is headquartered in Irving, Texas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Communication Services", "Industry": "Broadcasting", "Address": "545 East John Carpenter Freeway, Irving, TX, United States, 75062", "FullTimeEmployees": "13589", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "4475399680", "EBITDA": "1327889024", "PERatio": "12.453", "PEGRatio": "0.777", "BookValue": "48.145", "DividendPerShare": "2.24", "DividendYield": "0.0235", "EPS": "7.636", "RevenuePerShareTTM": "82.392", "ProfitMargin": "0.0965", "OperatingMarginTTM": "0.2444", "ReturnOnAssetsTTM": "0.056", "ReturnOnEquityTTM": "0.1752", "RevenueTTM": "3770119936", "GrossProfitTTM": "1706092000", "DilutedEPSTTM": "7.636", "QuarterlyEarningsGrowthYOY": "0.5", "QuarterlyRevenueGrowthYOY": "0.409", "AnalystTargetPrice": "117.89", "TrailingPE": "12.453", "ForwardPE": "10.582", "PriceToSalesRatioTTM": "1.1578", "PriceToBookRatio": "1.9814", "EVToRevenue": "3.1016", "EVToEBITDA": "7.9022", "Beta": "1.8495", "52WeekHigh": "133.25", "52WeekLow": "43.37", "50DayMovingAverage": "88.1869", "200DayMovingAverage": "83.0159", "SharesOutstanding": "45288400", "SharesFloat": "43612720", "SharesShort": "3118116", "SharesShortPriorMonth": "3190055", "ShortRatio": "10.17", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.0758", "PercentInsiders": "3.478", "PercentInstitutions": "111.777", "ForwardAnnualDividendRate": "2.24", "ForwardAnnualDividendYield": "0.0235", "PayoutRatio": "0.2637", "DividendDate": "2020-08-21", "ExDividendDate": "2020-08-06", "LastSplitFactor": "None", "LastSplitDate": "None"}