{"Symbol": "NXTM", "AssetType": "Common Stock", "Name": "NxStage Medical, Inc", "Description": "NxStage Medical, Inc., a medical technology company, develops, manufactures, and markets products and services for patients suffering from chronic or acute kidney failure. Its primary product includes the System One, a portable hemodialysis system, which is used primarily for home hemodialysis and a range of dialysis therapies to deliver in the home setting. The company operates through three segments: System One, In-Center, and Services. The System One segment sells and rents the NxStage System One and PureFlow SL dialysate preparation equipment, as well as sells disposable products in the home and critical care market for the treatment of end-stage renal disease (ESRD) patients in the home or a home-like setting and in the critical care market for the treatment of hospital-based patients with acute kidney failure or fluid overload. The In-Center segment sells blood tubing sets and needles for hemodialysis primarily for the treatment of ESRD patients at dialysis centers, and needles for apheresis. The Services segment offers dialysis services to patients at NxStage Kidney Care dialysis centers. As of February 3, 2018, it had 21 centers. NxStage Medical, Inc. markets its products through direct sales to dialysis clinics and hospitals in the United States, the United Kingdom, and Canada, as well as through distributors in Europe and internationally. The company was formerly known as QB Medical, Inc. and changed its name to NxStage Medical, Inc. NxStage Medical, Inc. was founded in 1998 and is headquartered in Lawrence, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "350 Merrimack Street\n01843,Lawrence,USA\n", "FullTimeEmployees": "3800", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "-27.67", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "30", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}