{"Symbol": "OBCI", "AssetType": "Common Stock", "Name": "Ocean Bio-Chem, Inc", "Description": "Ocean Bio-Chem, Inc. manufactures, markets, and distributes appearance, performance, and maintenance products for the marine, automotive, power sports, recreational vehicle, home care, and outdoor power equipment markets in the United States and Canada. The company offers marine products, including polishes, cleaners, protectants, waxes, enzyme fuel treatments, private label products, motor and teak oils, boat washes, vinyl and teak cleaners, bilge and hull cleaners, silicone and polyurethane sealants, polysulfide sealants, gasket materials, lubricants, antifouling additives, and anti-freeze coolants; and brushes, brush handles, tie-downs, and other related accessories. It also manufactures automotive products, such as fuel treatments for gas and diesel engines, motor oils, greases, and related items; anti-freeze and windshield washes; and automotive polishes, cleaners, and other items. In addition, the company offers fuel treatment and other specialty products to the recreational vehicle market; solutions to various problems associated with E-10 fuel; and other specialty recreational vehicle/power sports products, including cleaners, polishes, detergents, fabric cleaners and protectors, silicone sealants, waterproofers, gasket materials, degreasers, vinyl cleaners and protectors, toilet treatment fluids, and anti-freeze/coolants. Further, it provides solutions to rectify operating engine problems in commercial lawn, and other home and garden power equipment; deodorizers, disinfectants, and sanitizers, as well as mildew odor control bags and boat odor sanitizers; blends and packages chemical formulations; and manufactures PVC and HDPE blow molded bottles. The company sells its products under the Star Tron, Performacide, and Star brite brands through retailers and online retailers, as well as to distributors. Ocean Bio-Chem, Inc. was founded in 1973 and is headquartered in Fort Lauderdale, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Conglomerates", "Address": "4041 SW 47th Avenue, Fort Lauderdale, FL, United States, 33314", "FullTimeEmployees": "149", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "146662544", "EBITDA": "8719753", "PERatio": "24.4194", "PEGRatio": "0", "BookValue": "3.644", "DividendPerShare": "0.02", "DividendYield": "0.0013", "EPS": "0.62", "RevenuePerShareTTM": "4.85", "ProfitMargin": "0.1279", "OperatingMarginTTM": "0.1623", "ReturnOnAssetsTTM": "0.1129", "ReturnOnEquityTTM": "0.1852", "RevenueTTM": "45754800", "GrossProfitTTM": "15600060", "DilutedEPSTTM": "0.62", "QuarterlyEarningsGrowthYOY": "2.34", "QuarterlyRevenueGrowthYOY": "0.435", "AnalystTargetPrice": "None", "TrailingPE": "24.4194", "ForwardPE": "0", "PriceToSalesRatioTTM": "3.1238", "PriceToBookRatio": "4.1552", "EVToRevenue": "3.1334", "EVToEBITDA": "16.1713", "Beta": "0.9929", "52WeekHigh": "22.55", "52WeekLow": "3.1", "50DayMovingAverage": "16.0775", "200DayMovingAverage": "8.7167", "SharesOutstanding": "9462100", "SharesFloat": "2896634", "SharesShort": "179776", "SharesShortPriorMonth": "151187", "ShortRatio": "1.85", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0578", "PercentInsiders": "61.666", "PercentInstitutions": "3.862", "ForwardAnnualDividendRate": "0.02", "ForwardAnnualDividendYield": "0.0013", "PayoutRatio": "0.0323", "DividendDate": "2020-06-23", "ExDividendDate": "2020-06-08", "LastSplitFactor": "11:10", "LastSplitDate": "2002-09-25"}