{"Symbol": "OCC", "AssetType": "Common Stock", "Name": "Optical Cable Corporation", "Description": "Optical Cable Corporation, together with its subsidiaries, manufactures and sells fiber optic and copper data communications cabling and connectivity solutions primarily for the enterprise market in the United States and internationally. The company provides fiber optic cables for high bandwidth transmission of data, video, and voice communications; and copper datacom cables, including unshielded and shielded twisted pair constructions. It also offers fiber optic connectivity products, including fiber optic wall mounts, cabinet mount and rack mount enclosures, pre-terminated fiber optic enclosures, fiber optic connectors, splice trays, fiber optic jumpers, plug and play cassette modules, pre-terminated fiber optic cable assemblies, adapters, and accessories. In addition, the company provides copper connectivity products comprising category compliant patch panels, jacks, plugs, patch cords, faceplates, surface mounted boxes, distribution and multi-media boxes, copper rack mount and wall mount enclosures, cable assemblies, cable organizers, and other wiring products for equipment rooms, telecommunications closets, data centers, and workstation applications. Further, it offers network, data storage, and telecommunications management systems, such as data cabinets, wall mount enclosures, horizontal and vertical cable management systems, and open frame relay racks for enterprise and residential use; and datacom wiring products, such as various enclosures, modules, and modular outlets for single dwelling and multiple dwelling residential uses. Additionally, the company provides specialty fiber optic connectors and connectivity components, copper datacom connectors, and related systems and solutions for military, other harsh environment, and special applications. It sells its products to distributors, original equipment manufacturers, value-added resellers, and end-users. Optical Cable Corporation was founded in 1983 and is headquartered in Roanoke, Virginia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "Communication Equipment", "Address": "5290 Concourse Drive, Roanoke, VA, United States, 24019", "FullTimeEmployees": "366", "FiscalYearEnd": "October", "LatestQuarter": "2020-04-30", "MarketCapitalization": "18849876", "EBITDA": "-3008712", "PERatio": "None", "PEGRatio": "0", "BookValue": "2.283", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.717", "RevenuePerShareTTM": "8.635", "ProfitMargin": "-0.0951", "OperatingMarginTTM": "-0.0864", "ReturnOnAssetsTTM": "-0.0802", "ReturnOnEquityTTM": "-0.3017", "RevenueTTM": "63367428", "GrossProfitTTM": "18304747", "DilutedEPSTTM": "-0.821", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.216", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.286", "PriceToBookRatio": "1.0943", "EVToRevenue": "0.4833", "EVToEBITDA": "0", "Beta": "0.8236", "52WeekHigh": "3.67", "52WeekLow": "2.05", "50DayMovingAverage": "2.4894", "200DayMovingAverage": "2.594", "SharesOutstanding": "7539950", "SharesFloat": "4822553", "SharesShort": "3733", "SharesShortPriorMonth": "11462", "ShortRatio": "2.19", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.0039", "PercentInsiders": "35.642", "PercentInstitutions": "13.323", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2015-11-20", "ExDividendDate": "2015-10-28", "LastSplitFactor": "1:8", "LastSplitDate": "2002-07-31"}