{"Symbol": "OCUL", "AssetType": "Common Stock", "Name": "Ocular Therapeutix, Inc", "Description": "Ocular Therapeutix, Inc., a biopharmaceutical company, focuses on the formulation, development, and commercialization of therapies for diseases and conditions of the eye using its bioresorbable hydrogel platform technology. The company markets ReSure Sealant, a hydrogel ophthalmic wound sealant to seal corneal incisions following cataract surgery. Its lead product candidate is DEXTENZA (dexamethasone ophthalmic insert), which has completed two Phase III clinical trials for the treatment of post-surgical ocular pain and inflammation, and allergic conjunctivitis; and DEXTENZA, which is in Phase III clinical trials for the treatment of dry eye diseases. The company also develops OTX-TP (intracanalicular travoprost insert), which is in Phase III clinical trials for the reduction of intraocular pressure (IOP) in patients with glaucoma and ocular hypertension; OTX-TIC, an intracameral travoprost implant, which is in Phase I clinical trials for the reduction of IOP in patients with moderate to severe glaucoma and ocular hypertension; OTX-TKI, an intravitreal tyrosine kinase inhibitor implant, which is in Phase I clinical trials for the treatment of wet age-related macular degeneration(AMD). Its various preclinical programs include OTX- BPI for the treatment of acute ocular pain; OTX-BDI to treat post-operative Pain, and inflammation and bacterial infection; OTX-CSI to treat dry-eye disease; and OTX-IVT, an intravitreal aflibercept implant for the treatment of wet AMD and other back-of-the-eye diseases. The company has strategic collaboration with Regeneron Pharmaceuticals, Inc. (Regeneron) for the development and commercialization of products using the Company's sustained-release hydrogel in combination with Regeneron's large molecule VEGF-targeting compounds for the treatment of retinal diseases. Ocular Therapeutix, Inc. was founded in 2006 and is headquartered in Bedford, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "24 Crosby Drive, Bedford, MA, United States, 01730", "FullTimeEmployees": "161", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "550882496", "EBITDA": "-71014000", "PERatio": "None", "PEGRatio": "0", "BookValue": "0.085", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-1.79", "RevenuePerShareTTM": "0.142", "ProfitMargin": "0", "OperatingMarginTTM": "-10.883", "ReturnOnAssetsTTM": "-0.5015", "ReturnOnEquityTTM": "-15.1265", "RevenueTTM": "7263000", "GrossProfitTTM": "-39189000", "DilutedEPSTTM": "-2.005", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "1.414", "AnalystTargetPrice": "11.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "81.4768", "PriceToBookRatio": "110.742", "EVToRevenue": "78.2698", "EVToEBITDA": "0", "Beta": "1.544", "52WeekHigh": "9.99", "52WeekLow": "2.46", "50DayMovingAverage": "8.3994", "200DayMovingAverage": "6.7774", "SharesOutstanding": "62958000", "SharesFloat": "54205580", "SharesShort": "5881397", "SharesShortPriorMonth": "5621396", "ShortRatio": "8.74", "ShortPercentOutstanding": "0.09", "ShortPercentFloat": "0.1023", "PercentInsiders": "9.89", "PercentInstitutions": "50.828", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}