{"Symbol": "OHAI", "AssetType": "Common Stock", "Name": "OHA Investment Corporation", "Description": "OHA Investment Corporation is a business development company specializing in investments in small and mid size and middle market private companies. The fund typically invests in acquisitions, buyouts, growth, development, expansion, monetizations, revitalization, restructuring, recapitalizations, and special situations. It seeks to invest in energy, natural resources, niche manufacturing, value added distribution, business services, healthcare products and services, consumer services, etc. Within energy, the fund focuses on oil and gas production and development including limited exploration or technology risk; midstream including pipelines, storage, gathering and processing systems; coal mining, production, and services; and oilfield manufacturing. It seeks to invest in companies based in the United States. The fund primarily invests between $5 million and $100 million in its portfolio companies. It invests in the form of unitranche (combined senior and subordinated debt), secured, senior, and subordinate debt; convertible debt; preferred equity; project equity; loans; securities of foreign companies; production payments, net profits interests, and similar investments; and senior secured and mezzanine loans and may receive equity investments in portfolio companies in connection with such investments. The fund makes asset and project based investments in private companies and can also invest in public companies. It seeks to make exit by allowing the portfolio company to refinance the facility often with senior debt or by the sale of the portfolio company's assets or the entire company.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "1114 Avenue of the Americas, 27th Floor\n10036,New York,USA\n", "FullTimeEmployees": "0", "FiscalYearEnd": "December", "LatestQuarter": "0000-00-00", "MarketCapitalization": "26526708", "EBITDA": "None", "PERatio": "None", "PEGRatio": "0", "BookValue": "1.76", "DividendPerShare": "0.08", "DividendYield": "0.0456", "EPS": "-0.549", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "8468000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "6.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0.7471", "EVToRevenue": "0", "EVToEBITDA": "58.4095", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "1.315", "200DayMovingAverage": "1.3007", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "5602", "SharesShortPriorMonth": "25249", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "2019-01-09", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}