{"Symbol": "OKSB", "AssetType": "Common Stock", "Name": "Southwest Bancorp, Inc", "Description": "Southwest Bancorp, Inc. operates as the holding company for the Bank SNB that provides commercial and retail financial services. It operates in four segments: Oklahoma Banking, Texas Banking, Kansas Banking, and Other Operations. The company offers commercial deposit and checking, money market, and other deposit accounts; and retail deposit services, including certificates of deposit, money market accounts, checking accounts, negotiable order of withdrawal accounts, savings accounts, and automated teller machine access. It also provides commercial lending services, such as commercial real estate, working capital, and construction loans; loans for small business, equipment and general business expansion, and energy companies, as well as for health care providers, businesses, and related concerns; and consumer lending services comprising residential real estate loans and mortgage banking services, personal lines of credit, automobile loans, and other installment loans. In addition, the company offers Bank SNB DirectBanker for Internet banking services; Bank SNB Digital Lockbox, an automated lockbox, document imaging, and information service for commercial customers; and personal brokerage services. As of December 31, 2016, it had 30 banking centers, including 6 located in Stillwater, Oklahoma; 9 in the Oklahoma City, Oklahoma metropolitan area; 3 in Denver, Colorado; 2 each in Tulsa, Oklahoma, San Antonio, Texas, Hutchinson, and Kansas and Wichita, Kansas; 1 each in Chickasha, Oklahoma, Austin, Texas, Dallas, Texas, and Tilden, Texas; and 1 loan production office in Denver, Colorado. The company was founded in 1894 and is headquartered in Stillwater, Oklahoma.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "608 South Main Street\n74074,Stillwater,USA\n", "FullTimeEmployees": "388", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "2.24", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "1.13", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "28.2", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}