{"Symbol": "OMER", "AssetType": "Common Stock", "Name": "Omeros Corporation", "Description": "Omeros Corporation, a biopharmaceutical company, discovers, develops, and commercializes small-molecule and protein therapeutics, and orphan indications targeting inflammation, complement-mediated diseases, disorders of the central nervous system (CNS), and immune-related diseases. It provides OMIDRIA for use in cataract surgery or intraocular lens replacement in the United States. The company's clinical programs include Narsoplimab (OMS721/MASP-2) that is in Phase III clinical trial for hematopoietic stem-cell transplant-associated thrombotic microangiopath, immunoglobulin A nephropathy, and atypical hemolytic uremic syndrome; and Phase II clinical trial to treat lupus nephritis and other renal diseases. Its clinical programs also consists of PPAR? (OMS405) that is in Phase II clinical trial to treat opioid and nicotine addiction; and PDE7 (OMS527), which is in Phase I clinical trial for treating addiction and compulsive disorders, and movement disorders. In addition, the company's preclinical programs comprise MASP-3 (OMS906) for paroxysmal nocturnal hemoglobinuria (PNH) and other alternative pathway disorders; MASP-2-small-molecule inhibitors used for the treatment of aHUS, IgAN, HSCT-TMA, and age-related macular degeneration; and MASP-3-small-molecule inhibitors to treat PNH and other alternative pathway disorders. Further, its preclinical programs include G protein-coupled receptor (GPCR) platform, including GPR174, GPR151, GPR161, and other Class A orphan GPCRs for treating immunologic, immuno-oncologic, metabolic, CNS, cardiovascular (CV), musculoskeletal, and other disorders; and antibody platform for metabolic, CV, oncologic, musculoskeletal, and other disorders. The company was incorporated in 1994 and is headquartered in Seattle, Washington.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "The Omeros Building, Seattle, WA, United States, 98119", "FullTimeEmployees": "258", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "740091712", "EBITDA": "-81135000", "PERatio": "None", "PEGRatio": "-0.17", "BookValue": "-2.648", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-2.08", "RevenuePerShareTTM": "1.922", "ProfitMargin": "-1.0765", "OperatingMarginTTM": "-0.8587", "ReturnOnAssetsTTM": "-0.6713", "ReturnOnEquityTTM": "0", "RevenueTTM": "100340000", "GrossProfitTTM": "39981000", "DilutedEPSTTM": "-2.069", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.494", "AnalystTargetPrice": "35.6", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "6.0922", "PriceToBookRatio": "0", "EVToRevenue": "8.9768", "EVToEBITDA": "0", "Beta": "1.7599", "52WeekHigh": "20.6", "52WeekLow": "8.5", "50DayMovingAverage": "13.7169", "200DayMovingAverage": "14.1681", "SharesOutstanding": "61418400", "SharesFloat": "48253108", "SharesShort": "10919810", "SharesShortPriorMonth": "10942464", "ShortRatio": "5.46", "ShortPercentOutstanding": "0.18", "ShortPercentFloat": "0.1862", "PercentInsiders": "5.392", "PercentInstitutions": "54.514", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:1", "LastSplitDate": "2009-10-02"}