{"Symbol": "ORBK", "AssetType": "Common Stock", "Name": "Orbotech Ltd", "Description": "Orbotech Ltd. provides yield-enhancing and process-enabling solutions for the manufacture of printed circuit boards (PCBs), flat panel displays (FPDs), semiconductor devices (SDs), and other electronic components in China, Taiwan, North America, Europe, Japan, Korea, and internationally. It operates through three segments: Production Solutions for the Electronics Industry, Solar Energy, and Recognition Software. The company designs, develops, manufactures, markets, and services direct imaging, automated optical inspection (AOI), automated optical shaping, via formation laser drilling tools, additive printing solutions, and other production systems used in the manufacture of PCBs; AOI, test, repair, and process monitoring systems for use in the manufacture of FPDs; and etch, physical vapor deposition, chemical vapor deposition, and molecular vapor deposition equipment used in the manufacture of SDs, such as micro-electro-mechanical systems, advanced semiconductor packaging, power and radio frequency devices, and high brightness light emitting diode devices. It is also involved in the research, development, and marketing of products for the deposition of thin film coating of various materials on crystalline silicon photovoltaic wafers for solar energy panels. In addition, the company develops and markets check processing and healthcare payments automation solutions to banks, financial, and other payment processing institutions and healthcare providers through system integrators and solution providers. The company was formerly known as Optrotech Ltd. and changed its name to Orbotech Ltd. as a result of its merger with Orbot Systems Ltd. in October 1992. Orbotech Ltd. was founded in 1981 and is headquartered in Yavne, Israel.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "7 Sanhedrin Boulevard\n81101,Yavne,ISR\n", "FullTimeEmployees": "2634", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "1.05", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "66.01", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}