{"Symbol": "OSBC", "AssetType": "Common Stock", "Name": "Old Second Bancorp, Inc", "Description": "Old Second Bancorp, Inc. operates as the bank holding company for Old Second National Bank that provides a range of banking services. The company provides demand, NOW, money market, savings, time deposit, individual retirement, and checking accounts, as well as certificate of deposit accounts. It also offers commercial loans; lease financing receivables; commercial real estate loans; construction loans; residential real estate loans, such as residential first mortgage and second mortgage loans; home equity line of credit; consumer loans, including motor vehicle, home improvement, and signature loans; installment and agricultural loans; residential mortgages; and overdraft checking. In addition, the company provides safe deposit services; trust and wealth management services; and money orders, cashier's checks, foreign currency, direct deposits, discount brokerage, debit and credit cards, and other services, as well as acquires the U.S. treasury notes and bonds. Further, it offers online and mobile banking; corporate cash management products, including remote and mobile deposits capture, investment sweep accounts, zero balance accounts, automated tax payments, automatic teller machines access, telephone banking, lockbox accounts, automated clearing house transactions, account reconciliation, controlled disbursement, detail and general information reporting, foreign and domestic wire transfers, and vault services for currency and coin; and investment, agency, and custodial services for individual, corporate, and not-for-profit clients. The company operates through 29 banking centers in Cook, DeKalb, DuPage, Kane, Kendall, LaSalle, and Will counties in Illinois. Old Second Bancorp, Inc. was founded in 1981 and is headquartered in Aurora, Illinois.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "37 South River Street, Aurora, IL, United States, 60507", "FullTimeEmployees": "535", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "245295296", "EBITDA": "None", "PERatio": "7.8058", "PEGRatio": "2.6", "BookValue": "9.548", "DividendPerShare": "0.04", "DividendYield": "0.005", "EPS": "1.031", "RevenuePerShareTTM": "4.013", "ProfitMargin": "0.2607", "OperatingMarginTTM": "0.3443", "ReturnOnAssetsTTM": "0.0112", "ReturnOnEquityTTM": "0.1157", "RevenueTTM": "119782000", "GrossProfitTTM": "130087000", "DilutedEPSTTM": "1.031", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.038", "AnalystTargetPrice": "10.5", "TrailingPE": "7.8058", "ForwardPE": "9.9305", "PriceToSalesRatioTTM": "1.8299", "PriceToBookRatio": "0.8421", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.4835", "52WeekHigh": "13.77", "52WeekLow": "6", "50DayMovingAverage": "8.0794", "200DayMovingAverage": "8.1641", "SharesOutstanding": "29589300", "SharesFloat": "26461748", "SharesShort": "437549", "SharesShortPriorMonth": "269711", "ShortRatio": "4.25", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0109", "PercentInsiders": "5.27", "PercentInstitutions": "71.243", "ForwardAnnualDividendRate": "0.04", "ForwardAnnualDividendYield": "0.005", "PayoutRatio": "0.0388", "DividendDate": "2020-08-10", "ExDividendDate": "2020-07-30", "LastSplitFactor": "2:1", "LastSplitDate": "2004-07-29"}