{"Symbol": "OSUR", "AssetType": "Common Stock", "Name": "OraSure Technologies, Inc", "Description": "OraSure Technologies, Inc., together with its subsidiaries, develops, manufactures, markets, and sells oral fluid diagnostic products and specimen collection devices in the United States, Europe, and internationally. The company operates in two segments, OSUR and DNAG. The company also offers other diagnostic products, such as immunoassays and other in vitro diagnostic tests. The company's principal products include OraQuick Rapid HIV test, OraQuick In-Home HIV test, OraQuick HIV self-test, OraQuick HCV rapid antibody test, OraQuick Ebola rapid antigen test, and OraSure QuickFlu Rapid Flu A&B test; OraSure oral fluid collection device used in conjunction with screening and confirmatory tests for HIV-1 antibodies; tuberculosis products; Intercept drug testing systems; immunoassay tests and reagents; and Q.E.D. saliva alcohol test. It also offers genomic products under the Oragene and ORAcollect brands; microbiome collection products; and GenoFIND services, a suite of genomic services. In addition, the company manufactures and sells kits that are used to collect, stabilize, transport, and store samples of genetic material for molecular testing in the consumer genetic, clinical genetic, academic research, pharmacogenomics, personalized medicine, microbiome, and animal genetics markets. Further, it provides medical devices for the removal of benign skin lesions by cryosurgery or freezing; immunoassay tests and reagents for insurance risk assessment, substance abuse testing, and forensic toxicology applications; an oral fluid Western blot confirmatory test for confirming positive HIV-1 test; and Q.E.D. rapid point-of-care saliva alcohol test. The company markets its products to clinical laboratories, hospitals, clinics, community-based organizations and other public health organizations, distributors, government agencies, physicians' offices, and commercial and industrial entities. OraSure Technologies, Inc. was founded in 2000 and is based in Bethlehem, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Medical Instruments & Supplies", "Address": "220 East First Street, Bethlehem, PA, United States, 18015", "FullTimeEmployees": "472", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "836517696", "EBITDA": "14129000", "PERatio": "51.35", "PEGRatio": "2.3", "BookValue": "5.346", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.2", "RevenuePerShareTTM": "2.356", "ProfitMargin": "-0.0157", "OperatingMarginTTM": "-0.0655", "ReturnOnAssetsTTM": "-0.0161", "ReturnOnEquityTTM": "-0.0069", "RevenueTTM": "147352992", "GrossProfitTTM": "94322000", "DilutedEPSTTM": "-0.037", "QuarterlyEarningsGrowthYOY": "0.615", "QuarterlyRevenueGrowthYOY": "-0.243", "AnalystTargetPrice": "18.57", "TrailingPE": "51.35", "ForwardPE": "0", "PriceToSalesRatioTTM": "4.9376", "PriceToBookRatio": "2.1612", "EVToRevenue": "3.9276", "EVToEBITDA": "66.8053", "Beta": "0.6769", "52WeekHigh": "19.75", "52WeekLow": "5.23", "50DayMovingAverage": "15.2519", "200DayMovingAverage": "12.001", "SharesOutstanding": "71558400", "SharesFloat": "66545774", "SharesShort": "5119168", "SharesShortPriorMonth": "4043709", "ShortRatio": "3.1", "ShortPercentOutstanding": "0.09", "ShortPercentFloat": "0.1038", "PercentInsiders": "1.661", "PercentInstitutions": "93.688", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "3:1", "LastSplitDate": "1987-04-08"}