{"Symbol": "OTEX", "AssetType": "Common Stock", "Name": "Open Text Corporation", "Description": "Open Text Corporation provides a suite of software products and services. The company offers content services; business network that manages and connects data within the organization; Cyber Resilience, a solution for defending against cyber threats and preparing for business continuity and response in the event of a breach; OpenText security solutions that addresses information security and digital investigations; AI and analytics that leverages structured or unstructured data; and OpenText Information Management software platform that provides multi-level, multi-role, and multi context security information platforms. It also offers digital process automation, which enables organizations to transform into digital data-driven businesses through automation; Customer Experience Management, a set of processes used to track customer interactions throughout the customer journey; and Discovery suite that provides forensics and unstructured data analytics for searching, collecting, and investigating enterprise data to manage legal obligations and risk. In addition, the company offers customer support programs that include access to software upgrades, a knowledge base, discussions, product information, and an online mechanism to post and review trouble tickets. Further, it provides professional services, such as consulting and learning services relating to the implementation, training, and integration of its licensed product offerings, as well as cloud services. The company serves organizations, enterprise companies, mid-market companies, and public sector agencies worldwide. It has strategic partnerships with SAP SE, Microsoft Corporation, Oracle Corporation, Salesforce.com Corporation, Google Cloud, Amazon AWS, Accenture plc, Deloitte Consulting LLP, Tata Consultancy Services, ATOS, ATOS International S.A.S., Capgemini Technology Services SAS, and Cognizant Technology Solutions U.S. Corp. The company was founded in 1991 and is headquartered in Waterloo, Canada.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "275 Frank Tompa Drive, Waterloo, ON, Canada, N2L 0A1", "FullTimeEmployees": "14400", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "12535190528", "EBITDA": "910915008", "PERatio": "52.6395", "PEGRatio": "0.87", "BookValue": "14.767", "DividendPerShare": "0.7", "DividendYield": "0.0152", "EPS": "0.86", "RevenuePerShareTTM": "11.482", "ProfitMargin": "0.0753", "OperatingMarginTTM": "0.1935", "ReturnOnAssetsTTM": "0.0414", "ReturnOnEquityTTM": "0.0594", "RevenueTTM": "3109735936", "GrossProfitTTM": "2311678000", "DilutedEPSTTM": "0.86", "QuarterlyEarningsGrowthYOY": "-0.662", "QuarterlyRevenueGrowthYOY": "0.106", "AnalystTargetPrice": "51.67", "TrailingPE": "52.6395", "ForwardPE": "15.1057", "PriceToSalesRatioTTM": "3.957", "PriceToBookRatio": "3.0728", "EVToRevenue": "4.8464", "EVToEBITDA": "14.408", "Beta": "0.7165", "52WeekHigh": "47.845", "52WeekLow": "29.115", "50DayMovingAverage": "44.3767", "200DayMovingAverage": "40.9865", "SharesOutstanding": "271876000", "SharesFloat": "267043949", "SharesShort": "6136360", "SharesShortPriorMonth": "6274431", "ShortRatio": "9.84", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0214", "PercentInsiders": "1.791", "PercentInstitutions": "74.513", "ForwardAnnualDividendRate": "0.7", "ForwardAnnualDividendYield": "0.0152", "PayoutRatio": "0.8121", "DividendDate": "2020-09-25", "ExDividendDate": "2020-09-03", "LastSplitFactor": "2:1", "LastSplitDate": "2017-01-25"}