{"Symbol": "OZRK", "AssetType": "Common Stock", "Name": "Bank of the Ozarks", "Description": "Bank of the Ozarks provides a range of retail and commercial banking services to businesses, individuals, and non-profit and governmental entities. The company accepts non-interest bearing checking, interest bearing transaction, business sweep, savings, money market, individual retirement, and other accounts, as well as time deposits. Its loan products include real estate loans, such as loans secured by residential 1-4 family, non-farm/non-residential, agricultural, construction/land development, multifamily residential properties, and other land loans; small business and consumer loans; indirect consumer marine and RV loans; and government guaranteed loans comprising SBA and FSA guaranteed loans. The company's loan products also consist of commercial and industrial loans, and leases; and agricultural loans, including loans to businesses or individuals engages in the production of timber, poultry, livestock, or crops. In addition, it is involved in the provision of mortgage lending; treasury management services, such as wholesale lock box services; remote deposit capture services; and trust and wealth management services comprising financial planning, money management, custodial, and corporate trust services, as well as real estate development and corporate aircraft businesses. Further, the company provides real estate appraisals; ATMs; telephone banking; online and mobile banking services consisting of electronic bill pay and mobile deposits; debit, gift, and credit cards; safe deposit boxes; investment securities services; and other products and services, as well as processes merchant debit and credit card transactions. As of December 31, 2017, it operated through 253 offices in Arkansas, Georgia, Florida, North Carolina, Texas, Alabama, South Carolina, California, New York, and Mississippi. Bank of the Ozarks was founded in 1981 and is headquartered in Little Rock, Arkansas.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "2400", "FiscalYearEnd": "December", "LatestQuarter": "2018-03-31", "MarketCapitalization": "5327506944", "EBITDA": "None", "PERatio": "11.7963", "PEGRatio": "1.28", "BookValue": "27.421", "DividendPerShare": "0.8", "DividendYield": "0.0171", "EPS": "2.93", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "913195000", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "52.15", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "41.24", "52WeekLow": "0", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}