{"Symbol": "PACB", "AssetType": "Common Stock", "Name": "Pacific Biosciences of California, Inc", "Description": "Pacific Biosciences of California, Inc. designs, develops, and manufactures sequencing systems to resolve genetically complex problems. Its single molecule real-time (SMRT) sequencing technology enables single molecule real-time detection of biological processes. The company also provides consumable products, including SMRT cells, as well as various reagent kits designed for specific workflow such as template preparation to convert DNA into SMRTbell double-stranded DNA library formats including molecular biology reagents, such as ligase, buffers and exonucleases. In addition, it provides binding kits, such as modified DNA polymerase used to bind SMRTbell libraries to the polymerase in preparation for sequencing; and sequencing kits comprises reagents required for on-instrument, real-time sequencing, including the phospholinked nucleotides. The company serves research institutions; commercial laboratories; genome centers; clinical, government, and academic institutions; genomics service providers; pharmaceutical companies; and agricultural companies. It markets its products through a direct sales force in North America and Europe, as well as through distribution partners in Asia, Europe, the Middle East, Africa, and Latin America. Pacific Biosciences has collaboration with Asuragen to develop assays for carrier screening and other applications based on SMRT sequencing technology and AmplideX PCR chemistry. The company was formerly known as Nanofluidics, Inc. and changed its name to Pacific Biosciences of California, Inc. in 2005. Pacific Biosciences of California, Inc. was founded in 2000 and is headquartered in Menlo Park, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Diagnostics & Research", "Address": "1305 O?Brien Drive, Menlo Park, CA, United States, 94025", "FullTimeEmployees": "404", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1132986624", "EBITDA": "-88617000", "PERatio": "None", "PEGRatio": "-0.17", "BookValue": "0.268", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.753", "RevenuePerShareTTM": "0.539", "ProfitMargin": "-0.6185", "OperatingMarginTTM": "-1.0684", "ReturnOnAssetsTTM": "-0.2868", "ReturnOnEquityTTM": "-0.8714", "RevenueTTM": "82520000", "GrossProfitTTM": "34576000", "DilutedEPSTTM": "-0.333", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "-0.306", "AnalystTargetPrice": "6.33", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "11.7276", "PriceToBookRatio": "26.9878", "EVToRevenue": "12.6161", "EVToEBITDA": "0", "Beta": "1.683", "52WeekHigh": "6.73", "52WeekLow": "2.2", "50DayMovingAverage": "4.8194", "200DayMovingAverage": "3.8137", "SharesOutstanding": "176752992", "SharesFloat": "151272786", "SharesShort": "17852546", "SharesShortPriorMonth": "16071981", "ShortRatio": "8.15", "ShortPercentOutstanding": "0.1", "ShortPercentFloat": "0.1045", "PercentInsiders": "4.333", "PercentInstitutions": "87.943", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}