{"Symbol": "PATK", "AssetType": "Common Stock", "Name": "Patrick Industries, Inc", "Description": "Patrick Industries, Inc. manufactures and distributes building products and materials for the recreational vehicle, marine, manufactured housing, and industrial markets in the United States and Canada. Its Manufacturing segment manufactures and sells furniture, shelving, walls, countertops, and cabinet products; cabinet doors, fiberglass bath fixtures, and tile systems; hardwood furniture, vinyl printing, solid surface, granite, and quartz countertop fabrication products; RV paintings; fabricated aluminum products; decorative vinyl and paper laminated panels; fiberglass and plastic components; softwoods lumber; custom cabinets; polymer-based flooring products; and electrical systems and components, including instrument and dash panels, and other products. This segment also provides wrapped vinyl, paper, and hardwood profile moldings; interior passage doors; slide-out trim and fascia products; thermoformed shower surrounds; specialty bath and closet building products; fiberglass and plastic helm systems and components; wiring and wire harnesses; aluminum fuel tanks; boat covers, towers, tops, and frames; CNC molds and composite parts; and slotwall panels and components. The company's Distribution segment distributes pre-finished wall and ceiling panels, drywall and drywall finishing products, electronics, audio systems components, appliances, wiring products, electrical and plumbing products, cement siding products, raw and processed lumber, fiber reinforced polyester products, interior passage doors, roofing products, laminate and ceramic flooring products, shower doors, furniture, fireplaces and surrounds, interior and exterior lighting products, and other products. This segment also offers transportation and logistics services. It offers its products through a network of manufacturing and distribution centers. The company was founded in 1959 and is headquartered in Elkhart, Indiana.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Consumer Cyclical", "Industry": "Recreational Vehicles", "Address": "107 West Franklin Street, Elkhart, IN, United States, 46515", "FullTimeEmployees": "7500", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1394963200", "EBITDA": "191559008", "PERatio": "21.5385", "PEGRatio": "1.88", "BookValue": "21.036", "DividendPerShare": "1", "DividendYield": "0.017", "EPS": "2.733", "RevenuePerShareTTM": "92.794", "ProfitMargin": "0.0297", "OperatingMarginTTM": "0.0584", "ReturnOnAssetsTTM": "0.055", "ReturnOnEquityTTM": "0.1328", "RevenueTTM": "2128923008", "GrossProfitTTM": "422871000", "DilutedEPSTTM": "2.733", "QuarterlyEarningsGrowthYOY": "-0.975", "QuarterlyRevenueGrowthYOY": "-0.308", "AnalystTargetPrice": "80.67", "TrailingPE": "21.5385", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.6404", "PriceToBookRatio": "2.7952", "EVToRevenue": "0.9595", "EVToEBITDA": "10.6388", "Beta": "2.4412", "52WeekHigh": "69.84", "52WeekLow": "16.7", "50DayMovingAverage": "64.0944", "200DayMovingAverage": "50.1912", "SharesOutstanding": "23448700", "SharesFloat": "22027498", "SharesShort": "1184067", "SharesShortPriorMonth": "1188290", "ShortRatio": "5.45", "ShortPercentOutstanding": "0.05", "ShortPercentFloat": "0.0587", "PercentInsiders": "6.007", "PercentInstitutions": "96.402", "ForwardAnnualDividendRate": "1", "ForwardAnnualDividendYield": "0.017", "PayoutRatio": "0.2747", "DividendDate": "2020-09-14", "ExDividendDate": "2020-08-28", "LastSplitFactor": "1:1", "LastSplitDate": "2018-01-11"}