{"Symbol": "PBIB", "AssetType": "Common Stock", "Name": "Porter Bancorp, Inc", "Description": "Porter Bancorp, Inc. operates as the bank holding company for Limestone Bank, Inc. that provides a range of commercial and personal banking products and services. The company offers deposit products, including checking, savings, and term certificate accounts, as well as money market accounts and fixed rate certificates. It also provides commercial loans for equipment purchases, working capital, and other financing needs of business enterprises; and commercial real estate loans that include loans on properties occupied by borrowers and tenants, as well as construction and development loans secured by land under development, or homes and commercial buildings under construction. In addition, the company offers residential real estate loans; consumer loans; agriculture loans secured by livestock, crops, and equipment; and other loans, including loans to municipalities, loans secured by stock, and overdrafts. Further, it provides drive-through banking facilities, automatic teller machines, personalized checks, credit and debit cards, electronic funds transfers through ACH services, domestic and foreign wire transfers, and loan and deposit sweep accounts; and night depository, Internet and mobile banking, treasury management, remote deposit, cash management, and vault services. The company primarily serves small to medium-sized businesses, and business owners and employees, as well as other executives and professionals. It operates 15 banking offices in 12 counties in Kentucky. Porter Bancorp, Inc. was founded in 1902 and is headquartered in Louisville, Kentucky.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "217", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "105015808", "EBITDA": "None", "PERatio": "2.3496", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "-0.29", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "7.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}