{"Symbol": "PCBK", "AssetType": "Common Stock", "Name": "Pacific Continental Corp", "Description": "Pacific Continental Corporation operates as the bank holding company for Pacific Continental Bank that provides commercial banking, financing, mortgage lending, and other services. The company accepts various deposits, such as checking, savings, money market accounts, and time deposits. Its loan products include commercial loans for general operating purposes, acquisition of fixed assets, purchase of equipment and machinery, financing of inventory, and accounts receivable and other business purposes; U.S. small business administration loans; and construction and permanent loans for financing commercial facilities, and pre-sold custom and speculative home construction. The company?s loan products also consists of loans to dental professionals; and secured and unsecured loans for various purposes, including the purchase of automobiles, mobile homes, boats, and other recreational vehicles, as well as for home improvement, education, and personal investment purposes. It also provides merchant and card services; and wealth management services, such as individual investment advisory services, company retirement plans, employee benefits programs, mutual funds, unit investment trusts, fixed and variable annuities, fixed and variable life insurance, long term care, and disability. In addition, the company offers cash management products to businesses; and online banking, safe deposit, debit and automated teller machine cards, automated clearing house transactions, cashier?s checks, notary, remote deposit capture, and other services. It serves community-based businesses, nonprofit organizations, professional service providers, and business owners. As of December 31, 2016, the company operated 15 banking offices in Oregon and Washington, as well as 2 loan production offices in Washington and Colorado. Pacific Continental Corporation was founded in 1972 and is headquartered in Eugene, Oregon.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "111 West 7th Avenue\n97401,Eugene,USA\n", "FullTimeEmployees": "374", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "2.1", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "1.14", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "27.09", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}