{"Symbol": "PCO", "AssetType": "Common Stock", "Name": "Pendrell Corporation - Class A", "Description": "Pendrell Corporation invests in, acquires, and develops businesses with unique technologies that are protected by intellectual property (IP) rights in the United States. The company manages four IP licensing programs comprising digital media, digital cinema, wireless technologies, and memory and storage technologies. Its digital media program is supported by patents and patent applications to protect against unauthorized duplication and use of digital content transferred from a source to electronic devices. The company?s digital media licensees include manufacturers, distributors, and providers of consumer products. Its digital cinema program is supported by patents and patent applications designed to protect against unauthorized creation, duplication, and use of digital cinema content that is authored and distributed to movie theaters. The company?s digital cinema licensees include motion picture producers, motion picture distributors, and equipment vendors. Its wireless technologies program is supported by patents in cellular and digital wireless devices, and infrastructure. The company?s memory and storage technologies program is supported by patents and patent applications that cover embedded memory components and storage subsystems. Its memory and storage technologies licensees include flash memory component suppliers, solid state disk manufacturers, and device vendors. The company was formerly known as ICO Global Communications (Holdings) Limited and changed its name to Pendrell Corporation in July 2011. Pendrell Corporation was founded in 1995 and is headquartered in Kirkland, Washington.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "None", "FullTimeEmployees": "14", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "None", "EBITDA": "None", "PERatio": "None", "PEGRatio": "0", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "0.23", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "None", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}