{"Symbol": "PDFS", "AssetType": "Common Stock", "Name": "PDF Solutions, Inc", "Description": "PDF Solutions, Inc. provides proprietary software and intellectual property products for integrated circuit (IC) designs, electrical measurement hardware tools, methodologies, and professional services in the United States, Canada, China, Taiwan, France, Germany, Italy, Japan, Korea, and internationally. It offers Exensio software products, which consist of Exensio Yield that collects and stores yield data in an analysis-ready database, which enables product engineers to identify and analyze production yield, performance, reliability, and other issues; Exensio Control that provides failure detection and classification capabilities for monitoring, alarming, and controlling manufacturing tool sets; Exensio characterization software, designed to analyze the measurements collected from design-for-inspection (DFI) on-chip instruments using the eProbe tool; Exensio Test that offers data collection and analysis capability; and Exensio ALPS that provides device manufacturers with the capability to link assembly and packaging data, including fabrication and characterization data over the product life cycle. The company also provides DFI Systems, such as DFI on-chip instruments, and eProbe non-contactless E-beam tool; and Characterization Vehicle (CV) infrastructure, which includes CV test chips and pdFasTest electrical testers. In addition, it offers Software-as-a-Service, software related services, and IYR services. The company sells its technologies and services through direct sales force, service teams, and strategic alliances to integrated device manufacturers, fabless semiconductor companies, foundries, out-sourced semiconductor assembly and test, and system houses in the microprocessors, memory, graphics, image sensor solutions, and communications segments. PDF Solutions, Inc. was founded in 1992 and is headquartered in Santa Clara, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "2858 De La Cruz Boulevard, Santa Clara, CA, United States, 95050", "FullTimeEmployees": "353", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "757816960", "EBITDA": "-4589000", "PERatio": "None", "PEGRatio": "2.37", "BookValue": "5.994", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.266", "RevenuePerShareTTM": "2.67", "ProfitMargin": "-0.0712", "OperatingMarginTTM": "-0.1192", "ReturnOnAssetsTTM": "-0.028", "ReturnOnEquityTTM": "-0.0316", "RevenueTTM": "87043000", "GrossProfitTTM": "52111000", "DilutedEPSTTM": "-0.2", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.041", "AnalystTargetPrice": "31.75", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "7.7571", "PriceToBookRatio": "3.8257", "EVToRevenue": "7.6035", "EVToEBITDA": "0", "Beta": "1.7022", "52WeekHigh": "26.42", "52WeekLow": "8.61", "50DayMovingAverage": "21.4669", "200DayMovingAverage": "16.9669", "SharesOutstanding": "36521300", "SharesFloat": "27438442", "SharesShort": "797747", "SharesShortPriorMonth": "708882", "ShortRatio": "4.73", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.03", "PercentInsiders": "14.108", "PercentInstitutions": "79.567", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}