{"Symbol": "PEGA", "AssetType": "Common Stock", "Name": "Pegasystems Inc", "Description": "Pegasystems Inc. develops, markets, licenses, and supports enterprise software applications in the United States, rest of the Americas, the United Kingdom, rest of Europe, the Middle East, Africa, and the Asia-Pacific. It provides Pega Platform, an application development product for clients; and Pega Infinity, a software platform that unifies customer engagement and digital process automation. The company offers customer engagement applications, including Pega Marketing that enable enterprises to enhance customer acquisition and experiences across inbound, outbound, and paid media channels; Pega Sales Automation to automate and manage the sales process; and Pega Customer Service to anticipate customer needs, connect customers to people and systems, and automate customer interactions to evolve the customer service experience, as well as to allow enterprises to deliver interactions across channels and enhance employee productivity. It also provides digital process automation software; Pega Cloud that allows clients to develop, test, and deploy applications and the Pega Platform using an Internet-based infrastructure; and guidance and implementation, technical support, and instructor-led and online training services. It primarily markets its software and services to financial services, healthcare, manufacturing and high tech, communications and media, insurance, government, consumer services, and life sciences markets through a direct sales force, as well as partnerships with technology providers and application developers. Pegasystems Inc. was founded in 1983 and is headquartered in Cambridge, Massachusetts.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Technology", "Industry": "SoftwareApplication", "Address": "One Rogers Street, Cambridge, MA, United States, 02142-1209", "FullTimeEmployees": "5155", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "10371161088", "EBITDA": "-50009000", "PERatio": "None", "PEGRatio": "2.22", "BookValue": "6.917", "DividendPerShare": "0.12", "DividendYield": "0.0009", "EPS": "-0.663", "RevenuePerShareTTM": "12.379", "ProfitMargin": "-0.0766", "OperatingMarginTTM": "-0.126", "ReturnOnAssetsTTM": "-0.0638", "ReturnOnEquityTTM": "-0.1357", "RevenueTTM": "986211008", "GrossProfitTTM": "601361000", "DilutedEPSTTM": "-0.952", "QuarterlyEarningsGrowthYOY": "-0.941", "QuarterlyRevenueGrowthYOY": "0.106", "AnalystTargetPrice": "140.64", "TrailingPE": "0", "ForwardPE": "1000", "PriceToSalesRatioTTM": "10.3322", "PriceToBookRatio": "18.489", "EVToRevenue": "10.48", "EVToEBITDA": "0", "Beta": "1.2879", "52WeekHigh": "131", "52WeekLow": "38.01", "50DayMovingAverage": "112.6414", "200DayMovingAverage": "92.9706", "SharesOutstanding": "80415296", "SharesFloat": "39733177", "SharesShort": "1867341", "SharesShortPriorMonth": "1935588", "ShortRatio": "5.08", "ShortPercentOutstanding": "0.02", "ShortPercentFloat": "0.0409", "PercentInsiders": "51.078", "PercentInstitutions": "46.98", "ForwardAnnualDividendRate": "0.12", "ForwardAnnualDividendYield": "0.0009", "PayoutRatio": "0", "DividendDate": "2020-07-15", "ExDividendDate": "2020-06-30", "LastSplitFactor": "2:1", "LastSplitDate": "2014-04-02"}