{"Symbol": "PERY", "AssetType": "Common Stock", "Name": "Perry Ellis International, Inc", "Description": "Perry Ellis International, Inc. designs, sources, markets, and licenses apparel products, accessories, and fragrances. It operates through four segments: Men's Sportswear and Swim, Women's Sportswear, Direct-to-Consumer, and Licensing. It provides men's wear, including career and casual sportswear, golf apparel, sports apparel, swimwear, and activewear; and womenswear, such as dresses, sportswear, swimwear, and activewear. It also provides sweaters, dress pants, casual pants and shorts, jeans wear, and dresses. The company offers its products under various brands comprising Perry Ellis, An Original Penguin by Munsingwear, Ben Hogan, Cubavera, Farah, Grand Slam, Jantzen, Laundry by Shelli Segal, Rafaella, Savane, John Henry, Manhattan, and Axist. It also licenses the Callaway Golf, PGA TOUR, and Jack Nicklaus brands for golf apparel; the Nike and Jag brands for swimwear and accessories; and Guy Harvey for performance fishing and resort wear, as well as Gotcha, Manhattan, and Pro Player brands. The company distributes its products to wholesale customers that represent various levels of retail distribution that include luxury stores, department stores, national and regional chain stores, mass merchants, specialty stores, sporting goods stores, the corporate wear market, and e-commerce, as well as clubs and independent retailers. As of March 1, 2018, it operated 36 Perry Ellis, 15 Original Penguin, and 2 multi-brand retail outlet stores located primarily in upscale retail outlet malls in the United States, the United Kingdom, and Puerto Rico; and 2 Perry Ellis, 2 Cubavera, 7 Original Penguin, and 2 multi-brand full price retail stores located in upscale demographic markets in the United States and the United Kingdom. The company was formerly known as Supreme International Corporation and changed its name to Perry Ellis International, Inc. in 1999. Perry Ellis International, Inc. was founded in 1967 and is headquartered in Miami, Florida.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "3000 NW 107th Avenue\n33172,Miami,USA\n", "FullTimeEmployees": "2400", "FiscalYearEnd": "February", "LatestQuarter": "None", "MarketCapitalization": "421173504", "EBITDA": "46918000", "PERatio": "8.5616", "PEGRatio": "0.89", "BookValue": "25.242", "DividendPerShare": "None", "DividendYield": "None", "EPS": "1.14", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "28", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}