{"Symbol": "PESI", "AssetType": "Common Stock", "Name": "Perma-Fix Environmental Services, Inc", "Description": "Perma-Fix Environmental Services, Inc., through its subsidiaries, operates as an environmental and technology know-how company in the United States. It operates in three segments: Treatment, Services, and Medical. The Treatment segment offers nuclear, low-level radioactive, mixed waste, hazardous and non-hazardous waste treatment, and processing and disposal services through treatment and storage facilities. This segment is also involved in the research and development activities to identify, develop, and implement waste processing techniques for problematic waste streams. The Services segment provides technical services, including professional radiological measurement and site survey of large government and commercial installations; integrated occupational safety and health services; and consulting, engineering, project and waste management, environmental, decontamination and decommissioning (D&D) field, technical, on-site waste management services, and management personnel and services. This segment also offers nuclear services, including technology-based services comprising engineering, D&D, specialty, construction, logistics, transportation, processing, and disposal; offers remediation of nuclear licensed and federal facilities, as well as cleanup of nuclear legacy sites; and owns an equipment calibration and maintenance laboratory that services, maintains, calibrates, and sources health physics, industrial hygiene, and customized nuclear, environmental, and occupational safety and health instrumentation, as well as laboratory for analysis of oil and gas industry solids and liquids. The Medical segment is involved in the research and development of medical isotope production technology. The company provides its services to research institutions, commercial companies, public utilities, and governmental agencies through direct sales to customers or through intermediaries. Perma-Fix Environmental Services, Inc. was founded in 1990 and is based in Atlanta, Georgia.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Waste Management", "Address": "8302 Dunwoody Place, Atlanta, GA, United States, 30350", "FullTimeEmployees": "308", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "89870784", "EBITDA": "6547000", "PERatio": "19.2632", "PEGRatio": "0", "BookValue": "2.672", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.339", "RevenuePerShareTTM": "7.56", "ProfitMargin": "0.045", "OperatingMarginTTM": "0.0561", "ReturnOnAssetsTTM": "0.0474", "ReturnOnEquityTTM": "0.1571", "RevenueTTM": "91523000", "GrossProfitTTM": "15914000", "DilutedEPSTTM": "0.339", "QuarterlyEarningsGrowthYOY": "-0.362", "QuarterlyRevenueGrowthYOY": "0.287", "AnalystTargetPrice": "5", "TrailingPE": "19.2632", "ForwardPE": "0", "PriceToSalesRatioTTM": "0.977", "PriceToBookRatio": "2.7413", "EVToRevenue": "1.0362", "EVToEBITDA": "14.091", "Beta": "1.25", "52WeekHigh": "9.98", "52WeekLow": "3.64", "50DayMovingAverage": "6.9478", "200DayMovingAverage": "6.2178", "SharesOutstanding": "12144700", "SharesFloat": "10780518", "SharesShort": "18815", "SharesShortPriorMonth": "22896", "ShortRatio": "0.57", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.002", "PercentInsiders": "6.966", "PercentInstitutions": "47.103", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "1:5", "LastSplitDate": "2013-10-15"}