{"Symbol": "PETX", "AssetType": "Common Stock", "Name": "Aratana Therapeutics, Inc", "Description": "Aratana Therapeutics, Inc., a pet therapeutics company, focuses on the licensing, development, and commercialization of therapeutics for dogs and cats in the United States. Its product portfolio includes small molecule therapeutics and therapeutic candidates. The company markets NOCITA, a post-operative analgesia for cranial cruciate ligament surgery in dogs; ENTYCE for appetite stimulation in dogs; GALLIPRANT for the control of pain and inflammation associated with osteoarthritis in dogs; and canine osteosarcoma vaccine, live listeria vector for the treatment of dogs diagnosed with osteosarcoma in the United States. It is also developing NOCITA, a bupivacaine liposome injectable suspension for post-operative pain in cats; AT-002, a specific formulation of capromorelin for use in cats; AT-018, an oral CRTH2 antagonist for the treatment of atopic dermatitis in dogs; AT-006, an anti-viral eprociclovir that is used for the treatment of feline herpes virus-induced ophthalmic conditions in cats; AT-016, allogeneic adipose-derived stem cells for dogs; and AT-019, an EP4 receptor antagonist therapeutic candidate with potential in pain, inflammation, and other indications. In addition, the company develops AT-008, a therapeutic candidate for treating canine lymphoma in dogs; and other therapeutics for dogs and cats in Europe. It has collaboration agreement with Elanco Animal Health, Inc. to develop, manufacture, and commercialize GRAPIPRANT products; Pacira Pharmaceuticals, Inc. to develop and commercialization of licensed animal health products for NOCITA; and AskAt Inc for the development and commercialization of compound AT-019. Aratana Therapeutics, Inc. was founded in 2010 and is headquartered in Leawood, Kansas. As of July 18, 2019, Aratana Therapeutics, Inc. operates as a subsidiary of Elanco Animal Health Incorporated.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "11400 Tomahawk Creek Parkway, Suite 340\n66211,Leawood,USA\n", "FullTimeEmployees": "83", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "241093280", "EBITDA": "None", "PERatio": "None", "PEGRatio": "-0.4", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "0", "EPS": "None", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}