{"Symbol": "PFBC", "AssetType": "Common Stock", "Name": "Preferred Bank", "Description": "Preferred Bank provides various commercial banking products and services to small and mid-sized businesses and their owners, entrepreneurs, real estate developers and investors, professionals, and high net worth individuals in the United States. The company accepts checking, savings, and money market deposit accounts; fixed-rate and fixed maturity retail, and non-retail certificates of deposit; and individual retirement accounts. It also provides real estate mortgage loans that are secured by retail, industrial, office, special purpose, and residential single and multi-family properties; real estate construction loans; and commercial loans comprising lines of credit for working capital and term loans for capital expenditures, as well as equipment financing. In addition, the company offers trade finance services, including commercial and export letters of credit, import lines of credit, documentary collections, international wire transfers, export financing, bills purchase programs, and acceptances/trust receipt financing products, as well as standby letters of credit, and foreign exchange services for importers and exporters. Further, it provides various high-wealth banking services to wealthy individuals residing in the Pacific Rim area; and remote deposit capture, and online and mobile banking services. Additionally, the company offers various banking services to physicians, accountants, attorneys, business managers, and other professionals; and safe deposit boxes, account reconciliation, courier service, and cash management services to the manufacturing, service, and distribution companies. As of December 31, 2019, it had thirteen full-service branch offices in Alhambra, Arcadia, Century City, City of Industry, Diamond Bar, Los Angeles, Pico Rivera, San Francisco, Tarzana, Torrance, and Irvine, California; and Flushing, New York. The company was founded in 1991 and is headquartered in Los Angeles, California.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "601 South Figueroa Street, Los Angeles, CA, United States, 90017", "FullTimeEmployees": "279", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "562100672", "EBITDA": "None", "PERatio": "7.9135", "PEGRatio": "1.83", "BookValue": "32.814", "DividendPerShare": "1.2", "DividendYield": "0.032", "EPS": "4.732", "RevenuePerShareTTM": "10.237", "ProfitMargin": "0.4656", "OperatingMarginTTM": "0.6621", "ReturnOnAssetsTTM": "0.0153", "ReturnOnEquityTTM": "0.1513", "RevenueTTM": "152724992", "GrossProfitTTM": "162947000", "DilutedEPSTTM": "4.732", "QuarterlyEarningsGrowthYOY": "-0.215", "QuarterlyRevenueGrowthYOY": "-0.145", "AnalystTargetPrice": "39.8", "TrailingPE": "7.9135", "ForwardPE": "8.0321", "PriceToSalesRatioTTM": "3.2402", "PriceToBookRatio": "1.1462", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "1.3841", "52WeekHigh": "63.41", "52WeekLow": "20.04", "50DayMovingAverage": "39.0122", "200DayMovingAverage": "39.7889", "SharesOutstanding": "14933600", "SharesFloat": "13574168", "SharesShort": "947197", "SharesShortPriorMonth": "930062", "ShortRatio": "13.8", "ShortPercentOutstanding": "0.06", "ShortPercentFloat": "0.0666", "PercentInsiders": "8.93", "PercentInstitutions": "80.184", "ForwardAnnualDividendRate": "1.2", "ForwardAnnualDividendYield": "0.032", "PayoutRatio": "0.2532", "DividendDate": "2020-07-21", "ExDividendDate": "2020-07-06", "LastSplitFactor": "1:5", "LastSplitDate": "2011-06-20"}