{"Symbol": "PFIS", "AssetType": "Common Stock", "Name": "Peoples Financial Services Corp", "Description": "Peoples Financial Services Corp. operates as the bank holding company for Peoples Security Bank and Trust Company that provides various commercial and retail banking services. The company accepts money market, NOW, savings, individual retirement, demand deposit, and certificates of deposit accounts. It also provides residential real estate, automobile, manufactured housing, personal, and home equity loans; and commercial real estate, working capital, construction, small business administration, and agricultural loans, as well as loans for equipment and other commercial needs, and mineral rights. In addition, the company offers investment management, IRA trustee, estate administration, living and life insurance trust, trustee under will, guardianship, custodial/IRA custodial, and corporate trust services, as well as pension and profit sharing plans. Further, it provides investment portfolio management, estate and business succession planning, annuities, insurance, retirement plan, and tax planning, as well as education funding strategies; and securities and brokerage, and investor services. Additionally, the company offers small business checking and merchant money market accounts, online and telephone banking, business credit cards, merchant line of credit, and financial checkup services; and remote deposit capture, automatic clearing house transaction, cash management, automated teller machine, point of sale transaction, safe deposit box, night depository, direct deposit, and official check services. It serves business, non-profit, governmental, municipal agency, and professional customers, as well as retail customers through 28 full-service community banking offices located in Lackawanna, Lebanon, Lehigh, Luzerne, Monroe, Montgomery, Northampton, Susquehanna, Wayne, and Wyoming Counties of Pennsylvania, as well as Broome County of New York. Peoples Financial Services Corp. was founded in 1905 and is headquartered in Scranton, Pennsylvania.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "BanksRegional", "Address": "150 North Washington Avenue, Scranton, PA, United States, 18503", "FullTimeEmployees": "408", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "272793664", "EBITDA": "None", "PERatio": "11.1416", "PEGRatio": "0", "BookValue": "42.554", "DividendPerShare": "1.44", "DividendYield": "0.0381", "EPS": "3.39", "RevenuePerShareTTM": "11.263", "ProfitMargin": "0.3014", "OperatingMarginTTM": "0.374", "ReturnOnAssetsTTM": "0.01", "ReturnOnEquityTTM": "0.083", "RevenueTTM": "83080000", "GrossProfitTTM": "84533000", "DilutedEPSTTM": "3.39", "QuarterlyEarningsGrowthYOY": "0.073", "QuarterlyRevenueGrowthYOY": "-0.018", "AnalystTargetPrice": "None", "TrailingPE": "11.1416", "ForwardPE": "0", "PriceToSalesRatioTTM": "2.997", "PriceToBookRatio": "0.8817", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "0.2681", "52WeekHigh": "53.88", "52WeekLow": "29.01", "50DayMovingAverage": "37.5986", "200DayMovingAverage": "37.6549", "SharesOutstanding": "7284210", "SharesFloat": "6694261", "SharesShort": "52411", "SharesShortPriorMonth": "27053", "ShortRatio": "5.37", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0072", "PercentInsiders": "7.725", "PercentInstitutions": "28.959", "ForwardAnnualDividendRate": "1.44", "ForwardAnnualDividendYield": "0.0381", "PayoutRatio": "0.4159", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-28", "LastSplitFactor": "3:2", "LastSplitDate": "2003-05-16"}