{"Symbol": "PFLT", "AssetType": "Common Stock", "Name": "PennantPark Floating Rate Capital Ltd", "Description": "PennantPark Floating Rate Capital Ltd. is a business development company. It seeks to make secondary direct, debt, equity, and loan investments. The fund seeks to invest through floating rate loans in private or thinly traded or small market-cap, public middle market companies. It primarily invests in the United States and to a limited extent non-U.S. companies. The fund typically invests between $2 million and $20 million. The fund also invests in equity securities, such as preferred stock, common stock, warrants or options received in connection with debt investments or through direct investments. It primarily invests between $10 million and $50 million in investments in senior secured loans and mezzanine debt. It seeks to invest in companies not rated by national rating agencies. The companies if rated would be between BB and CCC under the Standard & Poor's system. The fund invests 30% is invested in non-qualifying assets like investments in public companies whose securities are not thinly traded or do not have a market capitalization of less than $250 million, securities of middle-market companies located outside of the United States, high-yield bonds, distressed debt, private equity, securities of public companies that are not thinly traded, and investment companies as defined in the 1940 Act. Under normal conditions, the fund expects atleast 80 percent of its net assets plus any borrowings for investment purposes to be invested in Floating Rate Loans and investments with similar economic characteristics, including cash equivalents invested in money market funds. It expects to represent 65 percent of its portfolio through senior secured loans. In case of floating rate loans, it holds investments for a period of three to ten years.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Financial Services", "Industry": "Asset Management", "Address": "590 Madison Avenue, New York, NY, United States, 10022", "FullTimeEmployees": "0", "FiscalYearEnd": "September", "LatestQuarter": "2020-06-30", "MarketCapitalization": "331889184", "EBITDA": "None", "PERatio": "36.6522", "PEGRatio": "0", "BookValue": "12.157", "DividendPerShare": "1.14", "DividendYield": "0.1352", "EPS": "0.227", "RevenuePerShareTTM": "2.518", "ProfitMargin": "0.0902", "OperatingMarginTTM": "0.7438", "ReturnOnAssetsTTM": "0.0399", "ReturnOnEquityTTM": "0.018", "RevenueTTM": "97612232", "GrossProfitTTM": "92947182", "DilutedEPSTTM": "0.227", "QuarterlyEarningsGrowthYOY": "1.778", "QuarterlyRevenueGrowthYOY": "-0.005", "AnalystTargetPrice": "9.5", "TrailingPE": "36.6522", "ForwardPE": "8.1037", "PriceToSalesRatioTTM": "3.3484", "PriceToBookRatio": "0.6935", "EVToRevenue": "9.8444", "EVToEBITDA": "26.0112", "Beta": "1.7868", "52WeekHigh": "12.67", "52WeekLow": "3.34", "50DayMovingAverage": "8.4403", "200DayMovingAverage": "8.107", "SharesOutstanding": "38772100", "SharesFloat": "0", "SharesShort": "182653", "SharesShortPriorMonth": "293921", "ShortRatio": "0.65", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0.003", "PercentInsiders": "1.559", "PercentInstitutions": "37.259", "ForwardAnnualDividendRate": "1.14", "ForwardAnnualDividendYield": "0.1352", "PayoutRatio": "4.9565", "DividendDate": "2020-09-01", "ExDividendDate": "2020-08-18", "LastSplitFactor": "None", "LastSplitDate": "None"}