{"Symbol": "PGNX", "AssetType": "Common Stock", "Name": "Progenics Pharmaceuticals, Inc", "Description": "Progenics Pharmaceuticals, Inc., an oncology company, develops, manufactures, and commercializes pharmaceutical products and other technologies to target, diagnose, and treat cancer in the United States and internationally. The company's product candidates include Azedra, a radiotherapeutic product candidate for the treatment of iobenguane scan positive, unresectable, and locally advanced or metastatic pheochromocytoma or paraganglioma for adult and pediatric patients; PyL, a clinical-stage fluorinated prostate specific membrane antigen (PSMA)-targeted PET/CT imaging agent for prostate cancer; and 1095, a PSMA-targeted Iodine-131 labeled small molecule, which is in Phase II clinical trial for the treatment of metastatic castration-resistant prostate cancer. Its product candidates also comprise PSMA TTC, a thorium-227 labeled PSMA-targeted antibody therapeutic that is in Phase I clinical trial for treatment of metastatic prostate cancer; and Leronlimab, a humanized monoclonal antibody, which is in Phase III development for the treatment of HIV infection. The company also offers Relistor-subcutaneous injection for the treatment of opioid-induced constipation (OIC) in adults with chronic non-cancer pain or advanced-illness adult patients; Relistor tablets for the treatment of OIC in adults with chronic non-cancer pain; PSMA AI, an imaging analysis technology that uses artificial intelligence and machine learning to quantify and automate the reading of PSMA targeted imaging; and automated bone scan index, a software that quantifies the hotspots on bone scans and calculates the bone scan index value. It has license agreement with Salix Pharmaceuticals, Inc. for the development and commercialization of Relistor worldwide; and Amgen Fremont, Inc. to use its XenoMouse technology for generating human antibodies to PSMA. Progenics Pharmaceuticals, Inc. was founded in 1986 and is based in New York City, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Biotechnology", "Address": "One World Trade Center, New York City, NY, United States, 10007", "FullTimeEmployees": "105", "FiscalYearEnd": "December", "LatestQuarter": "2020-03-31", "MarketCapitalization": "355046048", "EBITDA": "-57739000", "PERatio": "None", "PEGRatio": "-0.03", "BookValue": "0.354", "DividendPerShare": "None", "DividendYield": "0", "EPS": "-0.928", "RevenuePerShareTTM": "0.429", "ProfitMargin": "-1.8028", "OperatingMarginTTM": "-1.6587", "ReturnOnAssetsTTM": "-0.2918", "ReturnOnEquityTTM": "-1.1689", "RevenueTTM": "36953000", "GrossProfitTTM": "31818000", "DilutedEPSTTM": "-0.774", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0.459", "AnalystTargetPrice": "6.5", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "9.5548", "PriceToBookRatio": "11.5979", "EVToRevenue": "10.2392", "EVToEBITDA": "0", "Beta": "1.9752", "52WeekHigh": "6.22", "52WeekLow": "1.89", "50DayMovingAverage": "4.3338", "200DayMovingAverage": "4.1377", "SharesOutstanding": "86596600", "SharesFloat": "68097860", "SharesShort": "5758539", "SharesShortPriorMonth": "5834742", "ShortRatio": "9.3", "ShortPercentOutstanding": "0.07", "ShortPercentFloat": "0.0927", "PercentInsiders": "9.596", "PercentInstitutions": "76.095", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}