{"Symbol": "PGTI", "AssetType": "Common Stock", "Name": "PGT Innovations, Inc", "Description": "PGT Innovations, Inc. manufactures and supplies impact-resistant residential windows and doors in the Southeastern United States, Western United States, the Gulf Coast, Coastal mid-Atlantic, the Caribbean, Central America, and Canada. It offers heavy-duty aluminum or vinyl frames with laminated glass to provide protection from hurricane-force winds and wind-borne debris; and non-impact vinyl windows with insulating glass and multi-chambered frames for various climate zones. The company also provides customizable non-impact-resistant aluminum frame windows and doors; and non-glass vertical and horizontal sliding panels for porch enclosures, including vinyl-glazed aluminum-framed products used for enclosing screened-in porches that provide protection from inclement weather, as well as cabana doors. In addition, it offers premium aluminum impact-resistant products; aluminum impact-resistant windows and doors; vinyl energy-efficient impact-resistant windows; and commercial storefront window system and entry doors. Further, it provides high-end luxury aluminum doors and windows, such as impact and non-impact sliding glass doors and terrace doors, fixed picture windows, single hung windows, and horizontal rolling windows; aluminum thermally broken doors and windows; fixed and operating windows, as well as well as sliding, folding, and hinged doors; and moving glass walls and windows. The company offers its products under the PGT, CGI, and WinDoor brands, as well as WinGuard, WinGuard Vinyl, EnergyVue, Eze-Breeze, Estate Collection, Sentinel, Estate Entrances, Commercial Series, and Targa names. It serves residential new construction, and home repair and remodeling end markets through window and building supply distributors, window replacement dealers, and enclosure contractors. The company was formerly known as PGT, Inc. and changed its name to PGT Innovations, Inc. in December 2016. PGT Innovations, Inc. was founded in 1980 and is headquartered in North Venice, Florida.", "Exchange": "NYSE", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Building Products & Equipment", "Address": "1070 Technology Drive, North Venice, FL, United States, 34275", "FullTimeEmployees": "3000", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "1103783552", "EBITDA": "124521000", "PERatio": "30.8689", "PEGRatio": "1.81", "BookValue": "7.649", "DividendPerShare": "None", "DividendYield": "0", "EPS": "0.61", "RevenuePerShareTTM": "13.573", "ProfitMargin": "0.0455", "OperatingMarginTTM": "0.1112", "ReturnOnAssetsTTM": "0.0564", "ReturnOnEquityTTM": "0.0836", "RevenueTTM": "795635968", "GrossProfitTTM": "260368000", "DilutedEPSTTM": "0.61", "QuarterlyEarningsGrowthYOY": "-0.871", "QuarterlyRevenueGrowthYOY": "0.021", "AnalystTargetPrice": "22.33", "TrailingPE": "30.8689", "ForwardPE": "0", "PriceToSalesRatioTTM": "1.3987", "PriceToBookRatio": "2.4617", "EVToRevenue": "1.8525", "EVToEBITDA": "13.5261", "Beta": "1.5016", "52WeekHigh": "20.1", "52WeekLow": "6.88", "50DayMovingAverage": "17.7533", "200DayMovingAverage": "13.9244", "SharesOutstanding": "58962800", "SharesFloat": "56474547", "SharesShort": "732401", "SharesShortPriorMonth": "827831", "ShortRatio": "1.81", "ShortPercentOutstanding": "0.01", "ShortPercentFloat": "0.0155", "PercentInsiders": "4.225", "PercentInstitutions": "96.959", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}