{"Symbol": "PINC", "AssetType": "Common Stock", "Name": "Premier, Inc", "Description": "Premier, Inc., together with its subsidiaries, operates as a healthcare improvement company in the United States. It operates through two segments, Supply Chain Services and Performance Services. The Supply Chain Services segment offers its members with access to a range of products and services, including medical and surgical products, pharmaceuticals, laboratory supplies, capital equipment, information technology, facilities and construction, and food and nutritional products, as well as purchased services, such as clinical engineering and document shredding services. It is also involved in the provision of the ASCEND Collaborative service for members to receive group purchasing programs, tiers, and prices, as well as managed services; SURPASS Collaborative service; STOCKD, an e-commerce platform; and PROVIDEGX program, which identifies supply sources for drugs that are on or may be at risk of being added to the national drug shortage list, or that are vulnerable to pricing volatility, as well as direct sourcing business. The Performance Services segment offers PremierConnect for members to address existing cost and quality imperatives, enable them manage a value-based care reimbursement model, and support their regulatory reporting framework; performance improvement collaborative; and consulting and insurance services. This segment's various PremierConnect domains include PremierConnect Quality & Regulatory, PremierConnect Clinical Surveillance & Safety, PremierConnect Supply Chain & ERP, PremierConnect Operations, PremierConnect Enterprise Analytics, and PREMIERCONNECT Clinical Decision Support domains. Premier, Inc. has a collaboration to develop a same-day breast cancer diagnosis and treatment model. The company was incorporated in 2013 and is headquartered in Charlotte, North Carolina.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Healthcare", "Industry": "Health Information Services", "Address": "13034 Ballantyne Corporate Place, Charlotte, NC, United States, 28277", "FullTimeEmployees": "2500", "FiscalYearEnd": "June", "LatestQuarter": "2020-06-30", "MarketCapitalization": "3831592960", "EBITDA": "545766016", "PERatio": "15.9926", "PEGRatio": "3.1256", "BookValue": "1.944", "DividendPerShare": "0.76", "DividendYield": "0.0234", "EPS": "2.035", "RevenuePerShareTTM": "19.387", "ProfitMargin": "0.1003", "OperatingMarginTTM": "0.3024", "ReturnOnAssetsTTM": "0.089", "ReturnOnEquityTTM": "0", "RevenueTTM": "1299591936", "GrossProfitTTM": "866801000", "DilutedEPSTTM": "2.035", "QuarterlyEarningsGrowthYOY": "0.11", "QuarterlyRevenueGrowthYOY": "0.084", "AnalystTargetPrice": "36.89", "TrailingPE": "15.9926", "ForwardPE": "14.9477", "PriceToSalesRatioTTM": "3.088", "PriceToBookRatio": "28.4104", "EVToRevenue": "3.0736", "EVToEBITDA": "7.2914", "Beta": "0.2363", "52WeekHigh": "39.7", "52WeekLow": "27.11", "50DayMovingAverage": "34.0589", "200DayMovingAverage": "32.6285", "SharesOutstanding": "121787000", "SharesFloat": "120526097", "SharesShort": "3602104", "SharesShortPriorMonth": "3546164", "ShortRatio": "9.8", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0296", "PercentInsiders": "1.254", "PercentInstitutions": "100.736", "ForwardAnnualDividendRate": "0.76", "ForwardAnnualDividendYield": "0.0234", "PayoutRatio": "0", "DividendDate": "2020-09-15", "ExDividendDate": "2020-08-31", "LastSplitFactor": "None", "LastSplitDate": "None"}