{"Symbol": "PKOH", "AssetType": "Common Stock", "Name": "Park-Ohio Holdings Corp", "Description": "Park-Ohio Holdings Corp. provides supply chain management outsourcing services, capital equipment, and manufactured components in the United States, Europe, Asia, Mexico, Canada, and internationally. It operates through three segments: Supply Technologies, Assembly Components, and Engineered Products. The Supply Technologies segment offers Total Supply Management solution, including engineering and design support, part usage and cost analysis, supplier selection, quality assurance, bar coding, product packaging and tracking, just-in-time and point-of-use delivery, electronic billing, and ongoing technical support services, as well as provides spare parts and aftermarket products; and production components, including valves, fuel hose assemblies, electro-mechanical hardware, labels, fittings, steering components, and other products. It also engineers and manufactures precision cold-formed and cold-extruded fasteners and other products, including locknuts, SPAC nuts, and wheel hardware. The Assembly Components segment manufactures aluminum products, direct fuel injection fuel rails and pipes, fuel filler pipes, and flexible multi-layer plastic and rubber assemblies; turbo charging and coolant hoses; and fluid handling systems. It also offers machining services, as well as value-added services, such as design engineering, machining, and part assembly. The Engineered Products segment designs and manufactures engineered products, including induction heating and melting systems, pipe threading systems, and forged and machined products primarily for ferrous and non-ferrous metals, silicon, coatings, forging, foundry, automotive, and construction equipment industries; engineers and installs mechanical forging presses; sells spare parts; provides field services; and offers aerospace and defense structural components, and rail products, such as railcar center plates and draft lugs. The company was founded in 1907 and is headquartered in Cleveland, Ohio.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Industrials", "Industry": "Industrial Distribution", "Address": "6065 Parkland Boulevard, Cleveland, OH, United States, 44124", "FullTimeEmployees": "7100", "FiscalYearEnd": "December", "LatestQuarter": "2020-06-30", "MarketCapitalization": "205407696", "EBITDA": "77700000", "PERatio": "45.8529", "PEGRatio": "1.09", "BookValue": "25.378", "DividendPerShare": "0.5", "DividendYield": "0.0328", "EPS": "0.359", "RevenuePerShareTTM": "112.675", "ProfitMargin": "0.0032", "OperatingMarginTTM": "0.0315", "ReturnOnAssetsTTM": "0.0213", "ReturnOnEquityTTM": "0.0136", "RevenueTTM": "1377500032", "GrossProfitTTM": "263800000", "DilutedEPSTTM": "0.359", "QuarterlyEarningsGrowthYOY": "-0.891", "QuarterlyRevenueGrowthYOY": "-0.45", "AnalystTargetPrice": "20.5", "TrailingPE": "45.8529", "ForwardPE": "14.7493", "PriceToSalesRatioTTM": "0.139", "PriceToBookRatio": "0.6495", "EVToRevenue": "0.4955", "EVToEBITDA": "6.8245", "Beta": "1.6698", "52WeekHigh": "36.11", "52WeekLow": "10.78", "50DayMovingAverage": "16.2039", "200DayMovingAverage": "17.2178", "SharesOutstanding": "12601700", "SharesFloat": "7844418", "SharesShort": "380267", "SharesShortPriorMonth": "318044", "ShortRatio": "11.39", "ShortPercentOutstanding": "0.03", "ShortPercentFloat": "0.0542", "PercentInsiders": "31.682", "PercentInstitutions": "56.119", "ForwardAnnualDividendRate": "0.5", "ForwardAnnualDividendYield": "0.0328", "PayoutRatio": "1.1029", "DividendDate": "2020-02-28", "ExDividendDate": "2020-02-13", "LastSplitFactor": "2:1", "LastSplitDate": "1981-04-06"}