{"Symbol": "PLPM", "AssetType": "Common Stock", "Name": "Planet Payment, Inc", "Description": "Planet Payment, Inc., together with its subsidiaries, provides international payment and transaction processing, and multi-currency processing services in the Asia Pacific region, the Americas, the Middle East, Africa, and Europe. The company offers payment processing services that enable the authorization and settlement of payment transactions by providing the connections between the merchant, its bank, and the card association; and online access to advanced reconciliation and reporting services, as well as localized language support to its customers. Its flagship offerings include multi-currency processing services, such as Pay in Your Currency, a point-of-sale dynamic currency conversion (DCC) service, Multi-Currency Pricing primarily for card-not-present merchants and DCC at ATMs that enable merchants to offer customized pricing in multiple currencies. The company also provides Planet Payment Gateway, which provides domestic and multi-currency processing services; global consolidated reporting that offer merchants with insights into their operations; data analytics; and commercial transaction services, which allow merchants to provide a range of commercial services, including pre-paid mobile phone top-up and bill payments using the same point-of-sale devices deployed to accept payment cards. It distributes and cross sells its services through various points-of-sale and e-commerce payment channels in the hospitality, restaurants, and retail environments. The company was formerly known as Planet Group Inc. and changed its name to Planet Payment, Inc. in June 2007. Planet Payment, Inc. was founded in 1999 and is headquartered in Long Beach, New York.", "Exchange": "NASDAQ", "Currency": "USD", "Country": "USA", "Sector": "Other", "Industry": "Other", "Address": "670 Long Beach Boulevard\n11561,Long Beach,USA\n", "FullTimeEmployees": "163", "FiscalYearEnd": "December", "LatestQuarter": "None", "MarketCapitalization": "222269360", "EBITDA": "13224641", "PERatio": "9.2769", "PEGRatio": "1.26", "BookValue": "None", "DividendPerShare": "None", "DividendYield": "None", "EPS": "0.45", "RevenuePerShareTTM": "0", "ProfitMargin": "0", "OperatingMarginTTM": "0", "ReturnOnAssetsTTM": "0", "ReturnOnEquityTTM": "0", "RevenueTTM": "0", "GrossProfitTTM": "0", "DilutedEPSTTM": "0", "QuarterlyEarningsGrowthYOY": "0", "QuarterlyRevenueGrowthYOY": "0", "AnalystTargetPrice": "5.08", "TrailingPE": "0", "ForwardPE": "0", "PriceToSalesRatioTTM": "0", "PriceToBookRatio": "0", "EVToRevenue": "0", "EVToEBITDA": "0", "Beta": "None", "52WeekHigh": "None", "52WeekLow": "None", "50DayMovingAverage": "0", "200DayMovingAverage": "0", "SharesOutstanding": "0", "SharesFloat": "0", "SharesShort": "0", "SharesShortPriorMonth": "0", "ShortRatio": "0", "ShortPercentOutstanding": "0", "ShortPercentFloat": "0", "PercentInsiders": "0", "PercentInstitutions": "0", "ForwardAnnualDividendRate": "0", "ForwardAnnualDividendYield": "0", "PayoutRatio": "0", "DividendDate": "None", "ExDividendDate": "None", "LastSplitFactor": "None", "LastSplitDate": "None"}